{"date":{"0":"Jun. 29, 2022","1":"Jun. 24, 2022","2":"Jun. 23, 2022","3":"Jun. 21, 2022","4":"Jun. 17, 2022","5":"Jun. 16, 2022","6":"Jun. 07, 2022","7":"Jun. 06, 2022","8":"May 31, 2022","9":"May 26, 2022","10":"Dec. 27, 2021","11":"Dec. 21, 2021","12":"Dec. 16, 2021","13":"Dec. 15, 2021","14":"Dec. 13, 2021","15":"Dec. 10, 2021","16":"Dec. 09, 2021","17":"Dec. 09, 2021","18":"Dec. 09, 2021","19":"Dec. 08, 2021"},"title":{"0":"LPG-fueled LPG carrier CRYSTAL OASIS Delivered","1":"RESOLUTIONS OF THE 199th ORDINARY GENERAL MEETING OF SHAREHOLDERS(2022)","2":"Bulk Carrier PHILHOKUSAI Delivered","3":"Kawasaki Receives an Order for an 86,700 m LPG-fueled LPG\/ NH3 Carrier","4":"Bulk Carrier AQUARUBY Delivered","5":"WMATA 7000 Series Railcars to Resume Service Operation (PDF:47.4K )","6":"Notice of Inappropriate Conduct by Kawasaki Thermal Engineering Co., Ltd.","7":"Kawasaki decides to issue Green Bond Contribution to global carbon neutrality by building a clean h...","8":"Kawasaki Completes World s First Basic Engineering Works for Hydrogen Marine Main Boiler","9":"THE 199th ORDINARY GENERAL MEETING OF SHAREHOLDERS (2022)","10":"Kawasaki Receives First Order from Malaysia for Cogeneration System Using Fully Made-in-Japan M5A Ga...","11":"Total Sales of PV Series Hydraulic Remote Control Valves for Construction Machinery Reach 10 Million...","12":"Kawasaki-brand Green Products 2021 were selected","13":"WMATA 7000 Series Railcars to Resume Service Operation (PDF:29.2K )","14":"New addition to the Changing forward short video series, Group Vision 2030 New Values - H2 Edition ...","15":"Kawasaki Environmental Report 2021 Issued","16":"The Kawasaki Report 2021 Issued","17":"ONE OF THE WORLD S FIRST 100% HYDROGEN-TO-POWER DEMONSTRATIONS ON INDUSTRIAL SCALE LAUNCHES IN LINGE... (PDF:341.2K )","18":"Group Vision 2030 Progress Report Meeting","19":"Kawasaki Links Up with TOMOHIROKAI to Expand PCR Test Center at Kansai International Airport-New Cli... (PDF:876.7K )"},"article":{"0":"Tokyo, June 29, 2022 Kawasaki Heavy Industries, Ltd. announced today it has delivered the 84,000 m3 capacity liquefied petroleum gas (LPG) carrier CRYSTAL OASIS (Kawasaki hull No. 1752) for KUMIAI NAVIGATION (PTE) LTD. This is the 67th LPG carrier built by the company. This vessel is a dual-fuel LPG carrier using LPG and low-sulfur fuel oil, and their fourth 84,000 m3 LPG carrier adopting a dual-fuel main engine. In recent years, in order to effectively reduce emissions of greenhouse gases from international shipping, more vessels are adopting liquefied gases as an alternative to heavy fuel oil on a global scale. This very large LPG carrier is powered by LPG, which reduces greenhouse gas emissions and is expected to significantly reduce environmental impact. It is the fruit of the Kawasaki Group s accumulated knowledge in building LPG and liquefied natural gas (LNG) carriers, and LNG-fueled vessels. Kawasaki plans to develop and build more LPG-fueled LPG carriers, LPG\/NH3 carrier, and other commercial vessels that meet environmental standards, as well as to develop and offer other eco-friendly marine technologies, to contribute to the establishment of a low-carbon\/decarbonized society. These products include vessels for transporting liquefied hydrogen, considered to be the next-generation energy source. Specifications Length overall 229.90 m Molded breadth 37.20 m Molded depth 21.90 m Molded draft 11.60 m Speed Approx. 17.0 kn Crew complement 29 Gross tonnage 49,943 T Deadweight 55,090 t Cargo tank capacity 84,244 m3 Main engine One set of Kawasaki-MAN B&W 7S60ME-C10.5-LGIP diesel engine Classification\/country of registration Nippon Kaiji Kyokai (ClassNK) \/ Singapore Delivery date June 29, 2022 Features This LPG carrier operates using both LPG and low-sulfur fuel oil. Use of LPG as fuel greatly reduces emission volumes of sulfur oxides (SOx), CO2 and other pollutants compared with use of marine fuel oil. In this way, the new vessel will meet SOx emission standards*1 which were strengthened in January 2020, and EEDI*2 Phase 3 regulations which will further strengthen CO2 emission standards. In order to satisfy restrictions on NOx Tier controls*3 emissions which is implemented by the International Maritime Organization (IMO), the main engine and generator are equipped with a Selective catalytic reduction (SCR) System, An exhaust gas purification system to reduce NOx, which allows the ship to navigate in Emission Control Area (ECA). Installation of LPG fuel tanks on the ship's upper deck makes it possible to load fuel-use LPG separate from the ship's cargo LPG. Moreover, a piping system connecting the LPG fuel tanks and LPG cargo tanks enables transferring of extra LPG to the LPG fuel tanks if necessary. This Vessel has successfully achieved very flexible and practical design through the combination of shallow draft hull form and high compatibility with terminals and their land facility as the result of complying with OCIMF Mooring Equipment Guidance 4th Edition and ExxonMobil Criteria MESQAC 2017 as practical as possible. This vessel adopts the Kawasaki rudder bulb system with fins (RBS-F) and the semi-duct system with contra fins (SDS-F) which contribute to reducing fuel consumption. Remarks *1 SOx emission standards:Since January 2015, SOx emission restrictions in North American and European emission control areas (ECAs) have limited sulfur content in fuels to 0.1% or less. Starting in January 2020, regulations have required ships operating in all other parts of the world to use fuel with sulfur content levels of 0.5% or less, or alternatively use equipment to reduce SOx in exhaust gases to an equivalent level. *2 Energy Efficiency Design Index:Compulsory international regulations requiring energy-efficiency compliance in newly built ships based on EEDI values, which specify CO2 emissions in grams for transporting one ton of cargo for one mile. EEDI regulation values apply in increasingly strict phases based on the construction-contract conclusion date and finished-ship delivery date. Phase 3 regulations (30% CO2 emissions reduction compared with baseline levels) will be introduced for certain ship types including large LPG carriers and LNG carriers contracted to be built in 2022 or later. *3 The Tier III controls apply only to the specified ships while operating in Emission Control Areas (ECA), requiring 80% NOx emissions reduction compared with Tier controls. Related Link Kawasaki Super Green Product (LPG Powered Large LPG Carrier) https:\/\/global.kawasaki.com\/en\/corp\/sustainability\/green_products\/Large_LPG_Carrier_2018.html Contact If you need more information about our business, please feel free to contact us. CONTACT","1":"Learn about Shareholders' Meeting - Kawasaki Heavy Industries, Ltd. \"Powering your potential.\"RESOLUTIONS OF THE 199th ORDINARY GENERAL MEETING OF SHAREHOLDERS The 199th Ordinary General Meeting of Shareholders of Kawasaki Heavy Industries, Ltd. was held at 10:00 a.m. on Friday June 24, 2022 in Kobe, Japan. All proposals were approved as originally proposed. We thank you for your exercising voting rights.","2":"Tokyo, June 23, 2022 Kawasaki Heavy Industries, Ltd. announced today that it delivered the bulk carrier PHILHOKUSAI, with a capacity of 61,000 DWT (Kawasaki hull No. 8083, DACKS hull No. 117) at the Dalian COSCO KHI Ship Engineering Co., Ltd. (DACKS), which is located in Dalian City, China and operated jointly with China COSCO Shipping Corporation Limited (China COSCO Shipping). Principal particulars and features of the vessel are as described below. Principal Particulars Length overall 199.90 m Molded breadth 32.24 m Molded depth 18.60 m Molded draft 13.00 m Gross tonnage 34,508 T Deadweight 61,197 t Hold capacity 77,539 m3 Main engine One set of MAN B&W 6S50ME-B9.3 diesel engine Speed Approx. 14.5 knots Complement 25 people Classification American Bureau of Shipping (ABS) Country of registration Marshall Islands Delivery June 23, 2022 Features The vessel has a flush deck with a forecastle and five holds that are designed for optimum transport of grains, coal, ores and steel products. Four 30-ton deck cranes are installed along the center in between the hatch covers to enable cargo loading and unloading in ports that lack cargo handling facilities. The vessel employs various technologies to achieve maximum fuel economy, including an energy-saving, electronically-controlled main diesel engine, high propulsive efficiency propellers, and the Kawasaki rudder bulb system with fins (RBS-F) and semi-duct system with contra fins (SDS-F), which all contribute to the vessel s enhanced propulsion performance. Contact If you need more information about our business, please feel free to contact us. CONTACT","3":"Kawasaki Receives an Order for an 86,700 m LPG-fueled LPG\/ NH3 Carrier TTokyo, June 21, 2022 Kawasaki Heavy Industries, Ltd. announced today that it has concluded a shipbuilding contract for an 86,700 m3 liquefied petroleum gas (LPG) and liquefied ammonia gas (NH3) carrier powered by LPG fuel for KUMIAI NAVIGATION PTE LTD. The contract also provides an option to order another one vessel. This is the first LPG\/NH3 carrier for KUMIAI NAVIGATION PTE LTD. The vessel is equipped with separate cargo tanks designed to carry LPG and NH3 at the same time. This contract represents their 77th LPG carrier, 14th LPG-fueled LPG carrier and 7th LPG\/NH3 carrier to be constructed by Kawasaki. Kawasaki plans to complete the construction of the vessels at its Sakaide Works in 2025. The advantage of this dual-purpose vessel is its capability to simultaneously carry LPG, which is already used as a low-carbon energy source, and NH3, a new fuel contributing to the establishment of a decarbonized society. Another feature is the greater capacity of the cargo tanks as compared to conventional carriers, which was achieved without significantly changing the vessel s length, breadth, or other main specifications. Fueled by low-sulfur fuel oil and LPG (which significantly reduces the emission volumes of sulfur oxides [SOx], CO , and other pollutants in the exhaust gases as compared to marine fuel oil), the vessel meets SOx emission standards set by the International Maritime Organization (IMO)*1, as well as the IMO s Energy Efficiency Design Index (EEDI)*2 Phase 3 regulations, which are applicable to adopt stricter CO emission standards in 2022. In addition, the vessel is equipped with a shaft generator that converts the rotational energy of the main engine into electric power. This enables the vessel to stop all the diesel generators under the normal sea-going condition. To meet environmental standards being tightened globally, and to implement action plans set forth in the Sustainable Development Goals (SDGs) adopted by the United Nations and other initiatives, Kawasaki plans to develop and build more LPG-fueled LPG carriers and other commercial vessels that meet environmental standards, as well as to develop other eco-friendly marine technologies, to contribute to the establishment of a low-carbon\/decarbonized society. These products include vessels for transporting liquefied hydrogen, considered to be the next-generation energy source.","4":"Tokyo, June 17, 2022 Kawasaki Heavy Industries, Ltd. announced today that it delivered the bulk carrier AQUARUBY, with a capacity of 82,000 DWT (Kawasaki hull No. 8086, DACKS hull No. 110), for LEPTA SHIPPING CO., LTD. at the Dalian COSCO KHI Ship Engineering Co., Ltd. (DACKS), which is located in Dalian City, China and operated jointly with China COSCO Shipping Corporation Limited (China COSCO Shipping). Principal particulars and features of the vessel are as described below. Principal Particulars Length overall 228.90 m Molded breadth 32.24 m Molded depth 20.20 m Molded draft 14.50 m Gross tonnage 44,175 T Deadweight 82,015 t Hold capacity 97,762 m3 Main engine One set of MAN B&W 6S60ME-C8.5 diesel engine Speed Approx. 14.2 knots Complement 25 people Classification American Bureau of Shipping (ABS) Country of registration Panama Delivery June 17, 2022 Features The vessel has a flush deck with a forecastle and seven holds that are designed for optimum transport of grains, coal and the other products. The vessel employs various technologies to achieve maximum fuel economy, including an energy-saving, electronically-controlled main diesel engine, high propulsive efficiency propellers, and the Kawasaki rudder bulb system with fins (RBS-F) and semi-duct system with contra fins (SDS-F), which all contribute to the vessel s enhanced propulsion performance. Contact If you need more information about our business, please feel free to contact us. CONTACT","5":"June 16, 2022 Kawasaki Heavy Industries, Ltd. Kawasaki Railcar Manufacturing Co., Ltd. WMATA 7000 Series Railcars to Resume Service Operation On June 15, 2022 (U.S. time), the Washington Metropolitan Area Transit Authority (WMATA) announced that eight 7000-series trains (64 cars) manufactured by Kawasaki Rail Car, Inc. will be restored to passenger service on June 16, 2022. For more information, please refer to the press release* on WMATA s website. * Underlined URL : https:\/\/wmata.com\/about\/news\/7000-series-limited-return-to-service.cfm","6":"Notice of Inappropriate Conduct by Kawasaki Thermal Engineering Co., Ltd. Tokyo, June 7, 2022 Kawasaki Heavy Industries, Ltd. (hereinafter Kawasaki ) announced today that it was discovered that acts which include inappropriate conduct had been performed in tests of certain absorption chillers manufactured and sold mainly for air-conditioning systems in buildings by Kawasaki Thermal Engineering Co., Ltd. (hereinafter KTE ), which became a wholly-owned subsidiary of Kawasaki in August 2021. The following is a report of the relevant content and subsequent responses. We recognize that the acts impair the trust of KTE and sincerely apologize for the significant inconvenience we may have caused our customers and concerned parties. We confirmed the acts of inappropriate conduct do not have any impacts on the safety of our absorption chillers and the performance of the product is within the allowable performance tolerance as defined by the Japanese Industrial Standards (hereinafter JIS Standards )*1 for the indicated performance for the models currently being sold. In order to ensure that events such as these acts do not occur again in the future, a thorough investigation to determine its underlying causes will be conducted by a special investigation committee formed from third parties. In addition to carrying out corrective measures, we will further strengthen the test management system and compliance structures of the entire Kawasaki Group, and will strive to carry out recurrence prevention efforts. As we implement customer support and corrective measures from here on, if there are any impacts on our business performance related to this matter that can be anticipated, we will announce them officially as soon as possible. 1. Performance and quality of absorption chillers currently being sold Since absorption chillers from KTE are manufactured in succession using identical designs (mass-produced), their performance is confirmed through performance tests*2 of first production articles (prototypes or initial units), and their quality is verified by pre-shipment commissioning carried out at plants on each mass-produced machine, so the performance and quality of all products to be sold are ensured. While performance tests on first production articles confirm that the values specified by the JIS Standards for the refrigeration capacity (hereinafter cooling capacity )*3 and Coefficient of Performance (hereinafter COP )*4 are fulfilled by carrying out commissioning at 100% cooling capacity, pre-shipment commissioning performed on each mass-produced machine consists of commissioning at roughly 90% cooling capacity required for operational confirmation and equipment adjustment. The reason for this is that in order to reach 100% cooling capacity after production, 30 to 50 hours of break-in operation are required, but since the prescribed performance is confirmed by performance tests of first production articles, we have determined the performance and quality of products can be ensured by pre-shipment commissioning at roughly 90% cooling capacity based on past performance data. (1) Acts committed during pre-shipment commissioning [1] Indication of data which was not actually measured on inspection reports [Duration] 1984 2022 [Number of cases] 1,950 In cases where pre-shipment commissioning at 100% cooling capacity was requested by customers, explanations should have been provided to customers stating: Data at 100% cooling capacity has been confirmed by performance tests on first production articles, and quality has been confirmed through pre-shipment commissioning by commissioning at roughly 90% cooling capacity, so it is not necessary to perform tests again at 100% cooling capacity. However, data was instead prepared to serve as the results of commissioning at 100% cooling capacity, and that data was indicated on inspection reports. [2] Inappropriate operation of measuring instruments during witness tests [Duration] 1984 2022 [Number of cases] 334 out of the 1,950 cases indicated in [1] above When tests were conducted under witness by customers in addition to submission of the inspection reports indicated in [1] above, even though operation at 100% cooling capacity was not performed, measuring instruments were adjusted to make it appear that operation at 100% cooling capacity was performed, and explanations that differed from the facts were given to customers. (2) Inappropriate indications in catalogs and specifications [Duration] 1986 2009 [Number of applicable models] 6 *5 [Number of units currently in operation] 2,944 The JIS Standards for absorption chillers were established in 1986, and included specified criteria for performance (cooling capacity and COP). The cooling capacity and COP of some of the products being sold at that time did not meet the rated value which was the performance tolerance according to the JIS Standards, but were made available for sale with statements indicating compliance with the JIS Standards in their catalogs and specifications. By 2009, however, sales of the applicable models had been discontinued. At the end of August 2021, a representative from the After-Sales Service Division noticed that the inspection reports submitted to customers by KTE differed from the internal test results, and reported the matter to a supervisor. Item 2 (1) [1] indicated above was then discovered. After receiving that report, KTE started the investigation into the status of submitted inspection reports (past 5-year period, roughly 1,500 units), and after item 2 (1) [2] indicated above was confirmed, it was verified that the performance of models currently being sold is within the performance tolerances of the JIS Standards. Also, investigations were conducted on models currently in operation (roughly 9,600 units). Under the premise of providing individual explanations to customers, corrective measures and policies for response by explanations were considered, and relevant materials were prepared. In March 2022, item 2 (2) indicated above was further discovered during the course of internal investigations, and since a general grasp of the relevant acts of inappropriate conduct had been achieved, reports were provided to the business division under the jurisdiction of parent company Kawasaki (Energy Solution & Marine Engineering Company). After this, Kawasaki has requested KTE for additional detailed investigations and has also conducted other measures including interviews to ascertain the situation. [1] Purpose To carry out detailed investigations of the facts related to the acts of inappropriate conduct, determine their causes, validate and verify corrective measures, and provide recommendations on recurrence prevention. [2] Members Mori Hamada & Matsumoto: Attorney Yasuhiko Fujitsu (Chairperson) Explanations on the content of this matter will be provided from KTE to customers who received deliveries of products subject to the acts of inappropriate conduct, and a sincere stance will be taken to provide responses through individual consultations and discussions. Also, although corrective measures will be executed based on the results of investigation by the special investigation committee, the following steps will be implemented in advance. (already partially completed at this time) [1] Responses by KTE Information on the performance and quality of absorption chillers will be communicated internally as well to outside parties. Internal compliance activities will be strengthened. [2] Responses by Kawasaki Group The Kawasaki Group will treat these acts of inappropriate conduct committed by a company affiliated with the Group as an extremely serious matter, and will thoroughly enforce compliance by implementing inspections related to compliance violations throughout the entire Group once again, with the Compliance Committees of all companies assuming a central role. Overview of Kawasaki Thermal Engineering Co., Ltd.","7":"Kawasaki decides to issue Green Bond Contribution to global carbon neutrality by building a clean hydrogen supply chain Kawasaki Heavy Industries, Ltd. (hereinafter Kawasaki ) has decided to issue green bond (hereinafter the Bond ) following its sustainability bond*1 issued in July 2021. Based on the framework*2 for financing, Kawasaki plans to use the funds raised through public offering in the domestic market for projects to build a clean hydrogen supply chain, which is essential to achieving global carbon neutrality. The company has set a sustainable finance target for 50% of its long-term debt in FY2030 and 100% in FY2050. By making active use of sustainable finance, they will accelerate their sustainability management initiatives to realize the Group Vision 2030*3 and strengthen their engagement with stakeholders to contribute to the achievement of the SDGs and a sustainable society. More information of the sustainability finance","8":"Schematic of the completed marine main boiler Tokyo, May 31, 2022 Kawasaki Heavy Industries, Ltd. announced today the completion of the world s first basic engineering works for a hydrogen marine main boiler. Kawasaki has delivered many propulsion marine main boilers for liquefied natural gas (LNG) carriers. Based on these technologies, it has developed its own hydrogen combustion technology for the new hydrogen marine main boiler. The boiler design incorporates particular technologies required for marine main boilers such as a structural design for vessel motion and compactness, distinguishing it from small once-through hydrogen boiler for land use. Kawasaki has already obtained approval in principle (AiP) from Nippon Kaiji Kyokai (ClassNK) for liquefied hydrogen carriers equipped with this boiler as the propulsion system. https:\/\/global.kawasaki.com\/en\/corp\/newsroom\/news\/detail\/?f=20220422_3378 As a demonstration of one of the core technologies of this boiler, in 2021 Kawasaki conducted a combustion test at a full-scale burner test station. This demonstration verified the high turndown ratio*1 compared with conventional LNG combustion burners. The main features of Kawasaki s hydrogen marine main boiler are as follows: Reliable and stable operationThe basic design of the boiler furnace utilizes the combustion properties of hydrogen (high combustion temperature and speed), while applying the existing proven technical design of LNG-fired propulsion marine main boilers. Therefore, this boiler delivers reliable, long-term stable operation without requiring specific additional operations. Flexible response to load changesMarine main boilers must offer flexible operation under changing load to match fluctuations in sailing speed. This boiler features our outstanding hydrogen combustion technologies and know-how including combustion analysis refined through the development of hydrogen gas turbines. Flexible operation with several fuelsThe fuel of the boiler can be changed according to vessel operation mode. It allows mono-firing of hydrogen or low-sulfur fuels, as well as dual-firing. Safe and stable operationThe technical advantages of our original hydrogen combustion burner ensure safe and stable operation of the hydrogen boiler. The burner design is based on a proven burner for LNG combustion, and ensures specified hydrogen-specific combustion properties, with safety considerations to prevent burnout and backfire. This boiler, together with the steam turbine plant and fuel supply system, will be used in the dual fuel propulsion system of large-sized liquefied hydrogen carriers. The boiler can efficiently use boil-off gas (BOG) as fuel, which is generated by heat ingress during bulk transport of cryogenic liquefied hydrogen. Kawasaki plans to release this boiler for large-sized liquefied hydrogen carriers by the mid-2020s, and will continue to offer optimal boiler solutions to meet the growing demand for hydrogen in order to realize a sustainable and secure energy transition. Furthermore, this marine main boiler technology can be used to upgrade gas-fired land boilers that use LNG, as well as several types of gases such as low calorific gas, BFG\/COG, sour gas or associated gas. Hydrogen is expected to become a key energy source in many industries including oil & gas and chemicals, both in Japan and around the world, in order to decarbonize economic systems in the near future. For these industries, we will propose power systems utilizing our hydrogen fired boiler technologies for large-scale boiler plants, hydrogen mono-fired or dual-fired with LNG. Kawasaki is paving the way for the hydrogen supply chain encompassing production, transportation, storage and utilization. This boiler will help realize the transportation and utilization of hydrogen. Kawasaki will continue to drive the technological development of the hydrogen society in order to promote the use of hydrogen energy and thus help to achieve decarbonization, working as one for the good of the planet. Main specifications of Kawasaki s hydrogen marine main boiler Quantity 2 units per vessel Steam quantity 70 t\/h per unit Steam pressure 5.9 MPaG Steam temperature 530°C Fuel Hydrogen, fuel oil \/ mono-firing or dual-firing *1 Turndown ratio is a key metric of burner performance. A burner with a high turndown ratio offers stable, controlled combustion over a wide range. Simulated appearance of the completed 160,000m3 liquefied hydrogen carrier Related Links Kawasaki Obtains AIP for Large, 160,000m3 Liquefied Hydrogen Carrierhttps:\/\/global.kawasaki.com\/en\/corp\/newsroom\/news\/detail\/?f=20220422_3378 ANSWERS (For Production, Transportation, Storage, and Utilization of Hydrogen at Lower Costs. Challenges to Commercialization)https:\/\/answers.khi.co.jp\/en\/energy-environment\/20210924e-01\/ Kawasaki Hydrogen Road Paving the way for a hydrogen-based society https:\/\/global.kawasaki.com\/en\/hydrogen\/index.html Kawasaki Energy Planthttps:\/\/global.kawasaki.com\/en\/energy\/solutions\/energy_plants\/index.html Contact If you need more information about our business, please feel free to contact us. CONTACT","9":"Learn about Shareholders' Meeting - Kawasaki Heavy Industries, Ltd. \"Powering your potential.\"RESOLUTIONS OF THE 199th ORDINARY GENERAL MEETING OF SHAREHOLDERS The 199th Ordinary General Meeting of Shareholders of Kawasaki Heavy Industries, Ltd. was held at 10:00 a.m. on Friday June 24, 2022 in Kobe, Japan. All proposals were approved as originally proposed. We thank you for your exercising voting rights.","10":"5 MW class gas turbine cogeneration system \"GPB50D\" Tokyo, December 27, 2021 Kawasaki Heavy Industries, Ltd. announced today the receipt of an order for one 5 MW class GPB50D gas turbine cogeneration system. The order was placed by Malaysia s Sime Darby Energy Solution Sdn. Bhd. through Kuala Lumpur based Kawasaki Gas Turbine Asia Sdn. Bhd. (KGA),* and it will be delivered to Malaysia s Pacific Oleochemicals Sdn Bhd. This is the first order for this particular cogeneration system Kawasaki has received from a customer in Malaysia. Pacific Oleochemicals is a Malaysian company that manufactures and sells oleochemicals, or chemicals derived from plant oils and animal fats. They are currently planning to install a new, high-efficiency gas turbine cogeneration system in their Pasir Gudan plant in the southern Malaysian state of Johor to supply electric power and steam for production line facilities, with the aim of reducing energy costs. Kawasaki has delivered more than 20 gas turbine cogeneration systems to customers in Malaysia in the past, and its systems have earned high praise in the market. The company secured this latest order thanks to high overall praise for its excellent product reliability and after-sales services in past orders. Kawasaki offers a full lineup of gas engines, gas turbines and other products that boast high electrical efficiency and are well-suited to a distributed energy supply approach, and one of the company's strengths is its ability to offer optimized combined-cycle power plant energy supply systems that effectively bring together these various products. Moving forward, the company will continue its active pursuit of product and technology improvements as well as strengthening plant engineering capabilities in order to further expand its energy-related business on a global scale. Furthermore, Kawasaki will continue to pursue reliable energy supplies and environmental load reductions and contribute to the realization of low- and zero-carbon-emissions societies while striving to precisely address a diverse array of market needs. 5 MW class, made-in-Japan M5A gas turbine with world-leading efficiency * KGA is a wholly owned subsidiary of Kawasaki that sells, and provides services related to, gas turbines, gas engines and other energy-related equipment and systems in Asia. Related links Kawasaki Receives ASME IGTI Best Paper Award for Industrial Gas Turbine Academic Paper on its M5Ahttps:\/\/global.kawasaki.com\/en\/corp\/newsroom\/news\/detail\/?f=20200930_2331 Product information (Cogeneration systems)https:\/\/global.kawasaki.com\/en\/energy\/equipment\/gas_turbines\/cogeneration.html Contact If you need more information about our business, please feel free to contact us. CONTACT","11":"Tokyo, December 21, 2021 Kawasaki Heavy Industries, Ltd. announced today that its sales of the PV Series hydraulic remote control valves (RCVs) have surpassed 10 million units. Hydraulic RCVs are pressure-reducing valves that control the secondary pressure based on the lever angle and are used for levers and the travel pedals of excavators and mini excavators. Ever since production began in 1968, Kawasaki s hydraulic RCVs have enjoyed a large share of the market, with about 50% of the world s excavators and mini excavators being equipped with our products. The PV Series offers excellent controllability and responsiveness, achieving accurate and smooth manipulation of construction machinery, as well as great durability. Launched in 1997, the Series has retained the top share of the global market for a long time, by accommodating the needs of the construction machinery sector and consistently supplying high-quality products. The use of ICT\/IoT has been advancing in the construction machinery sector in order to reduce manpower needs and improve the working environment at construction sites. In response to this trend, Kawasaki, in addition to hydraulic RCVs, has begun supplying electronic control units for hydraulic equipment. We are committed to improving people s quality of life through our global hydraulic business, by improving the safety of construction sites, such as infrastructure, thereby enhancing productivity.","12":"We are pleased to inform you that we have registered a total of 26 products, 9 new products and 17 updated products, as \"Kawasaki-brand Green Products\" in 2021. \"Kawasaki-brand Green Products\" are systems that examines in-house products that are particularly environmentally friendly in compliance with ISO14021 and announces them to the outside. It started in 2014, and this is the 8th year. The following 9 products are newly registered this time. \"Kawasaki-brand Green Products\" reviews registered products every three years, and in 2021, 17 of the 2018 registered products that have reached the three-year registration deadline have been re-registered. The total number of \"Kawasaki Green Products\" is 68, including 9 new products and 17 updated products, for a total of 26 products. Through the promotion of this system, we will continue to strengthen the competitiveness of products centered on the environment and strive to realize a carbon-free and low-carbon society. Please check the following link for further details.","13":"December 15, 2021 Kawasaki Heavy Industries, Ltd. Kawasaki Railcar Manufacturing Co., Ltd. WMATA 7000 Series Railcars to Resume Service Operation On December 14, 2021 (U.S. time), the Washington Metropolitan Area Transit Authority (WMATA) announced that no more than 336 of the 748 7000 series railcars supplied by Kawasaki Rail Car, Inc. that are currently out of service will be restored to service by shortening the inspection cycles from 90 days to 7 days. For more information, please refer to the press release* on WMATA s website. Meanwhile, the National Transportation Safety Board (NTSB) continues to investigate the cause of the derailment on October 12, 2021 of a 7000 series railcars, which was maintained and operated by WMATA. The Kawasaki Group, as the supplier of the 7000 series railcars, will continue to cooperate with the investigation to resolve the issue as soon as possible, and will promptly notify when we find out what should be disclosed in future. * Underlined URL : https:\/\/wmata.com\/about\/news\/7K-Restoration-Plan.cfm","14":"New addition to the Changing forward short video series, Group Vision 2030 New Values - H2 Edition released On December 13, 2021, Kawasaki made publicly available a short video, entitled Group Vision 2030 New Values - H2 Edition, focused on communicating its corporate message: Changing forward. When Kawasaki established its Group Vision 2030, which outlines the initiatives for realizing this corporate message, it chose three key phrases that express the areas of focus: Frontier, New Values, and Cross Over. The New Values H2 Edition video features Kawasaki s initiatives and its vision related to the utilization of hydrogen energy, which is considered a key player in achieving carbon neutrality by 2050. The video is presented by Ms. Naomi Trauden, our brand ambassador, who has been active in disseminating information and implementing the United Nations Sustainable Development Goals (SDGs) initiatives.","15":"Learn about Kawasaki Environmental Reports - Kawasaki Heavy Industries, Ltd. \"Powering your potential.\"Powering your potential. Kawasaki is committed to providing customers unique business solutions with our innovative technologies to meet diverse societal needs worldwide. Kawasaki, working as one for the good of the planet .","16":"Kawasaki Heavy Industries, Ltd. has issued the Kawasaki Report 2021(integrated report) . The report serves as a tool for communication with stakeholders and includes information about the Group s efforts to create value for society and boost enterprise value; management policies; business environment and strategy, and environmental, social, and governance (ESG)-related content. More information on many of the topics touched upon in this report can also be found on our website.","17":"ONE OF THE WORLD S FIRST 100% HYDROGEN-TO- POWER DEMONSTRATIONS ON INDUSTRIAL SCALE LAUNCHES IN LINGEN, GERMANY Hydrogen-to-Power Plant in Lingen Tokyo and Lingen, December 9, 2021 With the joint-demonstration project H2GT- Lingen , German energy company RWE Generation SE (RWE) and Japanese comprehensive heavy-industry manufacturer Kawasaki Heavy Industries (Kawasaki) are planning to install a hydrogen-fueled gas turbine based on renewable green hydrogen in Lingen, Germany. The gas turbine generator set GPB300 \/ L30A with an electrical power output of 34 MWel. will be used to reelectrify hydrogen. H2GT-Lingen will be one of the world s first pilots to test 100% hydrogen-to-power conversion on an industrial scale turbine. In order to become climate-neutral by 2040, RWE is planning to switch its gas-fired power plants from natural gas to hydrogen over time, as one option for decarbonisation. With H2GT-Lingen, RWE is gaining experience in operating a hydrogen-fired turbine. At the site of its gas-fired power plant in Lingen, RWE intends to generate green hydrogen with electrolysers powered by renewable electricity. The company is planning to build a first 100-MW electrolysis plant in Lingen by 2024, which is to be expanded to 2 GW by the end of the decade. Kawasaki s gas turbine provides the maximum possible fuel flexibility. It can operate with 100% hydrogen, 100% natural gas and with any combination of both. This flexibility will be indispensable, as during the initial phase the amount of hydrogen available for reconversion will fluctuate over time before 100% hydrogen operation will be possible throughout. Kawasaki has developed two different types of combustion systems to achieve 100% hydrogen operation. One is a diffusion flame, the other a Dry-Low-Emission (DLE) combustor. In the beginning, the diffusion flame combustor will be used for the H2GT- Lingen project. The diffusion flame combustor will use water injection to achieve low emissions. In a subsequent phase, the installed diffusion flame combustor will be replaced by a Micro-Mix DLE combustor (MMX-combustor). Using hydrogen in conventional DLE combustors increases NOx emissions and heightens the risk of flashbacks. Hence established gas turbine DLE combustion systems cannot be directly used. The development of DLE hydrogen combustion technologies is thus essential for pure hydrogen (100 Vol%) combustion and Kawasaki has therefore developed the innovative and unique MMX-DLE combustor. The hydrogen combustors that have been developed were successfully tested in 2018 as part of the demonstration power plant project Hydrogen CGS for Smart Community at Kobe for the 1 MW gas turbine category in Japan. The H2GT-Lingen project aims to scale up these proven technology principles. The hydrogen-powered gas turbine is scheduled to be operational in mid-2024. Kawasaki L30A The rapid global expansion of renewable energies over the past few decades has led to new challenges for conventional power generation systems. To manage the intermittency of renewable energy, flexible power generation systems and energy storage systems are becoming increasingly important. During the transition period, gas turbine technologies will play a vital role in stabilising power supply. Accordingly, in the course of the H2GT-Lingen project different operational load ranges between 30% and 100% will be tested to increase operation flexibility. This will become very important to compensate for fluctuations in the grid resulting from the volatile availability of renewable energies. Recently it has become essential to pay full attention to de-carbonisation and sustainability in all industrial sectors. Hydrogen, produced using wind and solar energy, can replace climate-damaging fossil fuels as an alternative for gas turbines, thus enabling low-emission power generation in the future. Both RWE and Kawasaki are thus convinced that hydrogen fuels will be key components of a sustainable de-carbonised society. The H2GT-Lingen project will demonstrate the suitability and importance of hydrogen fueled gas turbines for the global energy transition. RWE Generation SE With its power plants in Germany, the UK and the Netherlands, the approximately 3,000 employees of RWE Generation produce electricity primarily from gas, hydropower and biomass. The company ranks second in Europe with its gas-fired power plants. The RWE Group bundles its hydrogen activities in RWE Generation. RWE is driving forward more than 30 projects in the field of hydrogen with partners from industry and science. Kawasaki Heavy Industries, Ltd. Together with about 100 group companies in Japan and overseas, Kawasaki Heavy Industries oversees the formation of a \"technology corporate group.\" Our technological capabilities, polished over a history that exceeds a century, send diverse products forth into wide-ranging fields that go beyond land, sea, and air, extending from the ocean depths to space. We are also active in wide-ranging businesses driven by diverse and high-level engineering technologies, including generators such as gas turbine and gas engine, environmental and recycling plants, industrial plants, precision machinery, industrial robots, and infrastructure equipment. Through the development of unique and broad businesses unmatched elsewhere, we will continue to create new values that solve the issues facing our customers and society.","18":"We're sorry, but the page you have requested cannot be found. Please find content from the link shown below. We apologize for any inconvenience","19":"December 8, 2021 Medical Corporation TOMOHIROKAI Kawasaki Heavy Industries, Ltd. Kawasaki Links Up with TOMOHIROKAI to Expand PCR Test Center at Kansai International Airport New Clinic to Be Launched to Provide COVID-19 Testing and Certificates of Negative Result December 8, 2021 Kawasaki Heavy Industries, Ltd. announced their partnership with Medical Corporation TOMOHIROKAI to expand the capability of the PCR Test Center launched in September 2021 at Kansai International Airport (KIX). Artist s rendition of the new clinic (conceptual drawing) Artist s rendition of the PCR Test Center s reception counter TOMOHIROKAI will open the Kansai International Airport PCR Test Clinic, Medical Corporation TOMOHIROKAI on the fourth floor of Terminal 1 (International Departure Floor), beginning December 13, 2021, to offer pre-departure COVID-19 testing for international travelers. In addition to PCR tests, the clinic will provide quantitative antigen tests and serum IgM antibody tests to accommodate various travel requirements. Kawasaki has been contracted by TOMOHIROKAI to conduct PCR tests using the automated robotic PCR testing system which Kawasaki previously installed at KIX. In order to improve services, Kawasaki will utilize this testing system along with the capabilities provided by its new partnership to issue certificates as early as three hours after a traveler s arrival at the Test Center s reception desk. It also aims to offer telemedicine in the future. By expanding COVID-19 testing services at KIX, TOMOHIROKAI and Kawasaki hope to support the recovery of international flights. 1 1. Roles of TOMOHIROKAI and Kawasaki: TOMOHIROKAI: Quantitative antigen testing, serum IgM antibody testing, medical consultation (walk-in or online), specimen collection, definitive diagnoses, and issuance of Covid-19 certificate for international travel. Kawasaki: PCR testing, contracted operation of the PCR Test Center, including taking reservations, running the reception desk, collecting testing fees, and notifying travelers of results. 2. Outline of the facility Name: Kansai International Airport PCR Test Clinic, Medical Corporation TOMOHIROKAI Testing 1. Real-time PCR test: 22,000 yen (tax included) service Time required: Reservation to result notification - As early as 3 hours to receive offerings results. Sample type: Nasal swab (taken by a nurse at the clinic) or self-sampled saliva 2. Quantitative antigen test: 11,000 yen (tax included) Time required: Reservation to result notification As early as 90 minutes to receive results. Sample type: Nasal swab (taken by a nurse at the clinic) 3. Serum IgM antibody test: 11,000 yen (tax included) Time required: Reservation to result notification As early as 90 minutes to receive result. Sample type: Blood (taken by a nurse at the clinic) Note: The clinic is currently preparing to be registered as a testing facility with the Embassy of the People s Republic of China in Japan and the Consulate-General of the People's Republic of China. Therefore, results certificates cannot be used for entry to China. Notes Service fee covers examination and certificate Payment method: Credit card only (no cash accepted) Not covered by health insurance 2 Opening Normal times of operation: Open every day hours: 12:00 21:00 (must register before 20:30) Holiday schedule: January 1 & 2, 2022 12:00 - 18:00 (must register before 17:30) Reservation 1. Access the TeCOT (Testing Center for Overseas Travelers) website: methods: https:\/\/www.tecot.go.jp\/english\/ Appointments available beginning Monday, December 13, 2021, 12:00 noon 2. Access the clinic s website: https:\/\/kanku.tomohirokai.or.jp\/en\/ Appointments available beginning Wednesday, December 8, 2021, 12:00 noon 3. By telephone: 072-456-6243 Appointments available beginning Monday, December 13, 2021, 12:00 noon Open every day 12:00 - 21:00 Holiday schedule: January 1 & 2, 2022 12:00 - 18:00 Notes To obtain a digital certificate, make your reservation via the TeCOT website (option 1) To make a reservation for serum IgM antibody testing, access the clinic s website (option 2) or call (option 3) For more details, access the TOMOHIROKAI website: https:\/\/kanku.tomohirokai.or.jp\/en\/ 3"},"url":{"0":"https:\/\/global.kawasaki.com\/en\/corp\/newsroom\/news\/detail\/?f=20220629_7346","1":"https:\/\/global.kawasaki.com\/en\/corp\/ir\/shareholders_meeting\/index.html","2":"https:\/\/global.kawasaki.com\/en\/corp\/newsroom\/news\/detail\/?f=20220623_2108","3":"https:\/\/global.kawasaki.com\/en\/corp\/newsroom\/news\/detail\/?f=20220621_9477","4":"https:\/\/global.kawasaki.com\/en\/corp\/newsroom\/news\/detail\/?f=20220617_4537","5":"https:\/\/global.kawasaki.com\/news_220616-1e.pdf","6":"https:\/\/global.kawasaki.com\/en\/corp\/newsroom\/news\/detail\/?f=20220607_7296","7":"https:\/\/global.kawasaki.com\/en\/corp\/newsroom\/news\/detail\/?f=20220606_0736","8":"https:\/\/global.kawasaki.com\/en\/corp\/newsroom\/news\/detail\/?f=20220531_9923","9":"https:\/\/global.kawasaki.com\/en\/corp\/ir\/shareholders_meeting\/index.html","10":"https:\/\/global.kawasaki.com\/en\/corp\/newsroom\/news\/detail\/?f=20211227_6982","11":"https:\/\/global.kawasaki.com\/en\/corp\/newsroom\/news\/detail\/?f=20211221_3657","12":"https:\/\/global.kawasaki.com\/en\/corp\/newsroom\/news\/detail\/?f=20211216_6271","13":"https:\/\/global.kawasaki.com\/news_211215-1e.pdf","14":"https:\/\/global.kawasaki.com\/en\/corp\/newsroom\/news\/detail\/?f=20211213_2470","15":"https:\/\/global.kawasaki.com\/en\/corp\/sustainability\/environment\/report\/index.html","16":"https:\/\/global.kawasaki.com\/en\/corp\/newsroom\/news\/detail\/?f=20201209_9856","17":"https:\/\/global.kawasaki.com\/news_211209-2e.pdf","18":"https:\/\/global.kawasaki.com\/en\/corp\/ir\/library\/pdf\/etc_211209-1e.pdf","19":"https:\/\/global.kawasaki.com\/news_211208-1.pdf"},"thumbnail":{"0":"https:\/\/global.kawasaki.com\/en\/corp\/newsroom\/news\/images\/news_220629-1.jpg","1":"https:\/\/global.kawasaki.com\/common\/img\/identity.png","2":"https:\/\/global.kawasaki.com\/en\/corp\/newsroom\/news\/images\/news_220623-2.jpg","3":"https:\/\/global.kawasaki.com\/common\/img\/identity.png","4":"https:\/\/global.kawasaki.com\/en\/corp\/newsroom\/news\/images\/news_220617-2.jpg","5":"https:\/\/global.kawasaki.com\/common\/img\/identity.png","6":"https:\/\/global.kawasaki.com\/common\/img\/identity.png","7":"https:\/\/global.kawasaki.com\/common\/img\/identity.png","8":"https:\/\/global.kawasaki.com\/en\/corp\/newsroom\/news\/images\/news_220531-1e.jpg","9":"https:\/\/global.kawasaki.com\/common\/img\/identity.png","10":"https:\/\/global.kawasaki.com\/en\/corp\/newsroom\/news\/images\/news_211227-GPB50D.jpg","11":"https:\/\/global.kawasaki.com\/common\/img\/identity.png","12":"https:\/\/global.kawasaki.com\/common\/img\/identity.png","13":"https:\/\/global.kawasaki.com\/common\/img\/identity.png","14":"https:\/\/global.kawasaki.com\/common\/img\/identity.png","15":"https:\/\/global.kawasaki.com\/common\/img\/identity.png","16":"https:\/\/global.kawasaki.com\/common\/img\/identity.png","17":"https:\/\/global.kawasaki.com\/common\/img\/identity.png","18":"https:\/\/global.kawasaki.com\/common\/img\/identity.png","19":"https:\/\/global.kawasaki.com\/common\/img\/identity.png"},"author":{"0":"Kawasaki","1":"Kawasaki","2":"Kawasaki","3":"Kawasaki","4":"Kawasaki","5":"Kawasaki","6":"Kawasaki","7":"Kawasaki","8":"Kawasaki","9":"Kawasaki","10":"Kawasaki","11":"Kawasaki","12":"Kawasaki","13":"Kawasaki","14":"Kawasaki","15":"Kawasaki","16":"Kawasaki","17":"Kawasaki","18":"Kawasaki","19":"Kawasaki"}}