{"date":{"0":"JUNE 07, 2022","1":"MAY 20, 2022","2":"MAY 04, 2022","3":"MAY 02, 2022","4":"APRIL 19, 2022","5":"APRIL 05, 2022","6":"MARCH 22, 2022","7":"MARCH 16, 2022","8":"FEBRUARY 07, 2022","9":"DECEMBER 20, 2021","10":"JUNE 07, 2022","11":"DECEMBER 09, 2021","12":"DECEMBER 01, 2021","13":"NOVEMBER 18, 2021","14":"NOVEMBER 17, 2021","15":"OCTOBER 26, 2021","16":"OCTOBER 19, 2021","17":"SEPTEMBER 28, 2021","18":"SEPTEMBER 21, 2021","19":"SEPTEMBER 13, 2021","20":"DECEMBER 13, 2021","21":"DECEMBER 09, 2021","22":"JULY 12, 2021","23":"JULY 07, 2021","24":"JUNE 14, 2021","25":"JUNE 09, 2021","26":"JUNE 07, 2021","27":"JUNE 07, 2021","28":"MAY 27, 2021","29":"MAY 18, 2021"},"title":{"0":"Booz Allen Awarded $622.5M NASA Cybersecurity Contract - Booz Allen Hamilton","1":"Booz Allen Names Kristine Martin Anderson COO - Booz Allen Hamilton","2":"Booz Allen Maintains CMMI Maturity Level 5 Ratings - Booz Allen Hamilton","3":"Former FBI Cybersecurity Expert Joins Booz Allen - Booz Allen Hamilton","4":"Booz Allen Invests in Reveal Technology, Inc. - Booz Allen Hamilton","5":"Oliver Wyman to Acquire Booz Allen's MENA-Based Management Consulting ...","6":"Booz Allen Invests in End-to-End AI Company Synthetaic - Booz Allen Hamilton","7":"Booz Allen to Acquire EverWatch - Booz Allen Hamilton","8":"Strategic Cyber Operations Expert Rejoins Booz Allen - Booz Allen Hamilton","9":"Engineering Leader Relocates to Huntsville, Alabama - Booz Allen Hamilton","10":"Booz Allen Awarded $622.5M NASA Cybersecurity Contract - Booz Allen Hamilton","11":"Booz Allen Announces Modzy Spinout - Booz Allen Hamilton","12":"Booz Allen Opens New 5G Lab in Central Maryland - Booz Allen Hamilton","13":"Booz Allen Selected to Commercialize Platform One - Booz Allen Hamilton","14":"Booz Allen Releases 2021 ESG Impact Report - Booz Allen Hamilton","15":"Tracepoint Named Cyber Startup of the Year - Booz Allen Hamilton","16":"Booz Allen Hires Retired Astronaut and USGS Director - Booz Allen Hamilton","17":"Booz Allen Hamilton to Webcast Investor Day 2021 Presentations - Booz Allen ...","18":"NIH Awards Booz Allen Position on $350M Contract - Booz Allen Hamilton","19":"Cyber Market Leader Booz Allen Acquires Tracepoint - Booz Allen Hamilton","20":"Booz Allen Opens New Office in Honolulu, Hawaii - Booz Allen Hamilton","21":"Booz Allen Announces Modzy Spinout - Booz Allen Hamilton","22":"Booz Allen Invests in Adaptive AI Company Latent AI - Booz Allen Hamilton","23":"Booz Allen Recognized with 2021 Cogswell Award - Booz Allen Hamilton","24":"Booz Allen Completes Acquisition of Liberty IT Solutions, LLC - Booz Allen ...","25":"NIWC Pacific Awards Booz Allen IT Engineering Contract - Booz Allen Hamilton","26":"Booz Allen Hamilton Announces Launch of Senior Notes Offering - Booz Allen ...","27":"Booz Allen Hamilton Announces Pricing of Senior Notes Offering - Booz Allen ...","28":"Booz Allen Partners with Databricks to Drive Value for Federal Agencies with ...","29":"Jon G. Muñoz Joins Booz Allen - Booz Allen Hamilton"},"article":{"0":"Booz Allen was awarded the NASA Cybersecurity and Privacy Enterprise Solutions and Services (CyPrESS) contract.MCLEAN, VA – Booz Allen Hamilton (NYSE: BAH) announced today it was awarded the National Aeronautics and Space Administration (NASA) Cybersecurity and Privacy Enterprise Solutions and Services (CyPrESS) contract—a hybrid indefinite-delivery\/indefinite-quantity (IDIQ) single award contract with a total potential value of $622.5 million—to provide a complete range of cybersecurity and privacy enterprise solutions and services for NASA’s Office of the Chief Information Officer (OCIO). For the first time, this contract brings together all aspects of cybersecurity across the NASA enterprise under one contract to include IT systems, operational technology systems, and mission systems. Work will support all NASA centers and facilities from May 31, 2022 through September 30, 2023, with four option periods running through September 2030.    As NASA seeks to centralize cybersecurity across the agency, Booz Allen will support key task areas including development and implementation of NASA’s cybersecurity standards, architecture, and engineering, as well as delivery, oversight, and program management of cybersecurity and privacy services.    “We’re honored that NASA has awarded Booz Allen with the groundbreaking CyPrESS IDIQ contract, which seeks—for the first time—to centralize NASA’s cybersecurity posture under one strategic line of work,” said Andrea Inserra, executive vice president at Booz Allen Hamilton. “We recognize that NASA’s current cyber needs must advance and evolve to protect its more complex missions of the future, and we look forward to building on our long-standing partnership to support NASA’s important research, missions, and operations—paving the way to send humans beyond the Moon to Mars—while protecting its people, assets, and information from threats.”  As the largest provider of cybersecurity solutions and services in North America, the prime digital integrator for the Department of Defense, and trusted partner for national, defense, and civil space efforts for more than 50 years, Booz Allen is well positioned to meet this mission. With this contract, Booz Allen builds upon its deep partnership with NASA—dating back to the agency’s creation in 1958 and assisting with the theoretical trajectory that put the first man on the Moon—by providing these services to all NASA centers and facilities.  “This single-award CyPrESS contract will enable NASA to establish an enterprise-wide approach to cybersecurity and provide a deeper focus on its operational technology and mission systems along with its IT systems,” said Eric Hoffman, vice president at Booz Allen. “Booz Allen is excited to support NASA’s enterprise-centric transformation by providing cyber defense, vulnerability discovery, and incident response services to mitigate risks, as well as cybersecurity engineering and automation solutions to enhance timely, risk-based decisions.”    Read more about Booz Allen’s commitment to supporting NASA, how the firm advances critical space missions, and Booz Allen’s mission-critical cybersecurity expertise.","1":"Booz Allen Hamilton (NYSE: BAH) announced today that Kristine Martin Anderson has been appointed chief operating officer, effective June 1, 2022.McLean, Virginia — May 20, 2022 — Booz Allen Hamilton (NYSE: BAH) announced today that Kristine Martin Anderson has been appointed chief operating officer, effective June 1, 2022. Anderson, an executive vice president, is a member of the firm’s leadership team and currently president of the firm’s Civil Sector.  As COO, Anderson will take primary responsibility for accelerating firmwide operational performance and the transformation of the company’s business model, in collaboration with leaders from across the firm.    “Kristine is an exceptional business leader. She has demonstrated the ability to grow and manage technology-first businesses, develop talented leaders, help senior clients transform, and integrate acquisitions, all while consistently delivering strong financial results,” said Horacio Rozanski, Booz Allen’s president and chief executive officer. “As COO, Kristine will work closely with me as well as other leaders to drive operational performance, accelerate the execution of our strategy, and help us gain efficiencies that lead to faster growth.”    Anderson has been a leader at Booz Allen for more than 16 years. She has led the firm’s Civil Sector for the past four years, driving growth by modernizing and transforming missions across federal civilian departments and agencies. Anderson previously led Booz Allen’s Health business. She grew that business and significantly expanded Booz Allen’s position at the core of essential public health, life sciences, and healthcare delivery and payer missions in federal health agencies. Across all of her leadership roles, Anderson has thrived on discovering and bringing together the best talent with the bold thinking required to solve complex challenges through collaboration and innovation.    “Booz Allen has the benefit of both incredible leadership talent and strong market positioning across the entirety of government. As COO, I look forward to working with a broad group of those leaders to unlock the next level of performance,” said Anderson.    Anderson holds a B.A. in neurobiology from the University of Pennsylvania and an M.B.A. from the Wharton School of Business. Prior to joining Booz Allen in 2006, she was vice president for operations and strategy at CareScience, a software solutions company. Anderson currently serves as treasurer of the Executives for Health Innovation (formerly the eHealth Initiative) board of directors. In addition, she serves as co-chair of the Cost and Resource Use Standing Committee of the National Quality Forum.    Also effective June 1, 2022, Rich Crowe, an executive vice president serving as chief growth officer, has been appointed as president of the firm’s Civil Sector and will join the firm’s leadership team. Prior to this current role, Crowe led and scaled the Health business. Throughout his 17 years at Booz Allen, Crowe has led or supported some of the firm’s largest wins across all sectors.","2":"Booz Allen’s Digital Solutions maintained its Capability Maturity Model Integration for Services Maturity Level 5.McLean, VA – Booz Allen Hamilton (NYSE: BAH) announced today that its Digital Solutions organization maintained its Capability Maturity Model Integration for Services (CMMI Services) Maturity Level (ML) 5 and Capability Maturity Model Integration for Development (CMMI Development) ML5 ratings.  ML5 is the highest rating in systems delivery process and quality management awarded by the CMMI Institute. Booz Allen is now one of a select few Fortune 500 companies to hold a CMMI Development ML5 Rating and is one of two Fortune 500 companies to hold a CMMI Services ML5 rating, demonstrating the firm’s ability to implement process-based methodologies for software development and service delivery, with continual, systematic, and technological performance enhancements over time.  For Booz Allen clients, the ML5 status means Booz Allen can execute large-scale, complex projects on time, within budget, and with clear and predictable results. ML5 organizations focus on continuous process improvement based on a quantitative understanding of their business objectives and performance needs, and quantitative management of their processes to predict and systematically achieve desired performance outcomes for their systems and services, hardware and software development, and engineering delivery.  “Maintaining these high maturity ratings identifies us as a market leader that can rapidly deliver high-quality solutions to meet our clients’ missions,” said Booz Allen Chief Technology Officer Susan Penfield. “These distinctions position us to shape the digital future for our clients while creating extraordinary value.”","3":"Jason Fickett has joined the firm as a leader of Booz Allen’s national cyber strategy.McLean, VA – Booz Allen Hamilton (NYSE: BAH) announced today that Jason Fickett has joined the firm as a leader of Booz Allen’s national cyber strategy, with the goal of developing secure, trusted, and resilient technologies that improve the nation’s cyber operations. As a cyber executive with more than 20 years of extensive experience leading Federal Bureau of Investigation (FBI) operations, Fickett will support clients across the firm’s civilian, defense, and national security businesses, with a focus on protecting U.S. critical infrastructure and federal assets from cyber threats.    Prior to joining Booz Allen, Fickett served as a section chief (Senior Executive Service) within the FBI cyber division. In this role, he was the chief operating officer directly responsible for the division’s logistics, facilities, and total operational budget across 18 countries and every U.S. state. He also spearheaded cyber training for the FBI investigative workforce of over 20,000 personnel, encompassing all special agents, intelligence analysts, and computer scientists.  “Booz Allen continues to invest and play a pivotal role in providing industry-leading cyber solutions for our clients as cyber conflicts become increasingly consequential,” said Booz Allen Executive Vice President Brad Medairy. “We’re thrilled to have a motivated leader like Jason join Booz Allen and apply his talents to our clients’ challenges in the pursuit of enhancing the nation’s cybersecurity and resiliency.”  Earlier in his FBI career, Fickett served as an assistant special agent-in-charge with the FBI’s Washington Human Intelligence (HUMINT) branch, where he led operations against threats and other illegal activity and was accountable for implementing a new HUMINT operational platform, streamlining key national security operations. He also previously supported the FBI as a supervisory special agent and a legal attaché. In addition, Fickett served as a commander (intelligence officer) in the U.S. Navy Reserve for more than 20 years.  “Jason has been embedded in some of the nation’s most vital cyber initiatives,” said Booz Allen Senior Vice President Kelly Rozumalski. “His deep cyber expertise and mission understanding will be key in providing premier cyber solutions to address our clients’ most critical challenges. His proven track record of providing collaborative leadership in cybersecurity and complex investigations will benefit our clients immensely.”  Learn more about Booz Allen’s vision for bolder cybersecurity strategy, operations, and solutions, and the firm’s long history of supporting U.S. government work in cyber defense and offense.","4":"Booz Allen announced that it has made a strategic investment in Reveal Technology, Inc., a visual analytics and edge artificial intelligence (AI) company.McLean, VA – Booz Allen Hamilton (NYSE: BAH) announced it made a strategic investment in Reveal Technology, Inc., a visual analytics and edge artificial intelligence (AI) company.  Blending state-of-the-art computer vision, AI, and edge computing technologies, Reveal delivers intuitive, rapid intelligence at the austere tactical edge where power, compute, and bandwidth are often in short supply. The company’s Farsight software platform provides special operators and squads in high-risk environments with actionable intelligence, surveillance and reconnaissance (ISR) capabilities at the unit level—without the need for network connectivity and on timelines measured in minutes and seconds, not hours and days.  Farsight’s AI-powered insights and decision aids—including real-time 2D mapping, near-real-time-3D mapping, line of sight analysis, and route planning—reduce the cognitive burden on troops and enable faster, better decisions and response. This technology adds critical capabilities to Booz Allen’s Digital Battlespace platform. Digital Battlespace supports the firm’s global defense clients in an information-driven, fully integrated conflict space across all warfighting domains and where success depends on critical networks—communications; intelligence; positioning, navigation, and timing; and equipment—working together even in communications-challenged, denied, or degraded environments.  “Reveal has developed solutions that increase situational awareness and accelerate the decision cycle for dismounted warfighters. Their technology provides rapid, actionable intelligence at the squad and soldier levels while answering the government’s call for speeding the delivery of applied and tactical AI to the battlefield, said Joel Dillon, Booz Allen senior vice president of digital battlespace special missions. “It’s a gamechanger—and something I wish I had when I was in combat.”  Booz Allen is committed to investing in strategic, defense-first, dual-use technologies that help speed up the adoption of advanced commercial technologies for public sector missions. Beyond special operations, there is future potential to apply Reveal’s technology to such mission-critical use cases as natural disaster response, public safety crises, maritime search and rescue, and more.  “Since 2015, Booz Allen has been scouting dual-use capabilities in emerging tech including across all areas of AI and machine learning (ML) to the edge. Because of where we are placed in the innovation ecosystem we are uniquely positioned to help the government find, vet, access and field these emerging technologies to deliver impact faster to important programs of record,” said Brian MacCarthy, Booz Allen vice president of tech scouting and ventures. “By investing in leading-edge companies like Reveal, we are bringing ML and AI to the edge—capabilities that are central to prevailing in the digital battlespace.”  Founded in 2018, Reveal is a company of elite combat veterans, special operators, and top-tier technologists who truly understand the mission and the challenges of combat.  “Reveal has earned its position as the industry’s leading edge geospatial intelligence technology. Farsight is specifically designed to meet tactical operators’ critical needs by delivering applied AI and rapid situational awareness through best-in-class 3D map creation, automated video and imagery exploitation, and sensor- and platform-agnostic edge data processing. The result is faster, better and safer decision-making for warfighters at the tactical edge. It’s the key for the future of human-machine teaming,” said Garret Smith, Reveal Technology co-founder and CEO.  As the largest provider of AI services for the federal government, Booz Allen delivers some of the most advanced AI, ML and data architecture technologies, services and strategies through its work with the Joint AI Center, Army Futures Command and U.S. Air Force Air Combat Command, among others.  Learn more about Booz Allen’s Digital Battlespace platform at https:\/\/www.boozallen.com\/d\/solution\/digital-battlespace.html.","5":"Oliver Wyman will acquire Booz Allen Hamilton’s management consulting business serving the Middle East and North Africa (MENA) region. • Acquisition expands Oliver Wyman’s strategic portfolio and accelerates its position in the region • Shared vision, culture and complementary capabilities will deliver excellent results for clients  New York and McLean, VA – Oliver Wyman, a global management consulting firm and a business of Marsh McLennan [NYSE: MMC], announced today that it has entered into an agreement to acquire Booz Allen Hamilton’s [NYSE: BAH] management consulting business serving the Middle East and North Africa (MENA) region.  The acquired business will join Oliver Wyman’s India, Middle East, and Africa (IMEA) practice, further bolstering Oliver Wyman’s capabilities in both the Middle East and globally, as part of Oliver Wyman’s commitment to delivering impact for clients and helping unlock greater value.  Booz Allen is a leading strategic advisory firm and one of the Middle East’s longest serving management consultancies, supporting clients across the private and public sector. With this acquisition, its MENA-based management consulting business will join Oliver Wyman’s more than 5,500 professionals worldwide fully focused on international management and strategy consulting, with dedicated investments in strategy, operations, risk management, and organizational transformation.  Oliver Wyman gains a management consulting practice fully dedicated to the MENA region, expanding the firm’s strategic capabilities, and accelerating its growth position in the Middle East and beyond.  “With Oliver Wyman’s unwavering commitment to breakthrough impact, we’ve long admired Booz Allen Hamilton’s shared ethos of client excellence and deep sector expertise of the highest standards,” said Pedro Oliveira, managing partner of Oliver Wyman IMEA. “Indeed, Oliver Wyman and Booz Allen already share a long history, with two former Booz Allen Hamilton partners having founded Oliver Wyman, and we are deeply pleased this culture of entrepreneurship and DNA of deep-seated values endures some four decades later. We are confident this move to come together will offer exponential value to our clients, and we look forward to welcoming them to the Oliver Wyman team.”  Booz Allen’s MENA-based management consulting business has extensive experience in both the public and private sectors across energy, climate and sustainability, real estate, and financial services, and will enhance Oliver Wyman’s range of competences and advisory credentials in environmental, social, and governance (ESG); climate and sustainability, and more. Additionally, Booz Allen’s specialized cybersecurity offering will boost Oliver Wyman’s rapidly growing digital capabilities in the Middle East.  “The Middle East is one of the most aspirational, ambitious, and exciting markets we support. To help service this trajectory, we are deeply pleased to be investing in and bringing aboard talent of this caliber that will enable us to have even greater impact and exceed client expectations,” said Nick Studer, president and CEO of Oliver Wyman. “Booz Allen’s experience and expertise will help propel both our firm’s strategic direction but most importantly the path of the clients we serve in this rapidly evolving and dynamic market.”  Booz Allen will continue to serve U.S. government clients requiring support within the MENA region, including in the Kingdom of Saudi Arabia and the United Arab Emirates, and will continue to provide proprietary cyber, defense, and security solutions and related support to clients in the MENA region.  “This is a tremendous opportunity for our MENA-based management consulting business and talented workforce to grow in new ways,” said Karen Dahut, Booz Allen’s Global Defense Sector president. “Booz Allen has a proud, long-standing management consulting legacy in the MENA region and has become a true transformation leader. Oliver Wyman provides the management consulting focus, investment, and culture that will allow our people and clients to thrive, while enabling Booz Allen to retain a core focus on serving U.S. government clients at the center of mission and technology.”  Booz Allen Executive Vice President and MENA Managing Director Souheil Moukaddem will join Oliver Wyman’s Management Leadership Council, led by Pedro Oliveira.  “Oliver Wyman is a global management consulting leader that will be a great home for our people, capabilities, and clients. Bringing together our shared vision for the Middle East, cultures of entrepreneurship, inclusivity and diversity, and leading strategy consulting capabilities will deliver tremendous value as we enter a new era together,” said Moukaddem.  The transaction is expected to close in 2022 and is subject to customary closing conditions, including regulatory approvals. Terms of the transaction were not disclosed.","6":"Booz Allen has made a strategic investment in Synthetaic, an end-to-end artificial intelligence (AI) company.McLean, VA – Booz Allen Hamilton (NYSE: BAH) announced today that it has made a strategic investment in Synthetaic, an end-to-end artificial intelligence (AI) company.  Synthetaic provides organizations with an end-to-end pipeline for AI-enabled solutions without the traditional dependency on human-labeled data—bypassing costs and delays while accelerating AI adoption in critical areas of importance, including national security and defense, healthcare, climate science, and conservation. Synthetaic’s flagship technology, RAIC (Rapid Automatic Image Categorization), enables rapid object labeling, AI modeling, and solution deployment by analyzing large, multidimensional imagery datasets, and allows both experts and non-experts to build and run detection AI models in minutes, instead of after months of human annotation.  “Advances in unsupervised machine learning methods present an opportunity to reimagine the AI model development and integration process,” said Steve Escaravage, Booz Allen senior vice president and AI business leader. “Our investment in Synthetaic provides access to technology that will reduce the time and cost to mission impact from AI solutions, which is absolutely critical in national security, defense, and domestic agendas.”  Booz Allen is committed to investing in strategic dual-use technologies that help speed up the adoption of advanced commercial technologies for public sector missions.  “Through our Tech Scouting division, Booz Allen is uniquely positioned to help the government find, vet, and access critical dual-use emerging technologies and deliver impact faster to important programs of record,” said Brian MacCarthy, Booz Allen vice president of tech scouting and ventures. “By investing in leading-edge companies like Synthetaic, we are meeting the government’s call to accelerate access to advanced solutions through partnerships, sponsorships, and collaboration.”  Founded in 2019, Synthetaic recently announced the close of its Series A financing round led by Lupa Systems.  \"We are thrilled to count Booz Allen Hamilton among our strategic investment partners,\" said Corey Jaskolski, CEO and founder of Synthetaic. \"By automating data labeling at scale, RAIC increases rapid accessibility to AI, allowing users to build models and iterate in a matter of minutes instead of months. We’re excited to explore how our technologies can further enhance Booz Allen Hamilton’s ability to develop and deploy AI solutions for mission-critical use cases.”  As the largest provider of AI services for the federal government, Booz Allen delivers some of the most advanced AI, machine learning (ML), and data architecture technologies, services, and strategies through its work with the Joint AI Center, Army Futures Command, and U.S. Air Force Air Combat Command, among others.  Learn more about AI at Booz Allen at http:\/\/www.boozallen.com\/AI.","7":"Booz Allen announced a definitive agreement to acquire EverWatch, a leading provider of advanced solutions to the defense and intelligence communities.McLean, VA – Booz Allen Hamilton (NYSE: BAH) today announced that it has entered into a definitive agreement to acquire EverWatch, a leading provider of advanced solutions to the defense and intelligence communities.  Leveraging a highly skilled, cleared workforce, EverWatch builds and operates mission-critical classified platforms to defend against increasingly sophisticated national cyber threats. Its specialized capabilities complement Booz Allen’s deep artificial intelligence (AI) and cyber portfolio, and will help Booz Allen to leapfrog technology development cycles and meaningfully accelerate the delivery of classified software development and analytics capabilities for national security clients.  EverWatch, a portfolio company of Enlightenment Capital, was founded in 2017 and is headquartered in Reston, Virginia. Following the closing of the transaction, EverWatch will operate as a wholly owned subsidiary of Booz Allen, working closely with the firm’s National Security Sector led by Sector President Judi Dotson.  “U.S. national and economic security depends on secure, trusted, and resilient technology, and in the most dynamic threat landscape of our time, delivering advanced solutions with speed and agility is essential for mission success,” said Dotson. “Combining Booz Allen’s mission experience and advanced technologies with EverWatch’s classified software development and analytics capabilities will help implement faster and more comprehensive solution delivery to help defense and intelligence agencies transform and stay ahead of threats.”  “EverWatch is an excellent strategic and cultural fit and this acquisition is a strategic accelerator well aligned with Booz Allen’s VoLT strategy, our investment thesis, and our expanding National Cyber platform capabilities,” said Booz Allen's Chief Strategy Officer Matt Calderone. “Our combined capabilities will deliver exceptional value for our clients, employees, and shareholders.”    “Booz Allen and EverWatch share a deep commitment to protecting our national interests with advanced technology, mission intimacy, and digital transformation. We look forward to the combined strength of our organizations to deliver exceptional support to clients in the intelligence community and beyond,” said John Hillen, Chief Executive Officer at EverWatch.  EverWatch brings a legacy of service to national security agencies and core capabilities in software development and architecture, cloud, analytics, AI and machine learning, and TechSIGINT that strategically align with Booz Allen’s deep mission insights and robust portfolio of full-spectrum cyber operations, mission analytics, AI, and 5G offerings.  \"EverWatch has invested heavily in developing innovative solutions and has become a market leader solving some of the most complex problems facing the national security sector. The combination with Booz Allen will further deepen innovation capabilities, accelerate our collective support of critical national security efforts, and enhance opportunities for EverWatch’s growing, skilled employee base,” said Devin Talbott, Founder and Managing Partner of Enlightenment Capital.     The transaction is expected to close in the first quarter of Booz Allen’s fiscal year 2023 and is subject to customary closing conditions. Terms of the transaction were not disclosed.  Booz Allen retained Jefferies LLC as financial advisor for the transaction and King & Spalding LLP as legal advisor, and Avascent for strategic industry advisory services. EverWatch retained Baird as financial advisor and Moore & Van Allen PLLC as legal advisor. EverWatch is backed by Enlightenment Capital, a private investment firm providing flexible capital and strategic support to middle market businesses in the Aerospace, Defense, Government & Technology (ADG&T) sector.","8":"Raynor Dahlquist has rejoined the firm as a senior vice president within the national security businessMcLean, VA – Booz Allen Hamilton (NYSE: BAH) announced today that strategic cyber operations expert Raynor Dahlquist has rejoined the firm as a senior vice president within the firm’s national security business to help lead Booz Allen’s national cyber strategy. As a senior cyber executive leading Booz Allen’s Full-Spectrum Cyber Operations business supporting the defense and intelligence communities, Dahlquist oversees teams across the firm’s defense and national security businesses, delivering a full spectrum of cyber solutions to protect against advanced adversaries.    “Raynor’s extensive and multifaceted background in strategic cyber operations and policy will be an asset to our clients as we deliver a full spectrum of cyber solutions to transform U.S. national cyber capabilities,” said Judi Dotson, executive vice president and leader of Booz Allen’s national security business. “We are thrilled to have a driven leader like Raynor return to Booz Allen, as she will be a critical part of our firmwide efforts to expand the nation’s global competitive advantage and take a stand against its adversaries.”  Dahlquist has more than 20 years of experience focused on technical delivery of solutions and programs. She rejoins Booz Allen after leading public sector capture management at the cybersecurity firm Palo Alto Networks. In her previous role at Booz Allen, Dahlquist served as a cyber and technology leader in the firm’s defense and strategic innovation businesses, where she developed and integrated cyber capabilities across markets, led cyber investments, and directed hiring and training of the firm’s cyber talent. She also previously directed the Booz Allen Cyber Solutions Network capability, which was established to support client-facing delivery of solutions in network infrastructure, development of solutions and tools, and demonstrating capabilities for clients.  “As cyber attacks continue to grow in complexity, reach, and velocity, cybersecurity has become increasingly critical to the resilience of the nation and its allies,” said Dahlquist. “I love that Booz Allen takes an interdisciplinary approach to meeting the field’s ever-changing needs with our collective ingenuity and tradecraft, built on years of full-spectrum cyber mission delivery. I’m excited to again work alongside our amazing teams and partners to help our clients solve mission-critical challenges.”  Earlier in her career, Dahlquist directed teams focused on infrastructure protection, product development, and domestic and international market expansion at VeriSign, Inc., Intuit, and Transamerica Financial Services. Dahlquist also serves on the board of associates at Randolph-Macon College and Mobile Hope of Loudoun County, Virginia. She is a founding member of Chief in Washington, DC, a national network dedicated to helping women leaders strengthen their leadership journey.  Learn more about Booz Allen’s vision for bolder cybersecurity strategy, operations, and solutions, and the firm’s long history of supporting U.S. government work in cyber defense and offense.","9":"Booz Allen Hamilton announced one of its senior technical leaders supporting the Federal Bureau of Investigation (FBI), Distinguished Engineer Gary Pomajevich, has relocated to Huntsville, Alabama.McLean, VA – Booz Allen Hamilton (NYSE: BAH) announced one of its senior technical leaders supporting the Federal Bureau of Investigation (FBI), Distinguished Engineer Gary Pomajevich, has relocated to Huntsville, Alabama. This move underscores the firm’s commitment and partnership with the FBI to establish its Huntsville campus as the world’s leading innovation hub for next-generation investigative and operational technologies.    Pomajevich has worked with Booz Allen for 25 years, helping the firm to support major intelligence, national security, and law enforcement operations, including those of the FBI. He has spent the majority of his career working behind the scenes as an embedded, onsite technical leader serving his clients and their missions. Pomajevich was central to the stand-up and success of the FBI’s Terrorist Explosive Device Analytical Center (TEDAC) technical exploitation component in 2003 and his team supported its successful relocation and continued mission at Redstone Arsenal in 2017 as one of the first major programs to transition to Huntsville. His multifaceted background includes work in reverse engineering, technical analysis and exploitation, software development, and more specifically the development of state-of-the-art investigative tools.  “I’m looking forward to beginning a new chapter in my career with Booz Allen here in the Rocket City,” said Pomajevich. “Although I’ll be working in a new city, my focus and passion remain the same as it has for decades: to serve our clients and serve our employees. It’s especially rewarding to see the results help solve a case or stop a terrorist plot. In partnership, we have an opportunity to revolutionize how the FBI conducts its mission through innovation and bringing new capabilities quickly to the field.”  Pomajevich’s relocation from Quantico, Virginia, coincides with the FBI’s multiyear effort to expand its presence at Redstone Arsenal and transform the location into a hub for technology development. The FBI’s plans include enhancing its training programs, building an innovation center dedicated to cyber threat intelligence and analytics, and creating a “smart city” where FBI employees can test tools in a real-world setting. The FBI aims to grow its current base of Huntsville employees to a workforce of at least 3,400 by 2026.  “We’ve been working shoulder to shoulder with the FBI for decades, and we have an active, engaged, and growing presence on the ground in Huntsville,” said Carl Ghattas, a Booz Allen senior vice president and a leader within the firm’s Justice, Homeland Security, and Transportation business who served in the FBI for more than 20 years. “Gary’s relocation demonstrates our commitment to bringing together the best and brightest talent to support FBI missions. Gary is not the first member of our team to relocate to Huntsville in support of the FBI, and he will not be the last. Booz Allen will be there as more programs transition down, with waves of professionals who transition their Booz Allen careers from the national capital region to Huntsville, as well as with dozens of targeted new hires from within the region. Booz Allen in Huntsville is a place where you can build a rewarding career; develop new, forward-leaning skills; and apply them to protect the American people from 21st-century threats.”  Booz Allen has operated local offices in Huntsville since 2003, and currently employs a local workforce of 175 people. In 2020, the firm opened its 6,000-square-foot, state-of-the-art Innovation Center in the historic, reimagined Stovehouse factory to support collaboration with clients and the community. The reconfigurable space is designed to host engineering teams, employee gatherings, customer meetings, and demonstrations across a broad range of technical skill sets.  Read more about Booz Allen’s work with the FBI and how the firm’s Huntsville location supports Booz Allen’s clients and the community.","10":"Booz Allen was awarded the NASA Cybersecurity and Privacy Enterprise Solutions and Services (CyPrESS) contract.MCLEAN, VA – Booz Allen Hamilton (NYSE: BAH) announced today it was awarded the National Aeronautics and Space Administration (NASA) Cybersecurity and Privacy Enterprise Solutions and Services (CyPrESS) contract—a hybrid indefinite-delivery\/indefinite-quantity (IDIQ) single award contract with a total potential value of $622.5 million—to provide a complete range of cybersecurity and privacy enterprise solutions and services for NASA’s Office of the Chief Information Officer (OCIO). For the first time, this contract brings together all aspects of cybersecurity across the NASA enterprise under one contract to include IT systems, operational technology systems, and mission systems. Work will support all NASA centers and facilities from May 31, 2022 through September 30, 2023, with four option periods running through September 2030.    As NASA seeks to centralize cybersecurity across the agency, Booz Allen will support key task areas including development and implementation of NASA’s cybersecurity standards, architecture, and engineering, as well as delivery, oversight, and program management of cybersecurity and privacy services.    “We’re honored that NASA has awarded Booz Allen with the groundbreaking CyPrESS IDIQ contract, which seeks—for the first time—to centralize NASA’s cybersecurity posture under one strategic line of work,” said Andrea Inserra, executive vice president at Booz Allen Hamilton. “We recognize that NASA’s current cyber needs must advance and evolve to protect its more complex missions of the future, and we look forward to building on our long-standing partnership to support NASA’s important research, missions, and operations—paving the way to send humans beyond the Moon to Mars—while protecting its people, assets, and information from threats.”  As the largest provider of cybersecurity solutions and services in North America, the prime digital integrator for the Department of Defense, and trusted partner for national, defense, and civil space efforts for more than 50 years, Booz Allen is well positioned to meet this mission. With this contract, Booz Allen builds upon its deep partnership with NASA—dating back to the agency’s creation in 1958 and assisting with the theoretical trajectory that put the first man on the Moon—by providing these services to all NASA centers and facilities.  “This single-award CyPrESS contract will enable NASA to establish an enterprise-wide approach to cybersecurity and provide a deeper focus on its operational technology and mission systems along with its IT systems,” said Eric Hoffman, vice president at Booz Allen. “Booz Allen is excited to support NASA’s enterprise-centric transformation by providing cyber defense, vulnerability discovery, and incident response services to mitigate risks, as well as cybersecurity engineering and automation solutions to enhance timely, risk-based decisions.”    Read more about Booz Allen’s commitment to supporting NASA, how the firm advances critical space missions, and Booz Allen’s mission-critical cybersecurity expertise.","11":"Booz Allen will spin out its commercial artificial intelligence platform Modzy® into a new company, Modzy, Inc.McLean, VA – Booz Allen Hamilton (NYSE: BAH) announced today it has completed a transaction to spin out its commercial artificial intelligence (AI) platform Modzy® into a new company, Modzy, Inc.  Modzy, which includes a deep tech software platform and team of AI experts, accelerates the deployment of production-ready AI, provides tools for data scientists and developers to easily integrate AI into enterprise and edge systems at scale, and offers a centralized location for stakeholders to monitor all AI performance. These features help organizations overcome today’s toughest challenges with scaling and monitoring AI-powered systems. Modzy will continue to build upon its existing customer base across commercial and federal markets, expand its partner ecosystem, and grow its developer community.  The spinout follows a similar recent transaction with the cyber threat hunting and detection platform SnapAttack. Booz Allen will maintain a minority ownership stake in Modzy, Inc. Financial terms were not disclosed.  “Our innovation strategy includes a commitment to identifying, evaluating, incubating, and scaling cutting-edge solutions and empowering our innovators to build and scale products that help clients achieve new outcomes faster. By spinning out Modzy, we continue to take a focused approach to accelerating innovation at the intersection of mission and technology,” said Booz Allen Chief Innovation Officer Susan Penfield.  “Modzy solves the hardest problem with using AI at scale, which is that businesses struggle to deploy and integrate AI into production. Too many models—more than 50%—are developed but never used,” said Modzy Chief Executive Officer and Co-founder, Dr. Josh Sullivan. “Modzy will continue to scale rapidly, building on our existing customer base across commercial markets through expansion of our partner ecosystem and developer community to accelerate AI value creation.”","12":"Booz Allen Hamilton announced the opening of a new 5G lab in Annapolis Junction, Maryland in support of mission-critical client work further enabled by 5G integration and deployment.McLean, VA – Booz Allen Hamilton (NYSE: BAH) announced the opening of a new 5G lab in Annapolis Junction, Maryland, in support of mission-critical client work further enabled by 5G integration and deployment. The lab’s secure test environment features a leading-edge 5G Standalone (SA) carrier-grade network, including a SA mobile core, Radio Access Network (RAN), and mobile edge compute enabling multiband testing across devices and enhanced research and development capabilities.  Combined with Booz Allen’s cloud, network, and security expertise, the premiere 5G lab facility delivers a testbed for cyber resiliency, artificial intelligence and machine learning (AI\/ML) modeling, and integrated internet-of-things (IoT), immersive, and emerging applications development.  “Both the public and private sector are grappling with 5G, and the initial promises of higher data rates, lower latency, increased capacity, and resulting technology applications have quickly shifted the concern to the underlying security risks. The same technology that improves operations can create new vulnerabilities that impede operations,” said Chris Christou, vice president at Booz Allen and leader of the firm’s 5G portfolio. “This complex balance between operability and security is exactly why Booz Allen invested in a testing environment that allows us to research and develop new 5G-enabled platforms and lead customers’ ongoing adoption of new technologies and capabilities, while keeping them secure.”  Booz Allen’s 5G Lab is built on a holistic 5G security approach that supports various enterprise missions and clients, including capabilities to: • Plan – Develop tailored 5G strategies grounded in the identification and prioritization of high mission impact 5G use cases, align plans and resources for use case implementation based on a nuanced understanding of technical readiness, and develop policies and standards for 5G ecosystem operation and management • Build – Deliver 5G mission platforms and applications by designing secure network architectures, completing network slicing and radio frequency\/spectrum engineering, and integrating the full stack of 5G ecosystem technologies • Protect – Secure mobile networks, edge computing resources, and 5G devices and applications through threat-based identification and management of risks, assessment of 5G-relevant vulnerabilities, and hardening and continuous monitoring of 5G environments • Research – Pivot differentiated adversary insight and world-class cyber tradecraft into the early identification of novel 5G system vulnerabilities, development of leading-edge countermeasures, and delivery of tailored intelligence analysis  The 5G lab is Booz Allen’s latest investment in this critical technology—rooted in leading-edge innovation and people-first mission understanding.  As a part of the broader $1.7 billion, 5-year Congressional directive “DOD 5G to Next G” campaign to accelerate Department of Defense (DOD) use of 5G and advance U.S. private sector technology maturation, Booz Allen announced in March 2021 that DOD selected the firm, among others, to support 5G integration and testing at five U.S. military locations. The $600 million contract represents the largest full-scale testing done to date for dual-use applications in the world, supporting DOD’s mission to implement full-scale 5G military deployment. As a part of this work, Booz Allen was tapped to prototype for two distinct projects: an AI spectrum sensing application that enables dynamic spectrum sharing for the Air Force’s airborne radar systems and 5G-enabled AR and VR supporting virtual, live military training ranging from an individual soldier to in-field, collaborative training for a full brigade.  Announced this fall, Booz Allen has also joined the Qualcomm® Smart Cities Accelerator Program to deploy 5G networks and IoT technologies, supporting the public sector. The program is designed to connect cities, municipalities, government agencies, and enterprises with an ecosystem of providers. Booz Allen serves as a system integrator for program members and creates unique use cases using 5G private networks powered by Qualcomm Technologies with the goal of delivering mission-focused cyber resiliency solutions.  Read more about how Booz Allen is pioneering comprehensive cybersecure 5G solutions.","13":"Booz Allen will commercialize Platform One’s Big Bang product and Iron Bank container hardening services.McLean, VA – Booz Allen Hamilton (NYSE: BAH) announced they have partnered with the U.S. Air Force to commercialize Platform One’s Big Bang product and Iron Bank container hardening services, propelling the delivery of modern, secure mission capabilities at scale. As a plank holder of Platform One—and now a commercialization partner—the firm, teamed with Rancher Government Solutions (RGS), is at the forefront of enterprise-wide software modernization and innovation for Department of Defense (DOD), federal government, and private sector organizations who can leverage Platform One to accelerate delivery through continuous, reusable, flexible, and secure solutions.  Booz Allen’s implementation of Platform One products and services will provide immediate value for clients across the government, as well as for industry partners by rapidly delivering innovation to federal organizations with increased mission assurance.  Organizations throughout the DOD, federal government, and commercial sector will now work with Booz Allen to leverage Platform One’s Big Bang product, which deploys a software factory built on DOD hardened and approved packages in a customer-owned environment This baseline of open-source software development tools allows organizations to deploy and customize Platform One’s software factory for their specific mission needs to accelerate modernization of mission capabilities from Day One. This significantly reduces overall project costs and time, while mitigating mission risk due to a robust, proven, and enterprise-grade solution built and supported by Platform One and Booz Allen.  Booz Allen will also onboard commercial software to the Iron Bank, resulting in DOD-wide reciprocity. The offering of Platform One’s Iron Bank expands access to a \"plug and play\" development library, so teams within government and commercial entities can execute quickly into production—while ensuring security and resiliency are configured from the start. Booz Allen has been integral in delivering and maturing all phases of Platform One capability development and operations, including working to harden the Iron Bank’s repository of more than 800 digitally signed, binary container images, including both free and open-source software (FOSS) and commercial off-the-shelf (COTS) software to support rapid software development.  “Platform One is a multifaceted change initiative—spanning technology, culture, and policy—that fundamentally reimagines the government’s approach to software delivery,” said Ki Lee, a Booz Allen vice president and a leader in the firm’s digital business. “Platform One allows users to rapidly modernize their mission systems with a 90 percent solution on Day One, instead of starting from scratch. This approach significantly reduces the time needed to make critical software updates and deploy new capabilities at the speed of relevance.”  As designers, developers, and operators of Platform One, our technical leadership uniquely positions Booz Allen to support organizations in the defense, national security, federal, and commercial sectors to leverage Big Bang and Iron Bank for proven and trusted solutions that promote quality, speed, and mission assurance.  “Platform One is a prime example of how we’re supporting the Department of Defense in developing new technologies to disrupt federal and commercial markets,” said Brian Gunderson, a Booz Allen vice president. “We’ve seen firsthand the transformational impact Platform One has created for our clients, and we’re excited to partner with the Air Force to bring its critical capabilities to a wider customer base.”  For information about integrating Platform One, contact [email protected]. Learn more about Booz Allen’s support of the U.S. Air Force’s command and control initiatives, and the firm’s insights into the key challenges of Platform One.  Disclaimer: The views expressed are those of the contractor and do not reflect the official policy or position of the U.S. Air Force, Department of Defense, or the U.S. Government. Further, Platform One does not endorse nor validate the accuracy of the information provided.","14":"Booz Allen published its 2021 Environmental, Social, and Governance (ESG) Impact Report, “The Future Can’t Wait.” • Approach to ESG management aligns with long-term growth strategy and sustainable value creation for stakeholders • Expands reporting framework alignment with focus on transparent evaluation and communication of results  McLean, VA – Booz Allen Hamilton (NYSE: BAH) today published its 2021 Environmental, Social, and Governance (ESG) Impact Report, “The Future Can’t Wait,” offering new insight into the firm’s journey to build a more digital, secure, resilient, and equitable future.  This year’s report includes highlights and updates in six key impact areas: • Ethics and Integrity: A look at how Booz Allen incorporates ethics and integrity in all facets of leadership, corporate governance, and operations • Mission and Innovation: Examples of the firm’s applied technical capabilities and innovation investments to meet clients’ critical mission needs • Employee Experience: Insight on Booz Allen’s inclusive employment approach and its Diversity, Equity, and Inclusion (DEI) action plan to increase transparency, drive equity in policies and practices, and ensure all employees have opportunities to reach their full potential • Community Engagement: A showcase of Booz Allen’s positive community impact, including charitable contributions and pro bono client service focused on veterans and military families, pandemic and disaster response, equity causes, and connecting underrepresented groups to STEM careers • Global Resilience: Spotlighting the firm’s ability to anticipate, address, and adapt in the face of climate change and other threats to global stability and security, including making a commitment to reach net-zero greenhouse gas emissions by 2050 • Information Security: An overview of Booz Allen’s approach to safeguarding information and technology assets, delivering a trusted workforce, and protecting sensitive data  In 2021 Booz Allen expanded its suite of voluntary ESG reporting frameworks to better enable diverse stakeholders to use Booz Allen’s ESG disclosures to understand and evaluate its efforts to manage corporate impact. Published with the report are six content indices that detail the alignment of information within the report and other publicly available sources to the Global Reporting Initiative (GRI) Sustainability Reporting Standards; Sustainability Accounting Standards Board (SASB) Standards; Task Force on Climate-Related Financial Disclosures (TCFD); CDP climate questionnaire; World Economic Forum Stakeholder Capitalism Metrics; and the UN Guiding Principles on Business and Human Rights Reporting Framework.  “Transparency and the accountability it fosters are natural expressions of our purpose and values, which serve as the foundation for everything we do,” said Booz Allen executive vice president Nancy Laben, chief legal officer and chair of Booz Allen’s board-chartered ESG Committee. “This report highlights the measurable contributions our people make—through their work, their generosity, and especially their collaboration—to our firm, our clients, our communities, and the world.”  To learn more and read the full report, visit Environmental, Social, Governance at Booz Allen.","15":"Tracepoint, a Booz Allen company, was selected as Cyber Startup of the Year by the Northern Virginia Technology Council (NVTC) at the 6th annual Capital Cybersecurity Summit & Capital Cyber Awards.McLean, VA – Tracepoint, a Booz Allen Hamilton (NYSE: BAH) company, was selected as Cyber Startup of the Year by the Northern Virginia Technology Council (NVTC) at the sixth annual Capital Cybersecurity Summit & Capital Cyber Awards.  NVTC’s Capital Cyber Awards celebrate the Washington metro area’s best companies and individuals in cybersecurity, and winners are selected based on their exceptional dedication, vision, innovation, and contribution to the greater region’s cybersecurity industry.  Co-founded in December 2019 by Chris Salsberry, Brett Anderson, and Rob Driscoll and based in Fredericksburg, Va., Tracepoint is a recognized leader in digital forensics and incident response (DFIR), remediation, and cyber risk and resilience management. Tracepoint partners with cyber insurance carriers, lawyers, brokers, and their clients respond to cyber incidents, delivering advanced cyber defense solutions to help clients defend against a growing number of debilitating cyber threats.  “I’m exceptionally proud of our team, the relationships they forge with clients, and the quality of work we deliver against the most significant cyber attacks,” said Chris Salsberry, Tracepoint’s chief executive officer.  In September 2021, Booz Allen announced that it completed the acquisition of Tracepoint after making an initial strategic investment in December 2020. Booz Allen’s cybersecurity portfolio includes many Fortune 100 and Global 2000 clients, as well as nearly every U.S. defense and federal agency, and the firm’s commercial business delivers advanced cyber services for clients across multiple industries, including financial services, health and life sciences, energy, transportation, and manufacturing.  “Under Chris Salsberry’s leadership, Tracepoint grew quickly to become a DFIR market leader, and I’m thrilled that the NVTC has recognized Tracepoint’s accomplishments,” said Bill Phelps, executive vice president and leader of Booz Allen’s commercial business. “Tracepoint is a key component to our long-term plans and this recognition today from the NVTC only reaffirms my excitement about the company today and what we can accomplish together in the future.”","16":"Dr. James F. Reilly II, Ph.D., a retired NASA astronaut and the former director of the United States Geological Survey (USGS), joins Booz Allen as an executive advisor.McLean, VA – Booz Allen Hamilton (NYSE: BAH) announced that Dr. James F. Reilly II, Ph.D., a retired NASA astronaut and the former Director of the United States Geological Survey (USGS), has joined the firm as an executive advisor. In this role, he will collaborate with a wide range of partners—the Department of Defense, National Oceanic and Atmospheric Administration, NASA, intelligence community agencies, universities, and the commercial space industry—on innovative solutions for space-related services and applications.  Reilly brings a unique blend of executive leadership, technical expertise, and space domain experience to Booz Allen. During his tenure as USGS Director, he oversaw an operating budget of roughly $1.8 billion and initiated modernization efforts to accelerate the delivery of critical information, an effort that involved the implementation and use of artificial intelligence, machine learning, and high-performance computing. As an astronaut at NASA, Reilly flew three spaceflight missions and conducted five spacewalks. He also supported the space program in several roles as a mission specialist where he developed requirements, testing systems, conducted space shuttle training, and more.  “As someone who has managed teams, critical systems, and projects in space and on the ground, Jim provides strategic guidance that will prove invaluable as we advance our space business forward,” said Andrea Inserra, Booz Allen executive vice president and leader of the firm’s aerospace account, inclusive of clients like the U.S. Air Force, Space Force, and NASA. “Moreover, his extensive multi-disciplinary background—encompassing engineering, operations, testing, system requirements, human factors, and beyond—will make him an unparalleled resource for both the firm and our partners as the space revolution accelerates.”  Booz Allen is working to bring new capabilities like artificial intelligence, machine learning, data analytics, human performance, and visualization to space organizations to help them innovate in this increasingly complex and connected domain.  “As government space initiatives merge with those in the commercial sector, we’ll have essentially unlimited potential in areas like microgravity research, earth characterization, transportation, and manufacturing,” Reilly said. “But we will need to be able to adapt and respond at ever-increasing rates. I’m excited to join a team with the ability to recognize, scope, and respond to future needs in this evolving market.”  Reilly’s background also includes forging collaborative partnerships for the University of Alabama’s In-Space Manufacturing Initiative, managing higher education and professional development programs in STEM and space sciences, and providing space operations training to joint U.S. and allied forces as the lead curriculum developer for the U.S. Air Force National Security Space Institute. He has been involved in R&D, quality control, technical services, and new product development with private sector technology companies as well.  Reilly began his career as a geologist, participating in exploration missions across North America and Antarctica and applying new imaging technology to deep water engineering products and biological research. He also served honorably in the U.S. Navy Reserve.  Learn more about how Booz Allen supports NASA and brings the latest technology solutions to space missions.","17":"Booz Allen Hamilton Holding Corporation will webcast its 2021 Investor Day presentations from 9 a.m. to 12 p.m. EDT on Tuesday, October 5, 2021.McLean, VA – Booz Allen Hamilton Holding Corporation (NYSE: BAH), the parent company of management and technology consulting firm Booz Allen Hamilton, is planning to host its 2021 Investor Day in New York City on Tuesday, October 5 from 9 am to 12 pm. The event will include presentations by Chief Executive Officer Horacio Rozanski, Chief Financial Officer Lloyd Howell, and other executives. Booz Allen leaders will engage in a conversation on the firm’s growth strategy and multi-year outlook for financial performance and capital deployment.  The event will be accessible to the public through a link on the investor relations section of the Booz Allen Hamilton website at investors.boozallen.com. A replay of the presentations will be available online following the event on October 5 at investors.boozallen.com. Participants planning to attend in person will be required to be vaccinated and have the ability to show proof of vaccination.","18":"Booz Allen won a position on the $350M National Institutes of Health (NIH) BITSDIS contract supporting biomedical informatics for the National Cancer Institute (NCI).McLean, VA – Booz Allen Hamilton (NYSE: BAH) announced today it won a position on Biomedical Information Technology, Software Development, and Informatics Support (BITSDIS), a 5-year indefinite-delivery, indefinite-quantity (IDIQ) contract worth up to $350 million to support the National Institutes of Health (NIH) National Cancer Institute (NCI) Center for Biomedical Informatics and Information Technology (CBIIT). As a part of this IDIQ, Booz Allen was awarded a $29.9 million task order to support the evolving needs of the cancer research community. Through this award, the Institute has selected a strategic partner that brings a cross-functional, integrated team that will bridge rapid advances between life science research, data science, and technology to drive scientific breakthroughs, support the clinical research enterprise, and strengthen its mission-critical operations.  Under the Clinical Trials Reporting Program (CTRP) task order, Booz Allen will provide the complete range of software development, system engineering, and operational support toward the following ends: • Enhance CTRP as the definitive source for information on all NCI-supported cancer-related clinical trials • Facilitate the capture of information across the cancer research ecosystem to improve clinical trial search, prioritization, and patient\/trial matching • Support scientific research aimed to rapidly develop and deploy safe and effective COVID-19 vaccines through the collection, analysis, and reporting of serology test results  As an IDIQ awardee, Booz Allen will provide a broad range of biomedical information technology (IT), informatics, analytical, and consultative services to empower NCI’s clinicians and scientists with leading-edge capabilities and platforms to accelerate their research and support the Institute’s strategic programs and initiatives.  “As a long-standing partner of the National Institutes of Health, we are excited to bring our firm’s full suite of life science, cloud computing, advanced analytics, and technology modernization capabilities to accelerate cancer research and care,” said Roman Salasznyk, senior vice president and leader of Booz Allen’s life science practice. “We look forward to working with the National Cancer Institute to transform the cancer research enterprise by leveraging our deep scientific and technical talent base to meet the Institute’s informatics, data, and IT needs.”  Read more about Booz Allen’s life sciences practice and our expertise in health technology and IT modernization.","19":"Booz Allen has acquired Tracepoint, a digital forensics and incident response (DFIR) company serving public and private sector clients. • Combination will enable Booz Allen to deliver an unrivaled breadth and depth of cyber services and solutions. • Tracepoint’s leading DFIR capabilities and extensive customer relationships will complement and scale Booz Allen’s existing commercial portfolio and expand its position in the private sector cyber market. • Booz Allen intends to integrate Tracepoint and its commercial cyber business in early calendar year 2022.  McLean, VA – Booz Allen Hamilton (NYSE:BAH) today announced that it has completed the acquisition of Tracepoint, an industry-leading digital forensics and incident response (DFIR) company serving public and private sector clients. Booz Allen exercised its option to acquire the remainder of Tracepoint’s business after making an initial strategic investment in Tracepoint in January 2021. This transaction is part of a broader capital deployment strategy to accelerate Booz Allen’s entry and advancement in critical technology areas. Terms of the agreement were not disclosed.  Co-founded in December 2019 by Baton Rouge-based Plexos Group, Chris Salsberry, Brett Anderson, and Rob Driscoll and based in Fredericksburg, Virginia, Tracepoint is a recognized leader in DFIR, remediation, and cyber risk and resilience management. Tracepoint brings vast threat intelligence from its experience remediating the most pernicious tactics, techniques, and procedures deployed by advanced threat actors and specializes in helping cyber insurance carriers, lawyers, brokers, and their clients respond to cyber incidents.  Booz Allen intends to integrate its Commercial Cyber business and Tracepoint in early 2022 as part of its long-term growth plan to create a scaled business in three key areas: incident response, enterprise consulting, and managed services. The integration process will focus on creating opportunity and value for both organizations, accelerating growth, and increasing market share while preserving Tracepoint’s competitive agility and continuing to solve the world’s most complex cybersecurity challenges with the best cybersecurity talent.    “We see strong demand and a clear opportunity as organizations and governments around the globe face increasingly sophisticated cyber threats and believe this is the right time for us to further elevate our incident response capabilities and talent; this transaction aligns with that strategic approach,” said Horacio Rozanski, Booz Allen president and chief executive officer.  “Tracepoint has an exceptionally qualified team with strong brand recognition in the DFIR market and extensive relationships in its core sectors to expand our commercial offering and accelerate our growth,” said Bill Phelps, executive vice president and leader of Booz Allen’s commercial business. “We have a proven track record of successful collaboration with Tracepoint and will leverage the complementary strengths of both businesses to cement our status as a leading competitor in the global marketplace. I am excited to begin this new chapter of growth.”  “Today’s announcement is a testament to our team’s exceptional work in building Tracepoint into the industry leader that it is today,” said Chris Salsberry, Tracepoint’s chief executive officer. “Booz Allen has decades of experience working across the most significant breaches and clients and will provide strong foundations from which we can continue to grow and expand our business. We are thrilled to enter the market together as partners.”  Booz Allen retained Goldman Sachs & Co LLC as financial advisor for the transaction and King & Spalding LLP as legal advisor. Tracepoint retained Raymond James & Associates, Inc. as financial advisor and Holland & Knight, LLP as legal advisor.","20":"Booz Allen Hamilton has opened a new office in Honolulu, Hawaii, located at First Hawaiian Center, and supporting 250 employees.McLean, Va. – Booz Allen Hamilton (NYSE: BAH) announced that it has opened a new office in Honolulu, Hawaii, expanding upon the firm’s current footprint in the region to meet talent growth and increasing mission demand. Located at First Hawaiian Center, the facility supports 250 employees and offers a range of capabilities including an artificial intelligence (AI) and innovation center.  Booz Allen has had a presence in Hawaii since 1961 when the firm worked with Kamehameha Schools to develop a strategy for the future. With dedicated facilities open in the islands since the early 2000s, Booz Allen Hawaii leads the way in meeting critical Indo-Pacific missions with clients like INDOPACOM and supports U.S. government, Department of Defense (DOD), and civilian agencies in the islands as well as in Guam, Singapore, Korea, Japan, and Alaska.  “Booz Allen has been investing in resources in Hawaii for decades, hiring and cultivating top-tier talent in AI, systems delivery, cyber, and other critical skills and building state-of-the-art facilities where we can co-create with our clients,” said Booz Allen Senior Vice President Rex Jordan, who serves as senior leader for the firm’s global enterprise in the region. “With the Indo-Pacific region on the front line of the biggest defense pivots in years, our new office strengthens our ability to deliver capabilities that INDOPACOM can field immediately and scale quickly.”  As the premier digital integrator for the DOD, Booz Allen has long leveraged its Honolulu office to drive industry-leading capabilities that address the top priorities of warfighters in the region. This includes Joint All-Domain Command & Control (JADC2), next-gen data systems, AI, security cooperation, and digital engineering.    The relocation to a new, larger office space follows nearly 10-percent growth in the last year alone, with goals to continue expanding in the city. The new office reflects Booz Allen’s overall commitment to sustainability, incorporating the firm’s NextGen standards and environmentally friendly features. The location is close to both public transit and 24,000 square feet of open plaza, landscaping, and water features.  Booz Allen Hawaii has been a longtime hub of volunteerism and community support in the region. Recent partnerships and projects include helping to digitize the archives of the Bishop Museum, supporting local chapters of the ALS Foundation and YWCA, and working with Ho'ōla Nā Pua to fight human trafficking in the islands. Booz Allen also supports Hawaii FIRST Robotics by volunteering, providing grants, and fostering an on-island tech talent pipeline.  “Now more than ever, the community needs to unite and find innovative ways to help vulnerable populations,” said Booz Allen Vice President and Honolulu leader Bob Lietzke. “We’re committed to contributing our time and expertise in consulting, analytics, cyber, digital modernization, and other areas to those in need. Our new office space will allow us to keep meeting those critical missions for our clients, our communities, and the region at large.”    This month, Booz Allen will host a traditional Hawaiian office blessing ceremony led by a local Kumu at the new facility and plans to host a formal ribbon-cutting event in 2022.  Learn more about Booz Allen’s Honolulu and Indo-Pacific presence and how we help support our clients’ critical missions in the region.","21":"Booz Allen will spin out its commercial artificial intelligence platform Modzy® into a new company, Modzy, Inc.McLean, VA – Booz Allen Hamilton (NYSE: BAH) announced today it has completed a transaction to spin out its commercial artificial intelligence (AI) platform Modzy® into a new company, Modzy, Inc.  Modzy, which includes a deep tech software platform and team of AI experts, accelerates the deployment of production-ready AI, provides tools for data scientists and developers to easily integrate AI into enterprise and edge systems at scale, and offers a centralized location for stakeholders to monitor all AI performance. These features help organizations overcome today’s toughest challenges with scaling and monitoring AI-powered systems. Modzy will continue to build upon its existing customer base across commercial and federal markets, expand its partner ecosystem, and grow its developer community.  The spinout follows a similar recent transaction with the cyber threat hunting and detection platform SnapAttack. Booz Allen will maintain a minority ownership stake in Modzy, Inc. Financial terms were not disclosed.  “Our innovation strategy includes a commitment to identifying, evaluating, incubating, and scaling cutting-edge solutions and empowering our innovators to build and scale products that help clients achieve new outcomes faster. By spinning out Modzy, we continue to take a focused approach to accelerating innovation at the intersection of mission and technology,” said Booz Allen Chief Innovation Officer Susan Penfield.  “Modzy solves the hardest problem with using AI at scale, which is that businesses struggle to deploy and integrate AI into production. Too many models—more than 50%—are developed but never used,” said Modzy Chief Executive Officer and Co-founder, Dr. Josh Sullivan. “Modzy will continue to scale rapidly, building on our existing customer base across commercial markets through expansion of our partner ecosystem and developer community to accelerate AI value creation.”","22":"Booz Allen has made a strategic investment in Latent AI, Inc., a rapidly growing company with an award-winning suite of software tools that enable adaptive artificial intelligence (AI) and machine learning (ML) at the edge.McLean, VA – Booz Allen Hamilton (NYSE: BAH) announced today that it has made a strategic investment in Latent AI, Inc., a rapidly growing company with an award-winning suite of software tools that enable adaptive artificial intelligence (AI) and machine learning (ML) at the edge.  Particularly for defense organizations, the ability to deploy and run AI\/ML models at the tactical edge is critical to achieving situational awareness, and AI is an increasingly essential component of mission success. Latent AI technologies simplify and accelerate traditional AI workflows, from model training and optimization to enhancing the way AI models are deployed, for more robust, efficient, and agile Internet of Things (IoT) applications that improve user adoption and mission impact.  “The National Defense Strategy calls for a more innovative, resilient military to maintain the U.S. competitive advantage, and the ability to collect, analyze and quickly act on data is at the core of that national security mission,” said Steve Escaravage, senior vice president at Booz Allen. “To fully leverage a force that is interconnected and information-advantaged, defense organizations need optimized, scalable AI and data compression at the tactical edge. Booz Allen’s investment in Latent AI will help enable our clients to implement ML models on small form factor chip-sets and into highly sought-after end user devices, which will increase AI adoption and return on investment.”  The Latent AI Efficient Inference Platform™ (LEIP) is a modular, fully integrated edge AI development platform that optimizes the compute, energy consumption and memory allocation of tactical edge devices without requiring changes to prior model infrastructures or edge system designs. LEIP enables rapid, highly scalable and adaptable AI application development at the tactical edge regardless of framework, operating system, architecture or hardware.  “This investment enhances the ability of both Latent AI and Booz Allen to meet the evolving needs of clients, particularly in deploying algorithms to the edge to prevail in the future digital battlefield,” said Brian MacCarthy, Booz Allen vice president and founder of the firm’s Tech Scouting group based out of San Francisco since 2015. “Sitting at the intersection of technology and mission, Booz Allen can help dual-use emerging tech companies connect the most innovative, advanced solutions to government’s critical mission requirements.”  Latent AI was co-founded in 2018 as an early-stage venture spinout of SRI International and is funded by Future Ventures, Autotech Ventures, Perot Jain, and other prominent investors. The company has been recognized on CB Insight’s AI 100 and was named the 2020 Startup of the Year by IoT World.  “We founded Latent AI because we saw an opportunity to help developers and organizations transition more efficiently to the edge—and we have only scratched the surface of what is possible,” said Jags Kandasamy, co-founder and CEO at Latent AI. “Both Latent AI and Booz Allen are dedicated to helping organizations achieve significantly more with their AI systems, and we are excited to have Booz Allen as an investor and partner as we pave the path forward to a smarter edge.”  As one of the largest providers of AI services for the federal government, Booz Allen already delivers some of the most advanced AI, ML, and data architecture technologies, services, and strategies through its work with the Joint AI Center, Army Futures Command and U.S. Air Force Air Combat Command, among others.  Learn more about AI at Booz Allen at http:\/\/www.boozallen.com\/AI.","23":"Booz Allen's Colorado Springs facility has been selected by the Defense Counterintelligence and Security Agency (DCSA) as a 2021 Cogswell Award winner for outstanding industrial security achievement for the second time.McLean, VA – Booz Allen Hamilton (NYSE: BAH) today announced that its Colorado Springs facility has been selected by the Defense Counterintelligence and Security Agency (DCSA) as a 2021 recipient of the James S. Cogswell Award for outstanding industrial security achievement. This marks the second time Booz Allen has received this award, the most prestigious honor DCSA bestows to cleared industry.  Booz Allen's is one of only 40 facilities recognized by the DCSA this year out of more than 13,000 cleared facilities nationwide. Cogswell awardees are recognized for establishing and maintaining a security program that goes well beyond the minimum National Industrial Security Program (NISP) requirements and providing leadership to other cleared facilities to set high standards for security. Of the approximately 13,000 cleared contractors in the NISP, only the top 0.5% are annually selected to receive a Cogswell award.  “For more than 100 years we’ve built our business with a focus on security excellence, and it is an honor for Booz Allen to again be a Cogswell award recipient,” said Karen Dahut, executive vice president and leader of Booz Allen’s defense and commercial business. “We remain dedicated to serving our aerospace and defense clients’ most complex, critical missions with the highest standards of trust and security.”  The Cogswell Award was established in 1966 in honor of the late Air Force Col. James S. Cogswell, the first chief of the Unified Office of Industrial Security. Col. Cogswell is responsible for the underlying principle of the industrial security program, recognizing the importance of true partnership between industry and government to ensure the protection of classified information, materials, and programs.  “We are proud to be recognized by DCSA for our industrial security excellence. This recognition reflects Booz Allen’s unwavering commitment to protecting our people, our technology and solutions, our nation, and our warfighters,” said Angela Wallace, senior vice president and lead for Booz Allen’s Advanced Programs.","24":"Booz Allen Hamilton announced today it has completed the acquisition of Liberty IT Solutions, LLC for $725 million.Certain statements contained in this press release and in comments by our management include “forward-looking statements” within the meaning of the Private Securities Litigation Reform Act of 1995. Examples of forward-looking statements include information concerning the acquisition of Liberty IT Solutions, LLC and related matters, prospective performance and opportunities, post-closing operations and the expected benefits of the acquisition, as well as any other statement that does not directly relate to any historical or current fact. In some cases, you can identify forward-looking statements by terminology such as “may,” “will,” “could,” “should,” “forecasts,” “expects,” “intends,” “plans,” “anticipates,” “projects,” “outlook,” “believes,” “estimates,” “predicts,” “potential,” “continue,” “preliminary,” or the negative of these terms or other comparable terminology. Although we believe that the expectations reflected in the forward-looking statements are reasonable, we can give you no assurance these expectations will prove to have been correct. These forward-looking statements relate to future events or our future financial performance and involve known and unknown risks, uncertainties and other factors that may cause our actual results, levels of activity, performance, or achievements to differ materially from any future results, levels of activity, performance, or achievements expressed or implied by these forward-looking statements. These risks and other factors include: any issue that compromises our relationships with the U.S. government or damages our professional reputation, including negative publicity concerning government contractors in general or us in particular; changes in U.S. government spending, including a continuation of efforts by the U.S. government to decrease spending for management support service contracts, and mission priorities that shift expenditures away from agencies or programs that we support, or as a result of the presidential and administration transition; efforts by Congress and other U.S. government bodies to reduce U.S. government spending and address budgetary constraints and the U.S. deficit, as well as associated uncertainty around the timing, extent, nature, and effect of such efforts; delayed funding of our contracts due to uncertainty relating to funding of the U.S. government and a possible failure of Congressional efforts to approve such funding and to craft a long-term agreement on the U.S. government’s ability to incur indebtedness in excess of its current limits, or changes in the pattern or timing of government funding and spending; U.S. government shutdowns as a result of the failure by elected officials to fund the government; failure to comply with numerous laws and regulations, including, but not limited to, the Federal Acquisition Regulation (\"FAR\"), the False Claims Act, the Defense Federal Acquisition Regulation Supplement, and FAR Cost Accounting Standards and Cost Principles; the effects of COVID-19 and other pandemics or widespread health epidemics, including disruptions to our workforce and the impact on government spending and demand for our solutions; our ability to compete effectively in the competitive bidding process and delays or losses of contract awards caused by competitors’ protests of major contract awards received by us; variable purchasing patterns under U.S. government General Services Administration Multiple Award schedule contracts, or GSA schedules, blanket purchase agreements and indefinite delivery, indefinite quantity, or IDIQ, contracts; the loss of GSA schedules or our position as prime contractor on government-wide acquisition contract vehicles, or GWACs; changes in the mix of our contracts and our ability to accurately estimate or otherwise recover expenses, time, and resources for our contracts; changes in estimates used in recognizing revenue; our ability to realize the full value of and replenish our backlog, generate revenue under certain of our contracts, and the timing of our receipt of revenue under contracts included in backlog; internal system or service failures and security breaches, including, but not limited to, those resulting from external or internal cyber attacks on our network and internal systems; risks related to the implementation and operation of new financial management systems; an inability to attract, train, or retain employees with the requisite skills and experience; an inability to timely hire, assimilate and effectively utilize our employees, ensure that employees obtain and maintain necessary security clearances and\/or effectively manage our cost structure; the loss of members of senior management or failure to develop new leaders; misconduct or other improper activities from our employees or subcontractors, including the improper use or release of our clients’ sensitive or classified information; increased competition from other companies in our industry; failure to maintain strong relationships with other contractors, or the failure of contractors with which we have entered into a sub- or prime-contractor relationship to meet their obligations to us or our clients; inherent uncertainties and potential adverse developments in legal or regulatory proceedings, including litigation, audits, reviews, and investigations, which may result in materially adverse judgments, settlements, withheld payments, penalties, or other unfavorable outcomes including debarment, as well as disputes over the availability of insurance or indemnification; failure to comply with special U.S. government laws and regulations relating to our international operations; risks associated with increased competition, new relationships, clients, capabilities, and service offerings in our U.S. and international businesses; risks related to changes to our operating structure, capabilities, or strategy intended to address client needs, grow our business, or respond to market developments; the adoption by the U.S. government of new laws, rules, and regulations, such as those relating to organizational conflicts of interest issues or limits; risks related to completed and future acquisitions, including our ability to realize the expected benefits from such acquisitions; the incurrence of additional tax liabilities, including as a result of changes in tax laws or management judgments involving complex tax matters; risks inherent in the government contracting environment; continued efforts to change how the U.S. government reimburses compensation related costs and other expenses or otherwise limits such reimbursements and an increased risk of compensation being deemed unreasonable and unallowable or payments being withheld as a result of U.S. government audit, review, or investigation; increased insourcing by various U.S. government agencies due to changes in the definition of “inherently governmental” work, including proposals to limit contractor access to sensitive or classified information and work assignments; the size of our addressable markets and the amount of U.S. government spending on private contractors; risks related to our indebtedness and credit facilities which contain financial and operating covenants; and the impact of changes in accounting rules and regulations, or interpretations thereof, that may affect the way we recognize and report our financial results, including changes in accounting rules governing recognition of revenue.  Additional information concerning these and other factors can be found in our filings with the Securities and Exchange Commission (the SEC), including in our Annual Report on Form 10-K filed with the SEC on May 21, 2021. All forward looking statements attributable to us or persons acting on our behalf are expressly qualified in their entirety by the foregoing cautionary statements. All such statements speak only as of the date made and, except as required by law, we undertake no obligation to update or revise publicly any forward-looking statements, whether as a result of new information, future events, or otherwise.","25":"NIWC Pacific awarded Booz Allen an IT engineering contract with a potential value of $189.9M supporting the U.S. Navy.McLean, Va. – The Enterprise Communications and Networks (ECN) Division of Naval Information Warfare Center Pacific (NIWC Pacific) awarded Booz Allen Hamilton (NYSE: BAH) a contract with a potential value of $189.9 million over 5 years, to provide a complete range of engineering, technical, cyber, and programmatic services. The work will support networking, communications, and computer systems around the world in service to the Navy’s Program Executive Office (PEO) Digital and the Naval Enterprise Networks (NEN) Program Office, Program Management Warfare (PMW) 205.    The ECN Division plays a central role in the engineering and deployment of services and capabilities for Navy Enterprise Networks. This includes both the Navy Marine Corps Intranet (NMCI) and Base-Level Information Infrastructure\/Outside Continental United States (OCONUS) Navy Enterprise Network (BLII\/ONE-Net). Together, these networks drive the execution of the Navy’s vision for Information Warfare Dominance and Information Superiority through Modernization, Innovation, and Defense.  “NIWC Pacific is at the forefront of the Navy’s research, development, engineering, and support of integrated Command, Control, Communications, Computers, Intelligence, Surveillance and Reconnaissance (C4ISR), cyber, and space systems across all warfighting domains,” said Scott Sautter, vice president at Booz Allen and engineering and technology lead for NIWC Pacific. “Our engineers will support Naval Enterprise Networks to rapidly prototype, test and evaluate, and provide acquisition, installation, and in-service engineering to Naval installations across the globe. Booz Allen’s technical depth and diverse talent are strongly positioned to support the breadth of digital transformation and IT modernization activities required by NIWC Pacific and PEO Digital, and we are honored to continue our support to the Navy’s mission.”  Booz Allen was selected as a trusted and strategic partner to provide innovation, technology transformation, capability insertion, and sustainment of fielded IT systems across Ashore, Mobile, and Joint domains, while continuously striving for improvement and introduction of industry best practices and emerging technology. The scope of this critical work requires insight into the Navy’s strategic goals and industry trends with a broad range of expertise including Systems Engineering, Network Engineering, Testing, and Validation, with increasing focuses on Automation and Orchestration, AI\/ML, and Digital Engineering.  Read more about Booz Allen’s deep commitment to supporting the U.S. Navy and Marine Corps, and how we help advance the Department of Defense’s many mission areas here.","26":"Booz Allen Hamilton Holding Corporation (NYSE: BAH) (“Booz Allen”) announced the commencement of a private offering of $500.0 million aggregate principal amount of senior notes (the “Notes”) by its wholly-owned subsidiary, Booz Allen Hamilton Inc. (the “Issuer”).McLean, Virginia – Booz Allen Hamilton Holding Corporation (NYSE: BAH) (“ ”) announced the commencement of a private offering of $500.0 million aggregate principal amount of senior notes (the “ ”) by its wholly-owned subsidiary, Booz Allen Hamilton Inc. (the “ ”). Each of the Issuer’s existing and future restricted subsidiaries that guarantee the Issuer’s obligations under its senior credit facility and certain other indebtedness (the “ ”) will guarantee the Notes on a senior unsecured basis. There can be no assurance that the proposed offering of Notes will be completed.  The Issuer intends to use the net proceeds from the sale of the Notes to fund the acquisition of Liberty IT Solutions, LLC (the “ ”) and to pay related fees and expenses. The closing of the Acquisition is not contingent on the receipt of any financing, including from the sale of the Notes, and may occur prior to the closing of the offering. If the Acquisition is not consummated, the Issuer intends to use the net proceeds from the sale of the Notes for working capital and other general corporate purposes.  The Notes and the guarantees will be offered in a private offering exempt from the registration requirements of the United States Securities Act of 1933, as amended (the “ ”). The Notes and the guarantees will be offered and sold only to qualified institutional buyers pursuant to Rule 144A and in offshore transactions to non-U.S. persons pursuant to Regulation S, each under the Securities Act.  The Notes and the guarantees have not been registered under the Securities Act and may not be offered or sold in the United States absent registration or an applicable exemption from the registration requirements of the Securities Act and applicable state laws.  This press release is for informational purposes only and is not an offer to sell or purchase nor the solicitation of an offer to sell or purchase securities and shall not constitute an offer, solicitation or sale in any state or jurisdiction in which, or to any person to whom such an offer, solicitation or sale would be unlawful.  This press release includes forward-looking statements regarding Booz Allen’s financing plans, including statements related to the Issuer’s offering of the Notes and intended use of net proceeds of the offering. Such statements are subject to certain risks and uncertainties including, without limitation, risks related to whether the Issuer will consummate the Acquisition or the offering of the Notes on the expected terms, or at all, market and other general economic conditions and whether the Issuer and the Guarantors will be able to satisfy the conditions required to close any sale of the Notes. Booz Allen’s forward-looking statements also involve assumptions that, if they never materialize or prove correct, could cause its results to differ materially from those expressed or implied by such forward-looking statements. These and other risks concerning Booz Allen and its businesses are described in additional detail in its Annual Report on Form 10-K for the year ended March 31, 2021 and other filings made by Booz Allen with the Securities and Exchange Commission.","27":"Booz Allen Hamilton Holding Corporation (NYSE: BAH) (“Booz Allen”) announced that its wholly-owned subsidiary, Booz Allen Hamilton Inc. (the “Issuer”), has priced $500.0 million aggregate principal amounts of its 4.000% Senior Notes due 2029 (the “Notes”).McLean, Virginia – Booz Allen Hamilton Holding Corporation (NYSE: BAH) (“ ”) announced that its wholly-owned subsidiary, Booz Allen Hamilton Inc. (the “ ”), has priced $500.0 million aggregate principal amounts of its 4.000% Senior Notes due 2029 (the “ ”). The offering is expected to close on June 17, 2021, subject to certain closing conditions. Each of the Issuer’s existing and future restricted subsidiaries that guarantee the Issuer’s obligations under its senior credit facility and certain other indebtedness (the “ ”) will guarantee the Notes on a senior unsecured basis.  The Issuer intends to use the net proceeds from the sale of the Notes to fund the acquisition of Liberty IT Solutions, LLC (the “ ”) and to pay related fees and expenses. The closing of the Acquisition is not contingent on the receipt of any financing, including from the sale of the Notes, and may occur prior to the closing of the offering. If the Acquisition is not consummated, the Issuer intends to use the net proceeds from the sale of the Notes for working capital and other general corporate purposes.  The Notes and the guarantees are being offered and sold in a private offering exempt from the registration requirements of the United States Securities Act of 1933, as amended (the “ ”). The Notes and the guarantees will be offered and sold only to qualified institutional buyers pursuant to Rule 144A and in offshore transactions to non-U.S. persons pursuant to Regulation S, each under the Securities Act.  The Notes and the guarantees have not been registered under the Securities Act and may not be offered or sold in the United States absent registration or an applicable exemption from the registration requirements of the Securities Act and applicable state laws.  This press release is for informational purposes only and is not an offer to sell or purchase nor the solicitation of an offer to sell or purchase securities and shall not constitute an offer, solicitation or sale in any state or jurisdiction in which, or to any person to whom such an offer, solicitation or sale would be unlawful.  This press release includes forward-looking statements regarding Booz Allen’s financing plans, including statements related to the Issuer’s offering of the Notes and intended use of net proceeds of the offering. Such statements are subject to certain risks and uncertainties including, without limitation, risks related to whether the Issuer will consummate the Acquisition or the offering of the Notes on the expected terms, or at all, market and other general economic conditions and whether the Issuer and the Guarantors will be able to satisfy the conditions required to close any sale of the Notes. Booz Allen’s forward-looking statements also involve assumptions that, if they never materialize or prove correct, could cause its results to differ materially from those expressed or implied by such forward-looking statements. These and other risks concerning Booz Allen and its businesses are described in additional detail in its Annual Report on Form 10-K for the year ended March 31, 2021 and other filings made by Booz Allen with the Securities and Exchange Commission.","28":"Booz Allen Hamilton announced it has partnered with Databricks, the data and AI company, to drive business value by unifying data and artificial intelligence (AI) to meet federal agencies’ data challenges and advance their missions.McLean, Va. – Booz Allen Hamilton (NYSE: BAH) announced today it has partnered with Databricks, the data and artificial intelligence (AI) company, to drive business value by unifying data and AI to meet federal agencies’ data challenges and advance their missions.  Booz Allen’s innovative, industry-leading analytics capabilities deliver mission-critical technologies, services, and strategies to help clients reach their full data analytics potential in any environment. Databricks’ Lakehouse Platform helps organizations accelerate innovation by unifying data engineering, data science, machine learning (ML), and analytics within a single open, collaborative platform for all of their data-driven use cases. As Booz Allen and Databricks partner to combine capabilities, agencies can now access even faster, more efficient end-to-end solutions to address their most pressing needs.  Booz Allen is the largest provider of AI services for the federal government and already delivers some of the most advanced AI, ML, and data architecture solutions through its work with the Joint AI Center, Army Futures Command, and Veteran Benefits Administration, among other defense, civilian, and intelligence agencies. The combined power of Databricks and Booz Allen provides an unmatched resource for data-driven insights and decision making, with key applications including:  Scalable Enterprise AI Operations: Data-driven decision making requires the ability to quickly analyze massive amounts and types of data. Booz Allen delivers scalable ML workflows to accelerate AI initiatives beyond the lab to deploy them to the enterprise and enable trusted, machine-led insights in real time. Now with Databricks’ Lakehouse Platform, clients can experience the power of machine learning operations (MLOps) across the enterprise, building scalable AI infrastructures to integrate and automate the process of ingesting enormous amounts of data in a single platform. Organizations will be able to more quickly develop, train, and automate AI and ML models for increased accuracy, efficiency, and explainability.  Fraud, Waste, and Abuse Detection and Mitigation: Booz Allen harnesses AI as a powerful tool for detecting patterns and anomalies in massive amounts of data such as those processed by healthcare and financial organizations. Critical to mitigating risks from these activities is both the ability to seamlessly bring together disparate data to bridge the information asymmetry gaps and hyper tune ML models in real time to combat the constantly evolving threat vectors. Now, using Databricks’ single unified platform, data scientists and data engineers can operate in a single collaborative environment for building robust data pipelines. This enables them to rapidly explore and interrogate data sets for anomalies, prepare and manage ML models from inception to delivery, refine data quality in data lakes, and unify batch and streaming services for advanced risk detection and scoring. Those models can then be deployed into production settings and run closer to the point of transaction, efficiently and securely processing and training on billions of transactions to accurately detect risks and continuously improve outcomes—enhancing the speed and performance for forecasting, ML, and analysis of large datasets.  Genomics Data Processing: AI can bring enormous computing power to advancing the genomics mission, and Booz Allen brings deep mission expertise to help agencies unlock value from data to improve insights. Databricks’ Lakehouse platform accelerates the data engineering required to build high-quality genomic processing data delivery pipelines that convert raw data into valuable clinical information that drive insights and action.  \"The ability to uncover actionable insights from data has never been more important as enterprises look to adapt, innovate, and better prepare for the future in an uncertain world,\" said Howard Levenson, general manager, Databricks Federal. “We’re excited to be working with Booz Allen as they leverage the power of Databricks’ Lakehouse Platform to help organizations solve their toughest problems with data. We look forward to seeing the value this partnership delivers for our joint customers.”  At Databricks’ 2021 Partner Executive Summit, Booz Allen was named Federal Partner of the Year for its significant impact at a global scale and strong investments in training, marketing, and solutions as the leading provider of AI services to government agencies. The Booz Allen and Databricks partnership has already resulted in multiple successful joint implementations, more than 500 trained Databricks practitioners, and multiple accelerator solutions to drive results to meet essential government data missions.  “Combining Booz Allen’s deep technical expertise and mission knowledge with Databricks’ rich Lakehouse Platform will deliver truly powerful AI insights and outcomes for defense, federal civilian, and intelligence agencies as they face the most urgent national data challenges,” said John Larson, senior vice president at Booz Allen. “The accelerated collaboration, scale, and data-driven insights that this partnership brings will add tremendous value for our federal clients as they leverage these advanced capabilities to serve our national priorities.”  Learn more about AI at Booz Allen at www.boozallen.com\/analytics.","29":"Booz Allen Hamilton (NYSE: BAH) announced today that Jon G. Muñoz has joined the firm as vice president and chief diversity, equity, and inclusion (DEI) officer.McLean, VA – Booz Allen Hamilton (NYSE: BAH) announced today that Jon G. Muñoz has joined the firm as vice president and chief diversity, equity, and inclusion (DEI) officer.  Muñoz has more than 25 years of DEI, multicultural marketing, community engagement, and human resources experience across a range of industries including hospitality, wireless communications, and financial services. An expert in leading national and global diversity and inclusion management practices, Muñoz will work with leaders and teams across the firm to drive a comprehensive approach to Booz Allen’s DEI mission—ensuring Booz Allen is an inclusive and equitable workplace where all employees feel that they belong, are valued, and can achieve their full potential.  Muñoz was most recently vice president of global diversity and inclusion at Hilton, where he directed the company’s diversity and inclusion management practice focused on culture, talent, and marketplace initiatives. Under his leadership, Hilton’s DEI commitment received numerous industry awards and recognitions from DiversityInc, Great Place to Work, Fortune, Forbes, the Human Rights Campaign, and others."},"url":{"0":"https:\/\/www.boozallen.com\/menu\/media-center\/q1-2023\/622-5m-nasa-cybersecurity-contract-awarded.html","1":"https:\/\/www.boozallen.com\/menu\/media-center\/q1-2023\/booz-allen-names-kristine-martin-anderson-coo.html","2":"https:\/\/www.boozallen.com\/menu\/media-center\/q1-2023\/booz-allen-maintains-cmmi-maturity-level-5-ratings.html","3":"https:\/\/www.boozallen.com\/menu\/media-center\/q1-2023\/former-fbi-cybersecurity-expert-joins-booz-allen.html","4":"https:\/\/www.boozallen.com\/menu\/media-center\/q1-2023\/booz-allen-invests-in-reveal-technology-inc.html","5":"https:\/\/www.boozallen.com\/menu\/media-center\/q1-2023\/oliver-wyman-to-acquire-booz-allens-mena-based-management-consulting-business.html","6":"https:\/\/www.boozallen.com\/menu\/media-center\/q4-2022\/booz-allen-invests-in-end-to-end-ai-company-synthetaic.html","7":"https:\/\/www.boozallen.com\/menu\/media-center\/q4-2022\/booz-allen-to-acquire-everwatch.html","8":"https:\/\/www.boozallen.com\/menu\/media-center\/q4-2022\/strategic-cyber-operations-expert-rejoins-booz-allen.html","9":"https:\/\/www.boozallen.com\/menu\/media-center\/q3-2022\/engineering-leader-relocates-to-huntsville-alabama.html","10":"https:\/\/www.boozallen.com\/menu\/media-center\/q1-2023\/622-5m-nasa-cybersecurity-contract-awarded.html","11":"https:\/\/www.boozallen.com\/menu\/media-center\/q3-2022\/booz-allen-announces-modzy-spinout.html","12":"https:\/\/www.boozallen.com\/menu\/media-center\/q3-2022\/booz-allen-opens-new-5g-lab-in-central-maryland.html","13":"https:\/\/www.boozallen.com\/menu\/media-center\/q3-2022\/booz-allen-selected-to-commercialize-platform-one.html","14":"https:\/\/www.boozallen.com\/menu\/media-center\/q3-2022\/booz-allen-releases-2021-esg-impact-report.html","15":"https:\/\/www.boozallen.com\/menu\/media-center\/q3-2022\/tracepoint-named-cyber-startup-of-the-year.html","16":"https:\/\/www.boozallen.com\/menu\/media-center\/q3-2022\/booz-allen-hires-retired-astronaut-and-usgs-director.html","17":"https:\/\/www.boozallen.com\/menu\/media-center\/q2-2022\/booz-allen-hamilton-to-webcast-investor-day-2021-presentations.html","18":"https:\/\/www.boozallen.com\/menu\/media-center\/q2-2022\/nih-awards-booz-allen-position-on-350m-contract.html","19":"https:\/\/www.boozallen.com\/menu\/media-center\/q2-2022\/cyber-market-leader-booz-allen-acquires-tracepoint.html","20":"https:\/\/www.boozallen.com\/menu\/media-center\/q3-2022\/booz-allen-opens-new-office-in-honolulu-hawaii.html","21":"https:\/\/www.boozallen.com\/menu\/media-center\/q3-2022\/booz-allen-announces-modzy-spinout.html","22":"https:\/\/www.boozallen.com\/menu\/media-center\/q2-2022\/booz-allen-invests-in-adaptive-ai-company-latent-ai.html","23":"https:\/\/www.boozallen.com\/menu\/media-center\/q2-2022\/booz-allen-recognized-with-2021-cogswell-award.html","24":"https:\/\/www.boozallen.com\/e\/media\/press-release\/q1-2022\/booz-allen-completes-acquisition-of-liberty-it-solutions-llc.html","25":"https:\/\/www.boozallen.com\/e\/media\/press-release\/q1-2022\/niwc-pacific-awards-booz-allen-it-engineering-contract.html","26":"https:\/\/www.boozallen.com\/e\/media\/press-release\/q1-2022\/booz-allen-hamilton-announces-launch-of-senior-notes-offering.html","27":"https:\/\/www.boozallen.com\/e\/media\/press-release\/q1-2022\/booz-allen-hamilton-announces-pricing-of-senior-notes-offering.html","28":"https:\/\/www.boozallen.com\/e\/media\/press-release\/q1-2022\/booz-allen-partners-with-databricks-to-drive-data-analytics.html","29":"https:\/\/www.boozallen.com\/e\/media\/press-release\/q1-2022\/jon-g-munoz-joins-booz-allen.html"},"thumbnail":{"0":"https:\/\/www.boozallen.com\/content\/dam\/boozallen_site\/esg\/images\/body\/landscape\/women-on-laptop-in-tech-lab-thumbnail.jpg.transform\/160x90\/q82\/feature\/image.jpeg","1":"https:\/\/www.boozallen.com\/content\/dam\/boozallen_site\/esg\/images\/body\/landscape\/press-release-digital-solutions-4.jpg.transform\/160x90\/q82\/feature\/image.jpeg","2":"https:\/\/www.boozallen.com\/content\/dam\/boozallen_site\/esg\/images\/body\/landscape\/press-release-consulting-1.jpg.transform\/160x90\/q82\/feature\/image.jpeg","3":"https:\/\/www.boozallen.com\/content\/dam\/boozallen_site\/esg\/images\/body\/landscape\/press-release-cyber-1.jpg.transform\/160x90\/q82\/feature\/image.jpeg","4":"https:\/\/www.boozallen.com\/content\/dam\/boozallen_site\/esg\/images\/hero\/press-release-3.jpg.transform\/160x90\/q82\/feature\/image.jpeg","5":"https:\/\/www.boozallen.com\/content\/dam\/boozallen_site\/esg\/images\/body\/landscape\/news-thumb-v12.png.transform\/160x90\/q82\/feature\/image.png","6":"https:\/\/www.boozallen.com\/content\/dam\/boozallen_site\/esg\/images\/body\/landscape\/press-release-2-thumb.jpg.transform\/160x90\/q82\/feature\/image.jpeg","7":"https:\/\/www.boozallen.com\/content\/dam\/boozallen_site\/esg\/images\/body\/landscape\/press-release-merger-and-accquistion-thumb.png.transform\/160x90\/q82\/feature\/image.png","8":"https:\/\/www.boozallen.com\/content\/dam\/boozallen_site\/esg\/images\/body\/landscape\/news-thumb-v12.png.transform\/160x90\/q82\/feature\/image.png","9":"https:\/\/www.boozallen.com\/content\/dam\/boozallen_site\/dig\/images\/body\/landscape\/intelligence-community-digital-transformation-thumb.jpg.transform\/160x90\/q82\/feature\/image.jpeg","10":"https:\/\/www.boozallen.com\/content\/dam\/boozallen_site\/esg\/images\/body\/landscape\/women-on-laptop-in-tech-lab-thumbnail.jpg.transform\/160x90\/q82\/feature\/image.jpeg","11":"https:\/\/www.boozallen.com\/content\/dam\/boozallen_site\/esg\/images\/body\/landscape\/press-release-analytics-1.jpg.transform\/160x90\/q82\/feature\/image.jpeg","12":"https:\/\/www.boozallen.com\/content\/dam\/boozallen_site\/ccg\/images\/hero\/5g.jpg.transform\/160x90\/q82\/feature\/image.jpeg","13":"https:\/\/www.boozallen.com\/content\/dam\/boozallen_site\/esg\/images\/hero\/platform-one-the-future-of-open-architecture-services-.jpg.transform\/160x90\/q82\/feature\/image.jpeg","14":"https:\/\/www.boozallen.com\/content\/dam\/boozallen_site\/esg\/images\/body\/landscape\/esg-thumbnail-760x428.jpg.transform\/160x90\/q82\/feature\/image.jpeg","15":"https:\/\/www.boozallen.com\/content\/dam\/boozallen_site\/esg\/images\/body\/landscape\/tropic-press-release-thumb-760x430.png.transform\/160x90\/q82\/feature\/image.png","16":"https:\/\/www.boozallen.com\/content\/dam\/boozallen_site\/esg\/images\/body\/landscape\/news-thumb-v12.png.transform\/160x90\/q82\/feature\/image.png","17":"https:\/\/www.boozallen.com\/content\/dam\/boozallen_site\/esg\/images\/body\/landscape\/news-thumb-financial.png.transform\/160x90\/q82\/feature\/image.png","18":"https:\/\/www.boozallen.com\/content\/dam\/boozallen_site\/ccg\/images\/body\/landscape\/cmo-corner-blog-series.jpg.transform\/160x90\/q82\/feature\/image.jpeg","19":"https:\/\/www.boozallen.com\/content\/dam\/boozallen_site\/esg\/images\/body\/landscape\/tropic-press-release-thumb-760x430.png.transform\/160x90\/q82\/feature\/image.png","20":"https:\/\/www.boozallen.com\/content\/dam\/boozallen_site\/esg\/images\/body\/landscape\/women-on-laptop-in-tech-lab-thumbnail.jpg.transform\/160x90\/q82\/feature\/image.jpeg","21":"https:\/\/www.boozallen.com\/content\/dam\/boozallen_site\/esg\/images\/body\/landscape\/press-release-analytics-1.jpg.transform\/160x90\/q82\/feature\/image.jpeg","22":"https:\/\/www.boozallen.com\/content\/dam\/boozallen_site\/esg\/images\/body\/landscape\/press-release-analytics-3.jpg.transform\/160x90\/q82\/feature\/image.jpeg","23":"https:\/\/www.boozallen.com\/content\/dam\/boozallen_site\/esg\/images\/body\/landscape\/press-release-cyber-1.jpg.transform\/160x90\/q82\/feature\/image.jpeg","24":"https:\/\/www.boozallen.com\/content\/dam\/boozallen_site\/esg\/images\/body\/landscape\/liberty-close-press-release-thumb.jpg.transform\/160x90\/q82\/feature\/image.jpeg","25":"https:\/\/www.boozallen.com\/content\/dam\/boozallen_site\/esg\/images\/body\/landscape\/press-release-cyber-1.jpg.transform\/160x90\/q82\/feature\/image.jpeg","26":"https:\/\/www.boozallen.com\/content\/dam\/boozallen_site\/esg\/images\/body\/landscape\/press-release-consulting-1.jpg.transform\/160x90\/q82\/feature\/image.jpeg","27":"https:\/\/www.boozallen.com\/content\/dam\/boozallen_site\/esg\/images\/body\/landscape\/press-release-consulting-1.jpg.transform\/160x90\/q82\/feature\/image.jpeg","28":"https:\/\/www.boozallen.com\/content\/dam\/boozallen_site\/esg\/images\/body\/landscape\/press-release-analytics-3.jpg.transform\/160x90\/q82\/feature\/image.jpeg","29":"https:\/\/www.boozallen.com\/content\/dam\/boozallen_site\/esg\/images\/body\/landscape\/news-thumb-v12.png.transform\/160x90\/q82\/feature\/image.png"},"author":{"0":"Boozallen","1":"Boozallen","2":"Boozallen","3":"Boozallen","4":"Boozallen","5":"Boozallen","6":"Boozallen","7":"Boozallen","8":"Boozallen","9":"Boozallen","10":"Boozallen","11":"Boozallen","12":"Boozallen","13":"Boozallen","14":"Boozallen","15":"Boozallen","16":"Boozallen","17":"Boozallen","18":"Boozallen","19":"Boozallen","20":"Boozallen","21":"Boozallen","22":"Boozallen","23":"Boozallen","24":"Boozallen","25":"Boozallen","26":"Boozallen","27":"Boozallen","28":"Boozallen","29":"Boozallen"}}