{"date":{"0":"20 MAY 2022","1":"17 MAY 2022","2":"10 MAY 2022","3":"30 MARCH 2022","4":"17 MARCH 2022","5":"10 MARCH 2022","6":"9 MARCH 2022","7":"8 MARCH 2022","8":"10 FEBRUARY 2022","9":"31 JANUARY 2022","10":"22 DECEMBER 2021","11":"16 NOVEMBER 2021"},"title":{"0":"Rolls-Royce Submarines welder to represent UK at international WorldSkills event","1":"Rolls-Royce successfully powers directed energy field tests in U.S.","2":"Rolls-Royce submarines to launch Nuclear Skills Academy and new apprenticeships in Derby","3":"Rolls-Royce awarded £105 million to support UK Hawk Trainer fleet","4":"Rolls-Royce North America invests $400 million in Indiana test facilities","5":"Rolls-Royce announces four new RR300 authorized maintenance centers","6":"Rolls-Royce announces Avidair as latest Authorized Repair Facility","7":"Rolls-Royce announces 2022 First Network Quality Award winners","8":"Rolls-Royce announces UK university to join Cyber Technology Research Network","9":"Rolls-Royce North America recognized as a 'best place to work for LGBTQ+ equality' for fifth consecutive year","10":"Rolls-Royce to develop joint future fighter engine demonstrator with IHI","11":"Rolls-Royce Trent 700 engine to power a further two MRTT aircraft in the UAE"},"article":{"0":"Rolls-Royce Submarines Welder Will Hunt is ready to represent the UK at the WorldSkills event       An expert welder from Rolls-Royce Submarines Ltd will fly the flag for the UK and the East Midlands at the internationally respected WorldSkills 2022 competition in China later this year. Will Hunt, who works at the Raynesway site in Derby, was selected after excelling in national welding competitions. He is now part of the 39-strong Team UK and will face off against rivals from 80 countries to bring home gold in their field. On hearing the news, Will said: “The welding competitions have been an excellent opportunity for me to broaden my welding skills and knowledge. It has also been a great experience welding in a competitive environment at the national finals. To be picked to represent the UK on an international stage is something everyone dreams of and I can only thank Rolls-Royce and my colleagues for the support, training and encouragement they have given me to get this far.”","1":"Rolls-Royce has successfully demonstrated ‘deep magazine’ power capability for directed energy applications, powering multiple, extended laser field tests in collaboration with Lockheed Martin as part of the Layered Laser Defense (LLD) project.   Deep magazine power capability is crucial for directed energy applications, which can be limited by battery-only systems that require recharging or replacement of batteries after a short period of operation. The Rolls-Royce ColdFireTM system includes both battery-powered and near-continuous firing modes, through a compact and fuel-efficient Rolls-Royce M250 gas turbine engine which provides consistent, extended power to operate the laser application. Powered by the Rolls-Royce system, Lockheed Martin’s laser weapon system successfully shot down flying targets during the recent field tests conducted in partnership with the Office of Naval Research at the U.S. Army’s High Energy Laser Systems Test Facility at White Sands Missile Range in New Mexico. Craig McVay, Rolls-Royce Defense, Senior Vice President, said, “The Rolls-Royce ColdFireTM system successfully demonstrated extended firing capability during the field tests, proving the technology is ready to progress to customer applications. We built the most sophisticated power and thermal management system in the world, so we are ready for any challenge. Our U.S. Department of Defense customers continue to express interest in Rolls-Royce directed energy power and cooling technology, and we look forward to briefing them on the outstanding results from the field tests.” Lockheed Martin developed the 100kW-class LLD to demonstrate cutting-edge laser weapon system technologies in an integrated system. Compact but powerful, and coupled with a Rolls-Royce ColdFire power and thermal system, it provides nearly continuous firing capability to engage more types of targets, in larger numbers, with longer range, than previous systems. Paul Shattuck, Lockheed Martin, Director of Directed Energy Systems, said, “Our industry team worked together in great partnership to bring forward critical knowledge to build this compact laser weapon system with a near-limitless magazine.” Rolls-Royce developed and tested the ColdFireTM system for over 10 years with $50 million in company investment. In addition to providing power to the directed energy system, ColdFireTM offers unique and highly effective cooling technology to dissipate the large amount of heat generated by the laser system. Rolls-Royce is an industry leader in thermal management – the company’s advanced gas-turbine engines operate at temperatures far greater than the melting point of metal. That requires sophisticated engineering technology that allows engines to operate safely and effectively for thousands of hours. Rolls-Royce has adapted this proven thermal management knowledge into the ColdFireTM system. Rolls-Royce ColdFireTM is a suite of world-class power and thermal options for any directed energy system, with technology ready now and tailored to the needs of the system. With field-proven laser and platform integration, ColdFireTM is suitable for land, sea or air systems, and features thermal and power options for specific customer needs. Directed energy systems offer low cost per shot and reduced logistical burdens, while offering compelling capabilities against today’s stressing threats including counter-hypersonic, and are versatile and scalable. Regardless of power sources or platform, thermal management integration with the laser is critical to system effectiveness. Rolls-Royce North America employs 5,000 people in 27 states and is one of the world's preeminent manufacturers of highly efficient, integrated power and propulsion solutions. Rolls-Royce power systems are used in aerospace, naval marine, energy and off-highway applications. The ColdFireTM technology was developed in the company’s LibertyWorks advanced technology unit based in Indianapolis, Indiana. Rolls-Royce products and services support customers across North America, including the U.S. Department of Defense.","2":"Image © Crown      Rolls-Royce Submarines Ltd will launch a new skills academy dedicated to nuclear training, alongside 200 additional nuclear apprenticeships starting in September 2022. As part of its drive to boost nuclear capability in the UK and to create a pipeline for nurturing talent right at the start of their careers, Rolls-Royce Submarines has committed to 200 new apprenticeships every year for at least the next ten years. Based in Derby, the new Nuclear Skills Academy will be supported by industry and education experts, including the Nuclear Advanced Manufacturing Research Centre, the National College for Nuclear, the University of Derby and Derby City Council. This ensures new apprentices will have access to the best courses and mentors throughout their apprenticeship.","3":"Rolls-Royce has agreed a new £105 million contract with the UK Ministry of Defence to provide support for the Adour engine which powers the Hawk jet trainer aircraft, including those flown by the Royal Air Force Aerobatic Team - the Red Arrows. The 11-year contract will enable Rolls-Royce to provide the maintenance, repair and overhaul to the two variants of the Adour engine in service in the UK with the work carried out at Rolls-Royce’s UK Defence Headquarters in Bristol as well as representatives deployed at RAF Valley to provide on sit advice to operations.","4":"Rolls-Royce North America will invest $400 million in a major modernization of engine test facilities in Indiana, bringing total company investment in the United States to nearly $1.5 billion in the past decade.  New facilities in Indianapolis will upgrade full engine test capabilities, following a major modernization of advanced manufacturing at the campus. The Indianapolis facility will test engines for a variety of products, including the U.S. Air Force B-52 strategic bomber fleet, after Rolls-Royce won a $2.6 billion contract last fall to manufacture 650 engines for the iconic aircraft. The total Indianapolis campus modernization program began with a previous $600 million investment in new manufacturing facilities, upgraded equipment and advanced technology, which was completed in 2021. The additional $400 million investment in test facilities will further establish the Indianapolis site among the most advanced manufacturing campuses that Rolls-Royce operates anywhere in the world. Combined with a talented UAW workforce of 1,000 among more than 3,300 total employees, the Indianapolis site is highly efficient and competitive within the aerospace industry and other business areas in which the company operates.  Additionally, Rolls-Royce has invested over $100 million coast to coast across the U.S. since 2015, updating facilities in Massachusetts, Georgia, Mississippi, Virginia, South Carolina and California. Tom Bell, Chairman and CEO, Rolls-Royce North America, said, “We are thrilled to expand our modern test capabilities and footprint in Indianapolis. We’re developing state-of-the-art facilities that will enhance our recent modernization project and create value for our customers with highly efficient and advanced manufacturing capabilities. Rolls-Royce North America is growing, modernizing, and leading the way across the U.S.” Phil Burkholder, Rolls-Royce Defense, Executive Vice President – Defense Global Assembly, Manufacturing & Test, said, “New testing facilities at our Indianapolis site will further enhance our Indiana advanced manufacturing operations. What we do here provides essential capability for the U.S. military and is also a vital part of the Indiana economy. We appreciate the public officials across federal, state and city governments who continue to support Rolls-Royce in the United States.”  The new Indianapolis test facilities will be built on the company’s Operations Campus near Tibbs Avenue and Raymond Street. The test cells, control rooms and other upgrades will be used to test the modern gas turbine engines manufactured on site, which power a variety of defense and commercial aircraft, ships and power systems in use around the world.  Additionally, Rolls-Royce is investing in test capability in West Lafayette, IN, following on an announcement from 2021 that Rolls-Royce would grow its presence at the Discovery Park District at Purdue. That includes upgrading the company’s electronic engine controls business and adding high-altitude, hybrid electrical and hypersonics test capabilities. The new projects will form a significant, large-scale testing campus at the Discovery Park District, where Rolls-Royce already has an electronic controls facility and conducts advanced engine testing at Purdue’s Zucrow Propulsion Labs.  The five-year test modernization program at the two Indiana sites is in line with the Group’s ongoing investment plans. Rolls-Royce employs 5,000 people in facilities in 27 states and is one of the world's preeminent manufacturers of highly efficient, integrated power and propulsion solutions. Rolls-Royce power systems are used in aerospace, naval marine, energy and off-highway applications.  Rolls-Royce products and services support customers across North America, including the U.S. Department of Defense. Rolls-Royce supports more than 52,000 American jobs through the supply chain, adding $9 billion to the U.S. economy every year.","5":"Rolls-Royce has announced that four FIRST NetworkTM members have enhanced their capabilities to include certified service for RR300 engines. Airborne Engines Ltd., Arrow Aviation and Keystone Turbine Services are each certified as Authorized Maintenance Repair & Overhaul Centers (AMROC). National Airways Corporation Ltd. is certified as an Authorized Maintenance Center (AMC). Each of these companies had previously been certified Rolls-Royce M250 maintenance centers and will now be able to provide world-class service for both the M250 and RR300 product lines. Scott Cunningham, Rolls-Royce Program Director – Helicopters said: “We congratulate Airborne Engines Ltd., Arrow Aviation, Keystone Turbine Services and National Airways Corporation Ltd. for increasing their capabilities and commitment to Rolls-Royce customers around the world. These strong FIRST NetworkTM members help enhance our global network of authorized maintenance providers, giving operators the maximum level of flexibility and competition for local service and support on their Rolls-Royce helicopter engines.” With more than 16,000 turboshaft and turboprop engines in service and 4,500 customers worldwide, the Rolls-Royce FIRST Network provides M250 and RR300 operators a global network of authorized MRO service centers. The FIRST Network includes more than 30 approved, licensed service centers, and its competitive structure means operators can find affordable and reliable service anywhere for Rolls-Royce M250 or RR300 engines.  The proven Rolls-Royce M250 and RR300 engines have powered more than 260 million flight hours of dependable service around the world. To date, more than 33,000 of these workhorse engines have been delivered to the marketplace.  The M250 and RR300 are manufactured in Indianapolis, Indiana, where a $600 million Rolls-Royce investment in modernization and technology programs was recently completed, including state-of-the-art advanced manufacturing.","6":"Rolls-Royce has announced AvidAir as the newest FIRST NetworkTM Authorized Repair Facility. Headquartered in Grain Valley, Missouri, AvidAir will provide limited scope overhaul and replacement maintenance for M250 and RR300 customers. The AvidAir team will provide service related to engine compressor case overhauls, removing the existing plastic liner in series I & II engines and applying a patented carbon fiber material that will reduce lifecycle cost and aircraft downtime, while improving engine performance and reliability.  Rege Hall, Rolls-Royce Customer Service Executive – Helicopters said: “We congratulate AvidAir for their ongoing commitment and investment in capabilities, and are excited to welcome them as a Rolls-Royce Authorized Repair Facility. Their expertise in compressor case overhauls is unparalleled in the market and will be a strong addition to our global FIRST Network team.”  Craig Rookstool, AvidAir President and Director of Operations said: “We are pleased to join the FIRST NetworkTM global support team as an Authorized Repair Facility and expand our relationship with Rolls-Royce. This demonstrates our ongoing commitment to providing solutions that deliver quality, safety and reliability at a reasonable cost to our customers and partners around the world. We look forward to continuing to expand our support capabilities as a FIRST Network member.” With more than 16,000 turboshaft and turboprop engines in service and 4,500 customers worldwide, the Rolls-Royce FIRST Network provides M250 and RR300 operators a global network of authorized MRO service centers. The FIRST Network includes more than 30 approved, licensed service centers, and its competitive structure means operators can find affordable and reliable service anywhere for Rolls-Royce M250 or RR300 engines.  The proven Rolls-Royce M250 and RR300 engines have powered more than 260 million flight hours of dependable service around the world. To date, more than 33,000 of these workhorse engines have been delivered to the marketplace.  The M250 and RR300 are manufactured in Indianapolis, Indiana, where a $600 million Rolls-Royce investment in modernization and technology programs was recently completed, including state-of-the-art advanced manufacturing.","7":"Dallas, Texas – Rolls-Royce announced winners for their 2022 FIRST NetworkTM Quality Awards yesterday at the HAI Heli-Expo. These FIRST Network members have been selected for outstanding performance in the following areas: Best in Class, FIRST Class Service, Outstanding Partnership and Trusted to Deliver Excellence. Best in Class – Keystone Turbine Services Given annually to the company recognized for standing out amongst their peers. A team commonly identified by Rolls-Royce and operators as a preferred maintenance provider; enjoyable to work with, committed to serving the market, and continually performing ahead of expectations. FIRST Class Service – StandardAero Limited Represents the company that continually goes above and beyond to meet their customer's needs. A team that continually demonstrates a \"can-do\" mindset; proactively working with their customers to overcome challenges, anticipating their needs, and implement creative solutions to keep their customers in the air. Outstanding Partnership – H+S Aviation This award recognizes the company that is an enabling partner and integral to the overall success of the Rolls-Royce FIRST Network. This facility is critical to market success by consistently developing innovative and cost-effective capability to support the operator, the FIRST Network, and Rolls-Royce. Trusted to Deliver Excellence (2) – Airborne Engines Ltd. and Arrow Aviation This award represents a company identified for consistently delivering on promises. A service provider that is trusted to perform in accordance with \"promises made, promises kept;\" continually going out of their way to ensure performance matches their commitments while being counted on to deliver excellence every time. David Brulotte, Rolls-Royce FIRST Network Manager said: “We are proud to recognize all of our FIRST Network Quality Award winners. They continue to provide world-class service and reliability that is synonymous with the Rolls-Royce brand.”  With more than 16,000 turboshaft and turboprop engines in service and 4,500 customers worldwide, the Rolls-Royce FIRST Network provides M250 and RR300 operators a global network of authorized MRO service centers. The FIRST Network includes more than 30 approved, licensed service centers, and its competitive structure means operators can find affordable and reliable service anywhere for Rolls-Royce M250 or RR300 engines.  The proven Rolls-Royce M250 and RR300 engines have powered more than 260 million flight hours of dependable service around the world. To date, more than 33,000 of these workhorse engines have been delivered to the marketplace.  The M250 and RR300 are manufactured in Indianapolis, Indiana, where a $600 million Rolls-Royce investment in modernization and technology programs was recently completed, including state-of-the-art advanced manufacturing.","8":"Rolls-Royce has today announced that they are partnering with Queen’s University in Belfast to address cyber threats.        Rolls-Royce has today announced that they are partnering with Queen’s University in Belfast to address cyber threats.   The Rolls-Royce Cyber Technology Research Network launched in 2020 with the goal of building a collaboration with leading cyber security research universities to help address the growing cyber threats to the systems we produce connect, power and protect society. Queen’s University in Belfast will join two US universities in the network: Purdue University in Indiana and Carnegie Mellon University in Pennsylvania. Bringing a UK facility into the network allows Rolls-Royce to extend the innovative developments already being explored in cyber technology research to an international scale and help to inform cyber security thinking for next generation programmes such as Tempest. Phil Townley, Director Future Programmes, Rolls-Royce Defence said: “Across Rolls-Royce we are committed to staying ahead of emerging threats and our customers rely on us to defend them against those threats and remain cyber-resilient. To achieve this, we must remain vigilant and agile as we evolve our security systems. This research network will help to keep Rolls-Royce at the cutting-edge of product cybersecurity. We have already seen proven benefits from the organisations we have collaborated with in the US, and I am looking forward to extending this network within the UK and utilising the expertise that Queen’s University will offer us.” Professor Máire O’Neill, Director at the Centre for Secure Information Technologies (CSIT) based at Queen’s University, added: “We are delighted to join this prestigious network of cybersecurity scientists working to strengthen Rolls-Royce response to emerging and sophisticated cyber threats. CSIT brings a wealth of expertise to the group which will complement the research projects already underway at Carnegie Mellon University and Purdue University.” The technology research network is expected to conduct two to three Rolls-Royce funded projects with each school per year.  All three schools have research projects underway with nearly half starting at the beginning of this year. In total, there are currently over ten separate projects that cover four broad topic areas. The network will not only benefit Rolls-Royce’s Defence business but will also address the cybersecurity challenges across wider business areas including Civil Aerospace. Alan Newby, Director Aerospace Technology & Future Programmes for Rolls-Royce Civil Aerospace business said: “Customers trust Rolls-Royce to design, produce, and service secure products; both today and in the future as global systems continue to become digitally connected and interdependent. The research we are pursuing as part of this network is group wide and will be applicable and provide cross over benefits to all Rolls-Royce businesses from the newly created Electrical and SMR organisations to Civil Aerospace and Power Systems.”","9":"Rolls-Royce North America (RRNA) has a strong commitment to an inclusive culture that enables each of its 6,000+ employees to be at their best every day. That commitment has been recognized by the Human Rights Campaign Foundation with a perfect score on the 2022 Corporate Equality Index (CEI), the nation’s premier benchmarking survey and report on corporate policies and practices related to LGBTQ+ workplace equality. This marks the fifth straight year that RRNA has achieved a perfect score, along with the distinction as a Best Place to Work for LGBTQ+ Equality.       “We are proud to continue to collaborate with the Human Rights Campaign Foundation to champion inclusion and equality for the LGBTQ+ community,” said RRNA People Director Summer Smith. “Rolls-Royce is firmly committed to a culture that values and respects all people; enabling our employees to bring their full, true selves to work every day.” The CEI measures participating companies’ policies and practices related to the LGBTQ+ community in areas like workforce protections, inclusive benefits, inclusive culture and corporate social responsibility. RRNA has a wide variety of benefits supporting the LGBTQ+ community including health coverage for same-sex spouses\/partners and adoption benefits, among others. The company also has a mentoring and reverse mentoring program for its LGBTQ+ colleagues and allies. RRNA has a comprehensive employee resource group program supporting several different dimensions of diversity and promoting inclusion for all employees. The company also has an active presence in the community supporting Pride Month in the U.S. and International Day Against Homophobia, Biphobia, Intersexism and Transphobia (IDAHOBIT). “The culture we have at Rolls-Royce really matters,” said Kelsey Mitchell, Chair of the Propel with Pride Employee Resource Group at RRNA. “We’ve set the standard that everyone deserves to feel safe, supported, and to be 100% themselves at work - anything less is unacceptable. We are eager to keep that momentum going in 2022.” To learn more about opportunities with Rolls-Royce, visit our Careers Page.","10":"Rolls-Royce has agreed to work with IHI Corporation to develop and deliver a future fighter engine demonstrator.            Rolls-Royce has agreed to work with IHI Corporation to develop and deliver a future fighter engine demonstrator.   The engine demonstrator programme will be a critical step forward in enabling the two nations to develop their future fighter aircraft requirements, potentially securing hundreds of future jobs in the UK and Japan.  Work on the joint engine demonstrator will kickstart early next year, with the UK investing an initial £30 million in planning, digital designs and innovative manufacturing developments.  A further £200 million of UK funding is expected to go towards developing a full-scale demonstrator power system, supporting hundreds of highly skilled jobs, including many at Rolls-Royce’s Filton facility in Bristol. Alex Zino, EVP Business Development and Future Programmes at Rolls-Royce Defence said: “Across Rolls-Royce we have a longstanding and valued relationship with our customers and industry partners in Japan. The Industry teams in both UK and Japan bring complementary technologies that will drive cleaner, next generation power and propulsion for both nations future fighter requirements.  The joint engine demonstrator programme is an exciting opportunity to bring together some of the best combat air capabilities in the world and will also enable the development of innovative and critical technologies that will be fundamental to the future of the Defence aerospace industry.” Rolls-Royce has a long and strong heritage of partnering in Japan through the development of technology, engineering and supply chain relationships since the 1960s. The company employs over 40 employees in the Kobe and Tokyo offices, and a further 5,000 Japanese work on Rolls-Royce programmes in our partner organisations. The recent technology programmes conducted by Japanese government and Japanese industries, coupled with access to the technologies being developed in the UK Tempest programme will enable the development of a world-class next generation power and propulsion system.   Today’s announcement helps ensure Rolls-Royce enhances its world-class technology and capabilities and will lead to future UK prosperity. Technology development is key to Rolls-Royce’s competitiveness and future success, and we invest extensively in UK technology, accounting for approximately 3% of annual UK R&D investments. Rolls-Royce’s UK activities prior to COVID-19 represented 0.6% of UK GDP, or £12.1bn. More than 100,000 jobs across the UK are directly and indirectly supported by Rolls-Royce, bolstered by an annual spend of £2.8bn with over 2,300 UK suppliers. Rolls-Royce is a significant contributor to UK prosperity, accounting for around 2% on average of UK goods exports over the last three years.","11":"The Rolls-Royce Trent 700 engine is set to power a further two Multi Role Tanker Transport (MRTT) aircraft for the United Arab Emirates (UAE).  The announcement of the follow-on acquisition order was made by Airbus today during the Dubai Air Show. The UAE already has three Trent 700 powered MRTT in service and with this additional order the total fleet will grow to five, which is a signal of confidence in the MRTT fleet and the power that the Trent 700 engine is able to provide.  In service for over 25 years, the Trent 700 engine has logged over 60 million hours and over 40,090 hours on-wing without a shop visit. Over 70 per cent of operations in the Middle East are powered by the Trent 700 and the majority of the wider A330 fleet is powered by this engine, demonstrating excellent reliability, capability and the lowest lifetime fuel burn of all engine options for the aircraft."},"url":{"0":"https:\/\/www.rolls-royce.com\/media\/press-releases\/2022\/20-05-2022-rr-submarines-welder-to-represent-uk-at-international-worldskills-event.aspx","1":"https:\/\/www.rolls-royce.com\/media\/press-releases\/2022\/17-05-2022-rr-successfully-powers-directed-energy-field-tests-in-us.aspx","2":"https:\/\/www.rolls-royce.com\/media\/press-releases\/2022\/10-05-2022-rr-submarines-to-launch-nuclear-skills-academy-and-new-apprenticeships-in-derby.aspx","3":"https:\/\/www.rolls-royce.com\/media\/press-releases\/2022\/30-03-2022-rr-awarded-105-million-pound-to-support-uk-hawk-trainer-fleet.aspx","4":"https:\/\/www.rolls-royce.com\/media\/press-releases\/2022\/17-03-2022-rr-north-america-invests-400-million-dollar-in-indiana-test-facilities.aspx","5":"https:\/\/www.rolls-royce.com\/media\/press-releases\/2022\/10-03-2022-rr-announces-four-new-rr300-authorized-maintenance-centers.aspx","6":"https:\/\/www.rolls-royce.com\/media\/press-releases\/2022\/09-03-2022-rr-announces-avidair-as-latest-authorized-repair-facility.aspx","7":"https:\/\/www.rolls-royce.com\/media\/press-releases\/2022\/08-03-2022-rr-announces-2022-first-network-quality-award-winners.aspx","8":"https:\/\/www.rolls-royce.com\/media\/press-releases\/2022\/10-02-2022-rr-announces-uk-university-to-join-cyber-technology-research-network.aspx","9":"https:\/\/www.rolls-royce.com\/media\/press-releases\/2022\/31-01-2022-rr-north-america-recognized-best-place-to-work-for-lgbtq-equality-for-fifth-year.aspx","10":"https:\/\/www.rolls-royce.com\/media\/press-releases\/2021\/22-12-2021-rr-to-develop-joint-future-fighter-engine-demonstrator-with-ihi.aspx","11":"https:\/\/www.rolls-royce.com\/media\/press-releases\/2021\/16-11-2021-rr-trent-700-engine-to-power-a-further-two-mrtt-aircraft-in-the-uae.aspx"},"thumbnail":{"0":"https:\/\/www.rolls-royce.com\/~\/media\/Images\/R\/Rolls-Royce\/Stories\/2022\/pr-20-05-2022a.jpg?h=470&iar=0&w=500","1":"https:\/\/www.rolls-royce.com\/~\/media\/Images\/R\/Rolls-Royce\/content-images\/marine\/discover\/landing-images\/pr-default-landing-image-v3.jpg?h=470&iar=0&w=500","2":"https:\/\/www.rolls-royce.com\/~\/media\/Images\/R\/Rolls-Royce\/Stories\/2022\/pr-10-05-2022.jpg?h=470&iar=0&w=500","3":"https:\/\/www.rolls-royce.com\/~\/media\/Images\/R\/Rolls-Royce\/Stories\/2022\/pr-30-03-2022-landing-img.jpg?h=470&iar=0&w=500","4":"https:\/\/www.rolls-royce.com\/~\/media\/Images\/R\/Rolls-Royce\/Stories\/2022\/pr-17-03-2022-landing-img.jpg?h=470&iar=0&w=500","5":"https:\/\/www.rolls-royce.com\/~\/media\/Images\/R\/Rolls-Royce\/content-images\/marine\/discover\/landing-images\/pr-default-landing-image-v3.jpg?h=470&iar=0&w=500","6":"https:\/\/www.rolls-royce.com\/~\/media\/Images\/R\/Rolls-Royce\/content-images\/marine\/discover\/landing-images\/pr-default-landing-image-v3.jpg?h=470&iar=0&w=500","7":"https:\/\/www.rolls-royce.com\/~\/media\/Images\/R\/Rolls-Royce\/content-images\/marine\/discover\/landing-images\/pr-default-landing-image-v3.jpg?h=470&iar=0&w=500","8":"https:\/\/www.rolls-royce.com\/~\/media\/Images\/R\/Rolls-Royce\/content-images\/press-releases\/linkedin-cyber-security-image.jpg?h=470&iar=0&w=500","9":"https:\/\/www.rolls-royce.com\/~\/media\/Images\/R\/Rolls-Royce\/content-images\/marine\/discover\/landing-images\/pr-default-landing-image-v3.jpg?h=470&iar=0&w=500","10":"https:\/\/www.rolls-royce.com\/~\/media\/Images\/R\/Rolls-Royce\/banners\/press-release\/2021\/rr-to-develop-joint-future-fighter-engine-demonstrator-with-ihi.jpg?h=470&iar=0&w=500","11":"https:\/\/www.rolls-royce.com\/~\/media\/Images\/R\/Rolls-Royce\/Stories\/2021\/discover\/PR-16-11-2021-landing-img.jpg?h=470&iar=0&w=500"},"author":{"0":"Rolls-royce","1":"Rolls-royce","2":"Rolls-royce","3":"Rolls-royce","4":"Rolls-royce","5":"Rolls-royce","6":"Rolls-royce","7":"Rolls-royce","8":"Rolls-royce","9":"Rolls-royce","10":"Rolls-royce","11":"Rolls-royce"}}