{"date":{"0":"Jul 05, 2022","1":"Apr 27, 2022","2":"Apr 26, 2022","3":"Mar 22, 2022","4":"Mar 14, 2022","5":"Mar 08, 2022","6":"Feb 15, 2022","7":"Feb 10, 2022","8":"Feb 09, 2022","9":"Feb 07, 2022"},"title":{"0":"AAR’S COMPONENT REPAIR FACILITY IN AMSTERDAM RANKED NO. 1 OUTSTANDING SOURCE OF REPAIR BY NATO SUPPORT AND PROCUREMENT AGENCY FOR FIFTH TIME","1":"AAR’S LANDING GEAR PBL PROGRAM WINS 2021 SECRETARY OF DEFENSE PBL AWARD","2":"AAR ANNOUNCES MARKETING PARTNERSHIP AGREEMENT WITH PROVENAIR TECHNOLOGIES, LLC","3":"AAR REPORTS THIRD QUARTER FISCAL YEAR 2022 RESULTS","4":"AAR SIGNS EXCLUSIVE DISTRIBUTION AGREEMENT WITH COLLINS AEROSPACE’S GOODRICH DE-ICING & SPECIALTY HEATING SYSTEMS BUSINESS","5":"AAR TO ANNOUNCE THIRD QUARTER FISCAL YEAR 2022 RESULTS ON MARCH 22, 2022","6":"AAR NAMED AMONG AMERICA’S BEST MIDSIZE EMPLOYERS FOR 2022 BY FORBES","7":"AAR TO PARTICIPATE IN CITI'S 2022 GLOBAL INDUSTRIAL TECH AND MOBILITY CONFERENCE ON FEBRUARY 23, 2022","8":"RVC AVIATION MAINTENANCE STUDENTS LAUNCH THEIR CAREER WITH AAR","9":"AAR ANNOUNCES A 10-YEAR EXTENSION OF ITS COMPONENT MRO AGREEMENT WITH IAMCO FOR SUPPORT OF THE NATO E-3A AIRBORNE WARNING AND CONTROL (AWACS) FLEET"},"article":{"0":"AAR Reports Fourth Quarter and Fiscal Year 2014 Results July 15, 2014 Fourth quarter and full year diluted EPS of $0.43 and $1.83, respectively, exceeding guidance Full year sales of $2.04 billion Full year cash flow from operations of $139.8 million, free cash flow of $113.3 million 2015 guidance of consolidated sales in the range of $2.100 to $2.150 billionand earnings per share in the range of $1.80 to $1.90 reflects expectation for strong performance in supply chain and lower number of flying positions at the airlift business WOOD DALE, Ill., July 15, 2014 \/PRNewswire\/ -- AAR CORP. (NYSE: AIR), a leading, global aerospace and defense company, today reported fourth quarter and full Fiscal Year 2014 consolidated results. Fourth quarter sales were $505.4 million and diluted earnings per share were $0.43. For the fourth quarter of the prior fiscal year, the Company reported sales of $553.8 million and earnings per share of $0.01 after a $29.8 million charge related to the KC-10 program. Full year earnings per share for Fiscal Year 2014 are $1.83, as compared to $1.38 reported in Fiscal Year 2013. We are pleased with our overall performance in the fourth quarter, said David P. Storch, Chairman and Chief Executive Officer of AAR CORP. In the Aviation Services segment we are seeing positive results from our investment in new supply chain programs that are ramping up, including new customers from the supply chain hub we established in Europe. We have put renewed emphasis on identifying and capturing new business for our MRO facilities and successfully competed and captured wide-body work for Aeromexico, a new customer. Our airlift business was selected by the DoD for new work in Africa and the Vertical Replenishment (VERTREP) program with the Navy. Overall we feel very good about our cash generation for the year allowing us to strengthen our balance sheet and continue to position the Company for growth. Fourth Quarter 2014 Results Fourth quarter consolidated sales were $505.4 million versus the prior year level of $553.8 million. Sales in the Aviation Services segment declined 10% to $373.8 million mainly due to softness at the Company s MRO facilities and fewer expeditionary airlift flying positions. Sales in the Technology Products segment declined 4% to $131.6 million, primarily due to lower sales of commercial cargo systems. During the fourth quarter, and in addition to the new contract wins announced during the March earnings call, AAR s Aviation Services segment: Acquired the inventory and customer contracts from Sabena technics. With this transaction, the Company established a major supply chain hub in Brussels, Belgium to serve customers in Europe, the Middle East and Africa. Completed servicing of the 100th aircraft at our Duluth maintenance facility and renewed the long-term relationship with Air Canada by entering into a new five-year agreement to provide MRO services for Airbus narrow-body fleet of aircraft. Completed maintenance work on three B-767 commercial wide-body aircraft for Aeromexico, in addition to the two B-777 s previously announced. Subsequent to quarter-end, commenced operations of two fixed-wing aircraft for airlift support in Africa and expanded the contract positions with two additional rotary-wing aircraft. Airlift operations also expanded the VERTREP mission with two rotary-wing aircraft servicing the Navy fleet in the Mediterranean Sea, Arabian Gulf, and Indian and Western Pacific oceans. During the fourth quarter, AAR s Technology Products segment: Delivered the 400th lower-deck cargo system for Airbus A330 series. Received orders for more than 1,100 lightweight air cargo containers and pallets from China Southern Airlines. Sales to commercial customers represented 62% of consolidated sales as compared to 63% of consolidated sales in the same period last year, with government and defense customers represented the balance. In Aviation Services, sales to commercial customers represented 63% of segment sales, while in Technology Products sales to commercial customers represented 58% of segment sales. Consolidated gross profit margin for the fourth quarter on a reported basis was 17.0%, an improvement over the adjusted gross profit margin of 16.3% in prior year period. Net interest expense in the fourth quarter declined to $9.1 million. The Company reduced its net indebtedness by $89 million since June 1, 2013 Fourth quarter results included a $1.6 million tax benefit, which was offset by certain charges. During the fourth quarter, the Company generated $63.1 million in cash flow from operations and had capital expenditures of $5.3 million. The Company paid dividends totaling $3.0 million. Fiscal Year 2014 Results Full Fiscal Year 2014 consolidated sales were $2.04 billion. Aviation Services segment sales declined 3% to $1.56 billion as a result of lower airlift support and lower activity in MRO. Technology Products segment sales declined 9% to $475.0 million driven by an expected decline in demand for mobility products and lower commercial cargo sales. Sales to commercial customers were 59% of total sales as compared to 61% in fiscal 2013, with remainder of the sales to government and defense customers. For Fiscal Year 2014, the Company s weighted average diluted share count was 39.1 million, and the effective tax rate was 30.5%. The effective tax rate included the effects of certain credits, which vary depending upon the Company s level of expected taxable income. Fiscal 2015 Guidance For fiscal 2015, the Company currently expects consolidated sales in the range of $2.100 to $2.150 billion. The Company expects to see growth in its supply chain business and improvement in its maintenance, repair and overhaul businesses given its strong position in the growing global aviation services market. With defense budgets expected to remain under pressure, the Company sees ongoing demand for its low cost solutions, products and services and will continue to transition its portfolio of airlift aircraft. Due to the transition of the airlift portfolio and timing of up-take of supply chain contracts, the Company expects first quarter earnings per share to be softer than other quarters in the year, but that earnings per share will grow sequentially throughout 2015. For the full Fiscal Year 2015, the Company expects earnings per share to be in the range of $1.80 to $1.90. Conference Call Information AAR will hold its quarterly conference call at 7:30 a.m. CDT on July 16, 2014. The conference call can be accessed by calling 866-802-4322 from inside the U.S. or 703-639-1319 from outside the U.S. A replay of the conference call will be available by calling 888-266-2081 from inside the U.S. or 703-925-2533 from outside the U.S. (access code 1623126). The replay will be available from 10:30 a.m. CDT on July 16, 2014, until 11:59 p.m. CDT on July 23, 2014. Contact: John Fortson, Vice President, Chief Financial Officer | (630) 227-2075 john.fortson@aarcorp.com AAR CORP. and Subsidiaries Consolidated Statements of Income (In millions, except per share data) Three Months Ended May 31, Twelve Months Ended May 31, 2014 2013 2014 2013 Sales $ 505.4 $ 553.8 $ 2,035.0 $ 2,137.3 Costs and expenses: Cost of sales 419.6 493.5 1,694.8 1,823.1 Selling, general and administrative 53.3 52.5 197.6 198.4 Earnings from aircraft joint ventures 0.6 1.0 3.1 6.8 Operating income 33.1 8.8 145.7 122.6 Loss on extinguishment of debt --- --- --- (0.3) Interest expense 9.7 10.0 42.0 41.6 Interest income 0.6 0.4 1.6 1.5 Income before income tax expense 24.0 (0.8) 105.3 82.2 Income tax expense (benefit) 6.7 (1.6) 32.1 26.7 Net income attributable to AAR and noncontrolling interest 17.3 0.8 73.2 55.5 Income attributable to noncontrolling interest (0.1) (0.2) (0.3) (0.5) Net income attributable to AAR $ 17.2 $ 0.6 $ 72.9 $ 55.0 Earnings per share Basic $ 0.44 $ 0.01 $ 1.85 $ 1.38 Earnings per share Diluted $ 0.43 $ 0.01 $ 1.83 $ 1.38 Share Data: Average shares outstanding Basic 38.6 38.0 38.6 38.3 Average shares outstanding Diluted 39.1 38.3 39.1 40.6 AAR CORP. and Subsidiaries Consolidated Balance Sheet Highlights (In millions, except per share data) May 31, 2014 May 31, 2013 Cash $ 89.2 $ 75.3 Current assets 1,094.5 1,033.7 Current liabilities (excluding debt accounts) 326.2 302.6 Net property, plant and equipment 314.9 361.7 Total assets 2,177.1 2,136.9 Total debt 634.0 708.6 Stockholders' equity 1,000.7 919.5 Book value per share $ 25.27 $ 23.34 Shares outstanding 39.6 39.4 Sales By Business Segment (In millions) Three Months Ended May 31, Twelve Months Ended May 31, 2014 2013 2014 2013 Aviation Services $ 373.8 $ 417.2 $ 1,560.0 $ 1,614.4 Technology Products 131.6 136.6 475.0 522.9 $ 505.4 $ 553.8 $ 2,035.0 $ 2,137.3 Gross Profit by Business Segment (In millions) Three Months Ended May 31, Twelve Months Ended May 31, 2014 2013 2014 2013 Aviation Services $ 62.7 $ 39.7 $258.9 $227.5 Technology Products 23.1 20.6 81.3 86.7 $ 85.8 $ 60.3 $ 340.2 $ 314.2 Diluted Earnings Per Share Calculation (In millions, except per share data) Three Months Ended May 31, Twelve Months Ended May 31, 2014 2013 2014 2013 Net income attributable to AAR $ 17.2 $ 0.6 $ 72.9 $ 55.0 Add: After-tax interest on convertible debt --- --- --- 3.2 Less: Income attributable to participating shares (0.4) --- (1.5) (1.9) Net income for diluted EPS calculation $ 16.8 $ 0.6 $ 71.4 $ 56.3 Average shares outstanding Diluted 39.1 38.3 39.1 40.6 Earnings per share Diluted $ 0.43 $ 0.01 $ 1.83 $ 1.38 Note: Pursuant to SEC Regulation G, the Company has included the following reconciliation of financial measures reported on a non-GAAP basis to the comparable financial measures reported on the basis of Generally Accepted Accounting Principles (\"GAAP\"). The Company uses free cash flow and earnings per share before special items to evaluate its financial results and trends, and believes these measures provide investors additional insights into the Company's performance. Free Cash Flow (In millions - unaudited) Three Months Ended May 31, Twelve Months Ended May 31, 2014 2014 Net cash provided from operating activities $63.1 $139.8 Less: Property, plant and equipment expenditures (5.3) (26.5) Free Cash Flow $57.8 $113.3 Net Debt (In millions - unaudited) May 31, May 31, 2014 2013 Total debt $634.0 $708.6 Less: Cash and cash equivalents 89.2 75.3 Net debt $544.8 $633.3 AAR CORP. (Consolidated results) Three Months Ended May 31, 2013 Earnings per share Diluted $0.01 Add: Diluted Earnings per share impact of $29.8 million KC-10 support contract charge in 2013 $0.49 Diluted Earnings per share before special items $0.50 AAR CORP. (Consolidated results) Twelve Months Ended May 31, 2013 Earnings per share Diluted $1.38 Add: Diluted Earnings per share impact of $29.8 million KC-10 support contract charge in 2013 $0.47 Diluted Earnings per share before special items $1.85 Back About AAR AAR is a global aftermarket solutions company that employs more than 6,000 people in over 20 countries. Based in Wood Dale, Illinois, AAR supports commercial aviation and government customers through two operating segments: Aviation Services and Expeditionary Services. AAR s Aviation Services include inventory management; parts supply; OEM parts distribution; aircraft maintenance, repair and overhaul; engineering services and component repair. AAR s Expeditionary Services include airlift operations; mobility systems; and command and control centers in support of military and humanitarian missions. More information can be found at www.aarcorp.com. Media contact: Daniela Pietsch, Vice President Corporate Marketing & Communications, at editor@aarcorp.com or +1 630-227-5100. This press release contains certain statements relating to future results, which are forward-looking statements as that term is defined in the Private Securities Litigation Reform Act of 1995. These forward-looking statements are based on beliefs of Company management, as well as assumptions and estimates based on information currently available to the Company, and are subject to certain risks and uncertainties that could cause actual results to differ materially from historical results or those anticipated, including those factors discussed under Item 1A, entitled Risk Factors , included in the Company s Form 10-K for the fiscal year ended May 31, 2018. Should one or more of these risks or uncertainties materialize adversely, or should underlying assumptions or estimates prove incorrect, actual results may vary materially from those described. These events and uncertainties are difficult or impossible to predict accurately and many are beyond the Company s control. The Company assumes no obligation to update any forward-looking statements to reflect events or circumstances after the date of such statements or to reflect the occurrence of anticipated or unanticipated events. For additional information, see the comments included in AAR s filings with the Securities and Exchange Commission.","1":"AAR s Nordisk Aviation Products Selected by China Postal Airlines July 14, 2014 Leading international provider of advanced ULDs help China Postal Airlines maximize air freight capacity on B737 freighter fleet HONG KONG, July 14, 2014 AAR s Nordisk Aviation Products announces it has received orders for 180 main deck air cargo containers from China Postal Airlines. The orders are in addition to the 988 Nordisk containers China Postal already has in service. The main deck Unit Load Devices were specially designed to maximize air freight capacity by an additional 3 percent in the B737 freighter, while reducing fuel costs and the airline s carbon footprint. We are proud to say that Nordisk containers positively impact the bottom line. But they are also becoming the preferred ULDs for airlines that care about the environment, said Boon Yang Sim, Nordisk's Vice President of Sales and Business Development, Asia Pacific and People s Republic of China. We are pleased to be able to deliver on our promise to China Postal Airlines and welcome this expansion of our partnership. Nordisk also supplies ULDs to China Southern Airlines, receiving orders for more than 1,100 lightweight air cargo containers and pallets in May. Nordisk is the leading supplier of air cargo containers and pallets in the industry. With close to 700,000 ULDs sold in the global aviation markets, Nordisk ULDs are used by virtually every airline operating wide-bodied aircraft, enabling vast amounts of cargo and baggage to be transported safely and securely. AAR (NYSE: AIR), with its Telair and Nordisk subsidiaries, offers a full line of main-deck and lower-deck cargo systems and a variety of baggage handling and freight solutions that enable increased payload and fuel savings. From the Nordisk Ultralite , the lightest-weight container in the industry, to the patented Sliding Carpet baggage loading system to specialized pallets, containers and air mobile shelters, AAR offers products with excellent strength-to-weight performance, high reliability and low total cost of ownership, backed by a global aftermarket support network. About Nordisk Aviation Products A subsidiary of aviation industry leader AAR CORP., Nordisk Aviation Products designs, manufactures and sells air cargo containers and pallets, to the global commercial aviation industry. Nordisk, established in 1970, has production facilities in Norway, China and the United States and has spare parts warehousing and sales offices across Europe, Asia, and the United States. For more information, visit www.nordisk-aviation.com, or call +852-2107 6668. Back About AAR AAR is a global aftermarket solutions company that employs more than 6,000 people in over 20 countries. Based in Wood Dale, Illinois, AAR supports commercial aviation and government customers through two operating segments: Aviation Services and Expeditionary Services. AAR s Aviation Services include inventory management; parts supply; OEM parts distribution; aircraft maintenance, repair and overhaul; engineering services and component repair. AAR s Expeditionary Services include airlift operations; mobility systems; and command and control centers in support of military and humanitarian missions. More information can be found at www.aarcorp.com. Media contact: Daniela Pietsch, Vice President Corporate Marketing & Communications, at editor@aarcorp.com or +1 630-227-5100. This press release contains certain statements relating to future results, which are forward-looking statements as that term is defined in the Private Securities Litigation Reform Act of 1995. These forward-looking statements are based on beliefs of Company management, as well as assumptions and estimates based on information currently available to the Company, and are subject to certain risks and uncertainties that could cause actual results to differ materially from historical results or those anticipated, including those factors discussed under Item 1A, entitled Risk Factors , included in the Company s Form 10-K for the fiscal year ended May 31, 2018. Should one or more of these risks or uncertainties materialize adversely, or should underlying assumptions or estimates prove incorrect, actual results may vary materially from those described. These events and uncertainties are difficult or impossible to predict accurately and many are beyond the Company s control. The Company assumes no obligation to update any forward-looking statements to reflect events or circumstances after the date of such statements or to reflect the occurrence of anticipated or unanticipated events. For additional information, see the comments included in AAR s filings with the Securities and Exchange Commission.","2":"AAR Earns Nadcap Accreditation for Composites Manufacturing July 9, 2014 With it, Clearwater, FL, facility can support all commercial and military products for Tier 1 customers CLEARWATER, Florida, July 9, 2014 AAR (NYSE: AIR) announces that its composites manufacturing facility here has earned Nadcap accreditation to fabricate and build composite parts and assemblies for commercial and military markets. The designation represents a milestone for AAR and distinguishes the company as an expert in the field of composites manufacturing capable of meeting the highest industry standards. Nadcap accreditation is a prerequisite for inclusion on the qualified product list for major aircraft OEMs including Boeing s A10 and 777, Bombardier s C-series, Sikorsky s S-92, Gulfstream, UTC-UTAS A320 and Triumph programs. The qualification follows an audit performed by the Performance Review Institute over the past five months. Satisfying these customer requirements demonstrates AAR s commitment to quality and opens the door to new business opportunities and expansion of key accounts. Acquiring this coveted accreditation in only five months after stating intent to pursue it is a phenomenal feat, said Daniel J. FitzPatrick, Vice President of Operations Composites for AAR. I commend the Clearwater employees for achieving this milestone on the very first attempt. Clearwater is the second AAR composites facility to earn Nadcap accreditation. Its Sacramento, CA, composites operation was accredited in September 2010 and re-certified in April 2014 with zero non-compliance findings, FitzPatrick said. That s almost unheard of in the industry, he added. Nadcap requires annual audits until the first two re-certifications achieve acceptable results. After that, audits are performed every 18 months. Unlike traditional third-party programs, Nadcap approval is granted based upon industry standards and reviewed by key business leaders who serve on the committee. Achieving Nadcap accreditation is not easy. It is one of the ways in which the aerospace industry identifies those who excel at manufacturing quality products through superior special processes, said Joe Pinto, Vice President and Chief Operating Officer at the Performance Review Institute. PRI is proud to support continual improvement in the aerospace industry by helping companies such as AAR in Clearwater to be successful. AAR is a leading one-stop-shop provider of primary and secondary structures, components and assemblies to OEMs and Tier 1 customers. About Nadcap Created in 1990 by SAE Inc., Nadcap is administered by the not-for-profit Performance Review Institute. PRI exists to advance the interests of the mobility and related industries through development of performance standards and administration of quality assurance, accreditation and certification programs, as well as related activities for the benefit of industry, government and the general public. PRI works closely with industry to understand their emerging needs and offers customized solutions in response. Learn more at www.pri-network.orgor contact PRI at PRINadcap@sae.org. Back About AAR AAR is a global aftermarket solutions company that employs more than 6,000 people in over 20 countries. Based in Wood Dale, Illinois, AAR supports commercial aviation and government customers through two operating segments: Aviation Services and Expeditionary Services. AAR s Aviation Services include inventory management; parts supply; OEM parts distribution; aircraft maintenance, repair and overhaul; engineering services and component repair. AAR s Expeditionary Services include airlift operations; mobility systems; and command and control centers in support of military and humanitarian missions. More information can be found at www.aarcorp.com. Media contact: Daniela Pietsch, Vice President Corporate Marketing & Communications, at editor@aarcorp.com or +1 630-227-5100. This press release contains certain statements relating to future results, which are forward-looking statements as that term is defined in the Private Securities Litigation Reform Act of 1995. These forward-looking statements are based on beliefs of Company management, as well as assumptions and estimates based on information currently available to the Company, and are subject to certain risks and uncertainties that could cause actual results to differ materially from historical results or those anticipated, including those factors discussed under Item 1A, entitled Risk Factors , included in the Company s Form 10-K for the fiscal year ended May 31, 2018. Should one or more of these risks or uncertainties materialize adversely, or should underlying assumptions or estimates prove incorrect, actual results may vary materially from those described. These events and uncertainties are difficult or impossible to predict accurately and many are beyond the Company s control. The Company assumes no obligation to update any forward-looking statements to reflect events or circumstances after the date of such statements or to reflect the occurrence of anticipated or unanticipated events. For additional information, see the comments included in AAR s filings with the Securities and Exchange Commission.","3":"AAR to Announce Fourth Quarter and Fiscal Year 2014 Results on July 15, 2014 July 9, 2014 WOOD DALE, ILLINOIS (July 8, 2014) AAR (NYSE: AIR) today announced that it will release financial results for its fourth quarter and Fiscal Year 2014, ended May 31, 2014, after the market closes on Tuesday, July 15, 2014. On Wednesday, July 16, 2014, at 7:30 a.m. CST, AAR will hold a conference call to discuss the results. The conference call can be accessed by calling 866-802-4322 from inside the U.S. or 703-639-1319 from outside the U.S. A replay of the conference call will also be available by calling 888-266-2081 from inside the U.S. or 703-925-2533 from outside the U.S. (access code 1623126). The replay will be available from 10:30 a.m. CST on July 16, 2014, until 11:59 p.m. CST on July 23, 2014. Back About AAR AAR is a global aftermarket solutions company that employs more than 6,000 people in over 20 countries. Based in Wood Dale, Illinois, AAR supports commercial aviation and government customers through two operating segments: Aviation Services and Expeditionary Services. AAR s Aviation Services include inventory management; parts supply; OEM parts distribution; aircraft maintenance, repair and overhaul; engineering services and component repair. AAR s Expeditionary Services include airlift operations; mobility systems; and command and control centers in support of military and humanitarian missions. More information can be found at www.aarcorp.com. Media contact: Daniela Pietsch, Vice President Corporate Marketing & Communications, at editor@aarcorp.com or +1 630-227-5100. This press release contains certain statements relating to future results, which are forward-looking statements as that term is defined in the Private Securities Litigation Reform Act of 1995. These forward-looking statements are based on beliefs of Company management, as well as assumptions and estimates based on information currently available to the Company, and are subject to certain risks and uncertainties that could cause actual results to differ materially from historical results or those anticipated, including those factors discussed under Item 1A, entitled Risk Factors , included in the Company s Form 10-K for the fiscal year ended May 31, 2018. Should one or more of these risks or uncertainties materialize adversely, or should underlying assumptions or estimates prove incorrect, actual results may vary materially from those described. These events and uncertainties are difficult or impossible to predict accurately and many are beyond the Company s control. The Company assumes no obligation to update any forward-looking statements to reflect events or circumstances after the date of such statements or to reflect the occurrence of anticipated or unanticipated events. For additional information, see the comments included in AAR s filings with the Securities and Exchange Commission.","4":"AAR Operations Commence in Central Africa July 1, 2014 Airlift Group provides fixed-wing transport of passengers, cargo and logistics for allied forces MELBOURNE, Florida, July 1, 2014 AAR (NYSE: AIR) announces its Airlift division has commenced operations in Central Africa to provide dedicated fixed-wing lift services to U.S. Africa Command (USAFRICOM) under a contract with U.S. Transportation Command (USTRANSCOM). AAR Airlift is providing passenger and cargo transportation services, aerial delivery and logistics support for allied forces. The contract is valued at approximately $23 million, inclusive of all optional task orders. Due to the lack of infrastructure in much of Central Africa, U.S. forces rely on commercial providers like AAR Airlift to sustain in-theatre operations, said Jeff Wehrenberg, Chief Operating Office for AAR Airlift Group. AAR has an excellent record of performance in rugged environments and remote locations, and we see this region as a great expansion opportunity for the company. Through a competitive solicitation, USTRANSCOM initially awarded the contract to AAR Airlift Group in November 2013. Performance was delayed by multiple incumbent protests, ultimately resulting in USTRANSCOM re-evaluating proposals and selecting AAR Airlift again in May. AAR Airlift provides expeditionary airlift services in support of contingency operations worldwide. The company operates a fleet of fixed-wing and rotary-wing aircraft to transport personnel, supplies, and mail for the U.S. Department of Defense in Afghanistan and Africa, and provide vertical replenishment (VERTREP) services to the Military Sealift Command in the Western Pacific. Back About AAR AAR is a global aftermarket solutions company that employs more than 6,000 people in over 20 countries. Based in Wood Dale, Illinois, AAR supports commercial aviation and government customers through two operating segments: Aviation Services and Expeditionary Services. AAR s Aviation Services include inventory management; parts supply; OEM parts distribution; aircraft maintenance, repair and overhaul; engineering services and component repair. AAR s Expeditionary Services include airlift operations; mobility systems; and command and control centers in support of military and humanitarian missions. More information can be found at www.aarcorp.com. Media contact: Daniela Pietsch, Vice President Corporate Marketing & Communications, at editor@aarcorp.com or +1 630-227-5100. This press release contains certain statements relating to future results, which are forward-looking statements as that term is defined in the Private Securities Litigation Reform Act of 1995. These forward-looking statements are based on beliefs of Company management, as well as assumptions and estimates based on information currently available to the Company, and are subject to certain risks and uncertainties that could cause actual results to differ materially from historical results or those anticipated, including those factors discussed under Item 1A, entitled Risk Factors , included in the Company s Form 10-K for the fiscal year ended May 31, 2018. Should one or more of these risks or uncertainties materialize adversely, or should underlying assumptions or estimates prove incorrect, actual results may vary materially from those described. These events and uncertainties are difficult or impossible to predict accurately and many are beyond the Company s control. The Company assumes no obligation to update any forward-looking statements to reflect events or circumstances after the date of such statements or to reflect the occurrence of anticipated or unanticipated events. For additional information, see the comments included in AAR s filings with the Securities and Exchange Commission.","5":"Cargolux Launches New Line of ULDs from Telair June 30, 2014 CAEROe transport system raises the bar for durability, fuel savings and capacity MIESBACH, Germany, June 30, 2014 Cargolux International, S.A., the leading global all-cargo carrier, has agreed to become the first airline to carry AAR Telair s full line of CAEROe advanced lightweight unit load devices (ULDs). Cargolux launched the CAEROe product portfolio of cookie-sheet pallets, heavy gross weight pallets and fuel-saving containers on its Boeing 747s. The CAEROe (pronounced zero) pallets are up to 40 percent lighter than standard all-aluminum ULDs, but can carry more weight without additional strapping to the aircraft structure. The pallets are certified for strapping the maximum allowable load against the pallet edge rails by using tie-downs. This way, fewer ULD positions get blocked during heavy weight transport, providing extra space and, potentially, more revenue for the customer. The increased capacity in addition to the fuel and time savings we gain from using the CAEROe product line will provide the airline with a unique opportunity to increase mainstream revenue while at the same time save money and reduce carbon emissions, said Onno Pietersma, Sr. Vice President, Maintenance and Engineering, for Cargolux. We re excited to launch this new product line for Telair and believe CAEROe will set a new industry standard. By working closely with the industry on cargo loading systems, Telair s designers observed mismatches between ULDs and aircraft capabilities. The CAEROe product line addresses common challenges. The containers can be flat-packed for delivery and on-site assembly, and have doors that swing open the full width of the ULD for easier loading. The ULD base plate, which is extra thick and stiff, has been tested by Telair to last up to three times longer than the industry standard base plates. A similar base plate is used for the CAEROe containers in the lower deck cargo compartments. It is also coupled with Telair s state-of-the-art automated RFID ULD Tracking Technology for a Complete Cargo Competence solution. Add durability to the fuel savings and increased capacity they are getting, and CAEROe customers will enjoy a competitive advantage, said Thomas Huber, Containerized Cargo System and CAEROe Product Line Manager for Telair International. We appreciate the faith Cargolux has put in Telair s products and services and are pleased to have this product launched by the world s No. 1 ranked freight carrier. Telair International has served the airline industry for more than 40 years, with facilities on three continents. AAR, through its Telair and Nordisk subsidiaries, is the premier designer and manufacturer of advanced cargo loading systems, ULDs and aftermarket services for the world s airlines and OEMS. The CAEROe is the latest in a full line of AAR main-deck and lower-deck cargo systems and a variety of baggage-handling and freight solutions that enable increased payload and fuel savings. More information on Telair can be found at www.telair.com About Cargolux Airlines International, S.A. Cargolux, based in Luxembourg, is Europe s leading all-cargo airline with a modern and efficient fleet composed of nine Boeing 747-8 freighters and 11 Boeing 747-400 freighters. The Cargolux worldwide network covers over 90 destinations, 60 of which are served on scheduled all-cargo flights. The company has more than 85 offices in over 50 countries and offers an extensive global trucking network to more than 250 destinations, as well as charter and aircraft maintenance services. Cargolux employs more than 1,600 worldwide. Contact: Martine Scheuren, Director Corporate Communications at martine.scheuren@cargolux.com| +352 4211 3204. Back About AAR AAR is a global aftermarket solutions company that employs more than 6,000 people in over 20 countries. Based in Wood Dale, Illinois, AAR supports commercial aviation and government customers through two operating segments: Aviation Services and Expeditionary Services. AAR s Aviation Services include inventory management; parts supply; OEM parts distribution; aircraft maintenance, repair and overhaul; engineering services and component repair. AAR s Expeditionary Services include airlift operations; mobility systems; and command and control centers in support of military and humanitarian missions. More information can be found at www.aarcorp.com. Media contact: Daniela Pietsch, Vice President Corporate Marketing & Communications, at editor@aarcorp.com or +1 630-227-5100. This press release contains certain statements relating to future results, which are forward-looking statements as that term is defined in the Private Securities Litigation Reform Act of 1995. These forward-looking statements are based on beliefs of Company management, as well as assumptions and estimates based on information currently available to the Company, and are subject to certain risks and uncertainties that could cause actual results to differ materially from historical results or those anticipated, including those factors discussed under Item 1A, entitled Risk Factors , included in the Company s Form 10-K for the fiscal year ended May 31, 2018. Should one or more of these risks or uncertainties materialize adversely, or should underlying assumptions or estimates prove incorrect, actual results may vary materially from those described. These events and uncertainties are difficult or impossible to predict accurately and many are beyond the Company s control. The Company assumes no obligation to update any forward-looking statements to reflect events or circumstances after the date of such statements or to reflect the occurrence of anticipated or unanticipated events. For additional information, see the comments included in AAR s filings with the Securities and Exchange Commission.","6":"AEROSPACE COMPANY & ITS CEO PLEDGE THREE-YEAR COMMITMENT TO SUPPORT SCIENCE, TECHNOLOGY, ENGINEERING AND MATHEMATICS AT OVERTOWN YOUTH CENTER (OYC) June 25, 2014 AAR CORP. s CEO David P. Storch and Overtown Youth Center Founder Alonzo Mourning announced partnership at event featuring student rocket launch MIAMI, Fla. June 25, 2014 The Overtown Youth Center hosted a special ceremony today to recognize AAR CORP. and its Chairman and CEO David P. Storch s $350,000 donation to support the Center s science, technology, engineering and mathematics (STEM) program. County Commissioner Audrey Edmonson and City Commissioner Keon Hardemon, AAR s Storch, and Mourning Family Foundation and Overtown Youth Center founder Alonzo Mourning attended the event to show their support for programs that help raise interest and train inner-city youth for the well-paying careers of today and tomorrow. The Overtown Youth Center s (OYC) STEM Summer Program, in partnership with aviation company AAR and Miami Dade County Public School Office of Academic & STEM Transformation, will provide students an opportunity to engage in academically exciting, hands-on projects. This summer OYC will administer an intensive, six-week program that will expose students to the STEM curriculum, while incorporating literacy ensuring academic reinforcement. Through this unique partnership, 11- to-18-year-old students in the Overtown community will be provided with instructional guidance by leading Miami Dade County Public School STEM staff members. The program kicked off today with AAR employees helping students to launch rockets. Our mission is to inspire and empower youth and families by fostering hope through enrichment services. None of that happens without the support of people like AAR CEO David Storch, said Alonzo Mourning. The three-year commitment and support of STEM programs provided by David and his aerospace company will motivate and inspire children. Today we will teach and feed kids here at the OYC, our goal is to ensure they re contributing members of society 10 years from now, Mourning added. AAR is a leading provider of products and services to the global aerospace and government\/defense industries. The company is connected to Miami by its two facilities in the county Landing Gear Services and Aircraft Services that employ more than 1,000 residents and directly generate more than $114 million annually in economic impact for the area. The company s focus on STEM education for youth and community improvement has included giving Miami Central High School juniors and seniors their first glimpse of aviation education and careers during Taking Flight, a day-long STEM excursion to AAR s 226,000-square-foot aircraft maintenance, repair and overhaul (MRO) facility at Miami International Airport. The donation also funded a recent College Tour for Overtown students and classes for elementary school students taught by the Nutty Scientist. AAR believes in investing in the communities we work in, and I am really impressed by what is being accomplished by Alonzo and Tina at Overtown, said Storch. This type of investment is mutually beneficial as it helps AAR to create a pipeline of aviation talent to make sure we have the workforce we need in the future. Back About AAR AAR is a global aftermarket solutions company that employs more than 6,000 people in over 20 countries. Based in Wood Dale, Illinois, AAR supports commercial aviation and government customers through two operating segments: Aviation Services and Expeditionary Services. AAR s Aviation Services include inventory management; parts supply; OEM parts distribution; aircraft maintenance, repair and overhaul; engineering services and component repair. AAR s Expeditionary Services include airlift operations; mobility systems; and command and control centers in support of military and humanitarian missions. More information can be found at www.aarcorp.com. Media contact: Daniela Pietsch, Vice President Corporate Marketing & Communications, at editor@aarcorp.com or +1 630-227-5100. This press release contains certain statements relating to future results, which are forward-looking statements as that term is defined in the Private Securities Litigation Reform Act of 1995. These forward-looking statements are based on beliefs of Company management, as well as assumptions and estimates based on information currently available to the Company, and are subject to certain risks and uncertainties that could cause actual results to differ materially from historical results or those anticipated, including those factors discussed under Item 1A, entitled Risk Factors , included in the Company s Form 10-K for the fiscal year ended May 31, 2018. Should one or more of these risks or uncertainties materialize adversely, or should underlying assumptions or estimates prove incorrect, actual results may vary materially from those described. These events and uncertainties are difficult or impossible to predict accurately and many are beyond the Company s control. The Company assumes no obligation to update any forward-looking statements to reflect events or circumstances after the date of such statements or to reflect the occurrence of anticipated or unanticipated events. For additional information, see the comments included in AAR s filings with the Securities and Exchange Commission.","7":"AAR Lands Supply Chain Deal with Kenya Airways with Assist from the U.S. Commerce Department June 23, 2014 Obama administration s Doing Business in Africa initiative scores first aviation industry win; helps Chicago-based company land multi-million dollar deal to support 737NG aircraft WOOD DALE, Illinois, June 23, 2014 AAR (NYSE: AIR), a global aerospace, government and defense contractor, has become the first aviation company to land a multi-year deal under the Obama administration s Doing Business in Africa initiative. AAR is announcing a five-year multi-million dollar agreement with Kenya Airways to provide power-by-the-hour component support for its fleet of 737NG aircraft. AAR will place inventory on site in Nairobi while offering additional rotable pool support from its newly established supply chain hub in Brussels. With assistance from U.S. Department of Commerce leadership and staff in Washington, D.C., Chicago, and the U.S. Embassy in Kenya,AAR s top executives were able to connect with key government and business officials beginning last year during a visit to Nairobi, Kenya; meet legal requirements; establish business protocols; and cultivate relationships. The successful advocacy strategy was also supported by several inter-agency partners including the State Department. The advocacy and access AAR gained through the Commerce Department s program gave us an advantage in the face of stiff competition from European companies, said AAR CORP. Chairman and CEO David P. Storch. The administration s support was key to enabling us to navigate the business landscape. This deal with Kenya Airways has helped to progress AAR s expansion across the African continent. Doing Business in Africa (DBIA), first announced in December 2012, was designed to close the opportunity gap between American business and emerging markets in Africa, home to seven of the fastest-growing economies in the world. Obama administration efforts include enhanced outreach from Commerce and interagency partners to provide American companies with leads and introductions; and advocate for and connect businesses with distributors and potential customers. The success of AAR in Kenya is an excellent example of how the National Export Initiative is working to help U.S. businesses leverage new export opportunities in emerging markets and around the world, said U.S. Secretary of Commerce Penny Pritzker. I know from my recent trade mission that many U.S. companies are selling to Africa, but it can be a challenging market for many American businesses. That is why the Commerce Department is assisting American businesses as they navigate new markets, reach new customers, and develop new opportunities in existing markets. When U.S. companies succeed, the benefits are mutually shared in the form of new economic opportunity at home and abroad. This deal builds on AAR s recent progress in establishing a foothold in Africa. Last year, AAR fulfilled a contract to service landing gear on Kenya Airways Boeing 777s. AAR also supplies cargo systems for South African Airways and participated in the MRO Africa Conference and Exhibition in Ethiopia, focused on the build-out of Africa s aviation industry. Through efforts like these, Americans and Africans can begin to understand the mutually beneficial relationships both our economies need to sustain and grow, said Kenya Airways CEO Titus Naikuni. We appreciate the Obama administration s help in connecting us with AAR s services that will reduce our costs so we can continue to grow. Back About AAR AAR is a global aftermarket solutions company that employs more than 6,000 people in over 20 countries. Based in Wood Dale, Illinois, AAR supports commercial aviation and government customers through two operating segments: Aviation Services and Expeditionary Services. AAR s Aviation Services include inventory management; parts supply; OEM parts distribution; aircraft maintenance, repair and overhaul; engineering services and component repair. AAR s Expeditionary Services include airlift operations; mobility systems; and command and control centers in support of military and humanitarian missions. More information can be found at www.aarcorp.com. Media contact: Daniela Pietsch, Vice President Corporate Marketing & Communications, at editor@aarcorp.com or +1 630-227-5100. This press release contains certain statements relating to future results, which are forward-looking statements as that term is defined in the Private Securities Litigation Reform Act of 1995. These forward-looking statements are based on beliefs of Company management, as well as assumptions and estimates based on information currently available to the Company, and are subject to certain risks and uncertainties that could cause actual results to differ materially from historical results or those anticipated, including those factors discussed under Item 1A, entitled Risk Factors , included in the Company s Form 10-K for the fiscal year ended May 31, 2018. Should one or more of these risks or uncertainties materialize adversely, or should underlying assumptions or estimates prove incorrect, actual results may vary materially from those described. These events and uncertainties are difficult or impossible to predict accurately and many are beyond the Company s control. The Company assumes no obligation to update any forward-looking statements to reflect events or circumstances after the date of such statements or to reflect the occurrence of anticipated or unanticipated events. For additional information, see the comments included in AAR s filings with the Securities and Exchange Commission.","8":"AAR Awarded New Contract to Support U.S. Navy Vertical Replenishment June 9, 2014 Airlift Group to provide a third helicopter detachment to Military Sealift Command WOOD DALE, Illinois, June 9, 2014 AAR (NYSE: AIR) announces the Military Sealift Command awarded its Airlift division a contract to provide vertical replenishment (VERTREP) services to its 5th and 7th Fleets in the Mediterranean Sea, Arabian Gulf, and Indian and Western Pacific oceans. The contract is valued at approximately $34 million, inclusive of all options. Military Sealift Command (MSC) is the leading provider of ocean transportation for the Navy and the U.S. Department of Defense, operating approximately 110 ships daily around the globe. AAR has been performing commercial VERTREP services including ship-to-shore replenishment, ship-to-ship underway replenishment, search and rescue, and support for humanitarian aid operations for MSC since 2007. AAR Airlift will provide two helicopters, personnel, and operational and technical support to the detachment. The new contract will be the third helicopter detachment operated by the Company for MSC. AAR Airlift Group has provided exceptional service to the U.S. Navy at an excellent value for seven consecutive years, said Randy J. Martinez, President and CEO, Airlift Group. We re honored to be awarded another contract to provide this critical service for our military personnel. AAR provides expeditionary airlift services in support of contingency operations worldwide. The Company owns and operates a fleet of fixed-wing and rotary-wing aircraft to transport personnel, supplies and mail for the U.S. Department of Defense in Afghanistan, Africa and the Western Pacific. Back About AAR AAR is a global aftermarket solutions company that employs more than 6,000 people in over 20 countries. Based in Wood Dale, Illinois, AAR supports commercial aviation and government customers through two operating segments: Aviation Services and Expeditionary Services. AAR s Aviation Services include inventory management; parts supply; OEM parts distribution; aircraft maintenance, repair and overhaul; engineering services and component repair. AAR s Expeditionary Services include airlift operations; mobility systems; and command and control centers in support of military and humanitarian missions. More information can be found at www.aarcorp.com. Media contact: Daniela Pietsch, Vice President Corporate Marketing & Communications, at editor@aarcorp.com or +1 630-227-5100. This press release contains certain statements relating to future results, which are forward-looking statements as that term is defined in the Private Securities Litigation Reform Act of 1995. These forward-looking statements are based on beliefs of Company management, as well as assumptions and estimates based on information currently available to the Company, and are subject to certain risks and uncertainties that could cause actual results to differ materially from historical results or those anticipated, including those factors discussed under Item 1A, entitled Risk Factors , included in the Company s Form 10-K for the fiscal year ended May 31, 2018. Should one or more of these risks or uncertainties materialize adversely, or should underlying assumptions or estimates prove incorrect, actual results may vary materially from those described. These events and uncertainties are difficult or impossible to predict accurately and many are beyond the Company s control. The Company assumes no obligation to update any forward-looking statements to reflect events or circumstances after the date of such statements or to reflect the occurrence of anticipated or unanticipated events. For additional information, see the comments included in AAR s filings with the Securities and Exchange Commission.","9":"AAR Becomes the First MRO Operator to Sign Data-Sharing Pact with FAA June 6, 2014 Leader in aircraft maintenance takes steps to ensure aviation safety, identify risks WOOD DALE, Illinois, June 6, 2014 -- AAR (NYSE: AIR), a recognized leader in aircraft maintenance, repair and overhaul (MRO), has become the first MRO operator to agree to voluntarily share safety information with the Federal Aviation Administration. AAR recently signed an agreement to take part in the FAA s Aviation Safety Information Analysis and Sharing program (ASIAS), which is designed to help MRO operators avoid serious and potentially costly safety issues and the FAA to identify high-risk areas. The FAA is very pleased to have AAR launch the ASIAS program among MROs, said Steven Douglas, Manager, Aircraft Maintenance Division, for the FAA. We believe that sharing and analyzing safety data are important for the aviation industry as a whole. Safety and performance are the cornerstones of AAR s 1MRO Network, comprised of six aircraft maintenance facilities in Indianapolis; Oklahoma City; Miami; and Duluth, Minn. We understand that voluntary reporting is critical to overall safety in the aviation industry and are excited to partner with the FAA s efforts, said Art Smith, AAR Vice President and Chief Quality Officer. Although we are now officially signed on to the ASIAS program, our customers and other partners know AAR has long had a culture and practice of sharing safety information. AAR has received frequent industry recognition, including earning the Diamond Award of Excellence, the FAA s highest honor for maintenance training, for the fifth-consecutive year. AAR also was recently voted Best Airframe Provider in the Americas by industry professionals. Back About AAR AAR is a global aftermarket solutions company that employs more than 6,000 people in over 20 countries. Based in Wood Dale, Illinois, AAR supports commercial aviation and government customers through two operating segments: Aviation Services and Expeditionary Services. AAR s Aviation Services include inventory management; parts supply; OEM parts distribution; aircraft maintenance, repair and overhaul; engineering services and component repair. AAR s Expeditionary Services include airlift operations; mobility systems; and command and control centers in support of military and humanitarian missions. More information can be found at www.aarcorp.com. Media contact: Daniela Pietsch, Vice President Corporate Marketing & Communications, at editor@aarcorp.com or +1 630-227-5100. This press release contains certain statements relating to future results, which are forward-looking statements as that term is defined in the Private Securities Litigation Reform Act of 1995. These forward-looking statements are based on beliefs of Company management, as well as assumptions and estimates based on information currently available to the Company, and are subject to certain risks and uncertainties that could cause actual results to differ materially from historical results or those anticipated, including those factors discussed under Item 1A, entitled Risk Factors , included in the Company s Form 10-K for the fiscal year ended May 31, 2018. Should one or more of these risks or uncertainties materialize adversely, or should underlying assumptions or estimates prove incorrect, actual results may vary materially from those described. These events and uncertainties are difficult or impossible to predict accurately and many are beyond the Company s control. The Company assumes no obligation to update any forward-looking statements to reflect events or circumstances after the date of such statements or to reflect the occurrence of anticipated or unanticipated events. For additional information, see the comments included in AAR s filings with the Securities and Exchange Commission."},"url":{"0":"https:\/\/www.aarcorp.com\/aarscomponentrepairfacilityinamsterdamrankednooneoutstandingsourceofrepairbynatosupportandprocurementagencyforfifthtime\/?F_All=y","1":"https:\/\/www.aarcorp.com\/aar-landing-gear-pbl-program-wins-2021-secretary-of-defense-pbl-award\/?F_All=y","2":"https:\/\/www.aarcorp.com\/aar-announces-marketing-partnership-agreement-with-provenair-technologies-llc\/?F_All=y","3":"https:\/\/www.aarcorp.com\/aar-reports-third-quarter-fiscal-year-2022-results1\/?F_All=y","4":"https:\/\/www.aarcorp.com\/aarsignsexclusivedistributionagreementwithcollinsaerospacesgoodrichdeicingspecialtyheatingsystemsbusiness\/?F_All=y","5":"https:\/\/www.aarcorp.com\/aar-to-announce-third-quarter-fiscal-year-2022-results-on-march-22-2022\/?F_All=y","6":"https:\/\/www.aarcorp.com\/aar-named-among-americas-best-midsize-employers-by-forbes\/?F_All=y","7":"https:\/\/www.aarcorp.com\/aar-to-participate-in-citis-2022-global-industrial-tech-and-mobility-conference-on-february-23-2022\/?F_All=y","8":"https:\/\/www.aarcorp.com\/rvc-aviation-maintenance-students-launch-their-career-with-aar\/?F_All=y","9":"https:\/\/www.aarcorp.com\/aar-announces-a-10-year-extension-of-its-component-mro-agreement-with-iamco-for-support-of-the-nato-e-3a-airborne-warning-and-control-awacs-fleet\/?F_All=y"},"thumbnail":{"0":"https:\/\/www.aarcorp.com\/cms\/images\/layout\/printlogo.png","1":"https:\/\/www.aarcorp.com\/cms\/images\/layout\/printlogo.png","2":"https:\/\/www.aarcorp.com\/cms\/images\/layout\/printlogo.png","3":"https:\/\/www.aarcorp.com\/cms\/images\/layout\/printlogo.png","4":"https:\/\/www.aarcorp.com\/cms\/images\/layout\/printlogo.png","5":"https:\/\/www.aarcorp.com\/cms\/images\/layout\/printlogo.png","6":"https:\/\/www.aarcorp.com\/cms\/images\/layout\/printlogo.png","7":"https:\/\/www.aarcorp.com\/cms\/images\/layout\/printlogo.png","8":"https:\/\/www.aarcorp.com\/cms\/images\/layout\/printlogo.png","9":"https:\/\/www.aarcorp.com\/cms\/images\/layout\/printlogo.png"},"author":{"0":"aarcorp","1":"aarcorp","2":"aarcorp","3":"aarcorp","4":"aarcorp","5":"aarcorp","6":"aarcorp","7":"aarcorp","8":"aarcorp","9":"aarcorp"}}