{"date":{"0":"6 Jun 2022","1":"2 Jun 2022","2":"1 Jun 2022","3":"20 May 2022","4":"10 May 2022","5":"9 May 2022","6":"9 May 2022","7":"5 May 2022","8":"4 May 2022","9":"2 May 2022","10":"27 Apr 2022","11":"26 Apr 2022","12":"21 Apr 2022","13":"8 Apr 2022","14":"8 Apr 2022","15":"7 Apr 2022","16":"6 Apr 2022","17":"5 Apr 2022","18":"5 Apr 2022","19":"4 Apr 2022"},"title":{"0":"Airborne anti-jam GPS receiver broadens compatibility with inertial navigation systems","1":"BAE Systems’ Automated Flight Planning Service deployed to the cloud","2":"BAE Systems to provide more than 500 electric drive systems for Ontario bus fleets","3":"New CV90 Combat Support Vehicles delivered to Norway","4":"Major upgrade to Compass Call with open system architecture","5":"BAE Systems to bring next-generation electric drive system to heavy-duty industrial vehicle market","6":"Over £2 billion for next phase of Dreadnought submarine build","7":"BAE Systems to develop autonomous network technology for multi-domain military missions","8":"BAE Systems launches new lightweight Head-Up Display – LiteWave®","9":"BAE Systems opens its new Manchester, N.H. facility, expanding job opportunities and production capabilities","10":"BAE Systems to develop new techniques to overwhelm military adversaries","11":"BAE Systems to collaborate with Hadean to harness supercomputing technology for training","12":"BAE Systems selected by GE Aviation to provide energy management solutions for NASA’s hybrid electric aircraft technology demonstrator","13":"BAE Systems hosts supplier conference for unique look into combat vehicle manufacturing and innovation","14":"BAE Systems set to spur voluntary sector recovery in Portsmouth by funding two new hubs","15":"BAE Systems receives task instructions for new Amphibious Combat Vehicle variant","16":"BAE Systems to develop mission data framework for Space Systems Command","17":"BAE Systems’ San Diego shipyard to modernize the destroyer USS Mustin","18":"U.S. Navy awards BAE Systems $125 million contract to provide post-deployment maintenance on USS Essex","19":"$22 million contract to supply aircraft survivability equipment"},"article":{"0":"BAE Systems expanded the capabilities of its Digital GPS Anti-Jam Receiver (DIGAR) by enabling beamforming with Trimble receivers in addition to its own receivers.BAE Systems expanded the capabilities of its Digital GPS Anti-Jam Receiver (DIGAR) by enabling beamforming with Trimble receivers in addition to its own receivers. DIGAR's beamforming capabilities increase the level of GPS jamming protection for aircraft by a million-fold – helping pilots execute their missions in contested environments.  BAE Systems’ engineers in Cedar Rapids developed software to ensure the compatibility of its antenna electronics with industry-standard Embedded GPS Inertial Navigation System (EGI) technology, enabling fast communication with transmitter electronics for superior beamforming. DIGAR provides the only antenna electronics on the market to beamform with both BAE Systems receivers and Trimble GPS receivers embedded in aircraft EGIs, as well as federated GPS systems and stand-alone GPS receivers.  “The modern battlespace has evolved, and peer state positioning, navigation, and timing threat systems are challenging our ability to conduct combat operations in the place and manner of our choosing,” said Greg Wild, director of Navigation and Sensor Systems at BAE Systems. “By combining DIGAR’s beamforming with trusted inertial navigation system data, we offer the highest level of jamming protection available today.”  DIGAR is a high-performance military GPS system for fixed-wing, rotary-wing, and unmanned airborne platforms. It combines field-proven antenna electronics, advanced signal-processing, and beamforming techniques to improve the reliability of positioning, navigation, and timing data in the presence of disruptive electromagnetic signals. DIGAR is also compatible with the advanced M-Code – delivering additional security to the warfighters who rely on it.  BAE Systems’ anti-jamming GPS technology has defeated powerful and sophisticated adversary threat systems in testing and combat, and is available for airborne, shipborne, and ground vehicle applications. The company’s military GPS business is based in Cedar Rapids, Iowa, where it is building a 278,000-square-foot state-of-the-art research and manufacturing facility scheduled to open in 2022.  To learn more about BAE Systems military GPS technology, visit: www.baesystems.com\/en\/product\/gps-products.","1":"BAE Systems’ Mobility Air Forces Automated Flight Planning Service is transitioning operations to Cloud OneBAE Systems’ Mobility Air Forces Automated Flight Planning Service, or MAFPS, is transitioning operations to Cloud One, one of the first mission-critical applications to complete a cloud migration. BAE Systems is a pioneer for the U.S. Air Force, providing warfighters with improved capabilities for mission management and agile airspace planning.  “The cloud environment will increase the operational availability of MAFPS’ best-in-class services for our customers,” said Meg Redlin, director of Mission Systems at BAE Systems. “The system’s automation streamlines flight planning for the future of airspace operations.”  MAFPS operations in Cloud One align with the U.S. Air Force’s transformation objectives, breaking from legacy on-premise environments to a cutting-edge architecture. The new approach to agile deployment at the enterprise level provides increased storage, computing, and processing flexibility, and enables faster version upgrades for the software.  Factoring in environment and platform constraints, BAE Systems’ MAFPS technology dynamically manages fuel-efficient routes and plans flights for Air Mobility Command’s cargo aircraft, tankers, and operational support aircraft. The software integrates data sources and manages constraints such as weather. MAFPS’ optimized plans also provide ideal routing and effective planning support so that warfighters can engage anywhere, under any condition. The system is currently fielded at all levels of operation.  BAE Systems’ mission management capabilities afford service men and women automated software solutions to improve mission effectiveness and enhance decision-making in the sky. With more than 30 years of experience delivering flight planning systems, its battle management, auto-routing, multi-domain targeting, ground support, and avionics and armament test equipment provide end-to-end capabilities for the U.S. Department of Defense. The development and production of this technology takes place in San Diego, Ca. and Fairview Heights, Il.","2":"BAE Systems selected by Toronto Transit Commission and Mississauga Transit to provide electric drive systems for new fleets of zero-emission capable hybrid transit buses.BAE Systems, a leader in electric propulsion, has been selected by the Toronto Transit Commission (TTC) to provide more than 335 electric drive systems for its new fleet of zero-emission capable hybrid transit buses. This follows an order of 165 additional Series-ER (Electric Range) systems for nearby Mississauga Transit (MiWay), supplying Ontario transit agencies with next-generation technology to reduce fuel use and enable infrastructure-free zero emissions operations across its fleets.  BAE Systems’ Series-ER system offers significant zero emission capabilities to assist a transit agency’s transition to a full zero-emission operation. Series-ER features the company’s next-generation components that use advanced materials and a lightweight, compact design to increase electrical efficiency. The Ontario fleet orders extend the footprint of the company’s technology to more than 15,000 transit buses worldwide.  “We are continuing to support TTC and MiWay with clean technology that advances our shared commitment to sustainable transportation,” said Steve Trichka, vice president and general manager of Power & Propulsion Solutions at BAE Systems. “Our electric drive system provides transit agencies with a reliable, efficient, and innovative solution for fleets to continue on the path to zero emissions.”  The Series-ER system includes an electric motor, onboard energy storage, and smart controls to create a clean, integrated electric propulsion and accessory power system for the buses. In addition, the buses will feature BAE Systems’ proven engine stop and start function and geofencing technology, allowing an electric-hybrid bus to automatically switch to full electric bus mode when entering designated green zones. The system uses advanced energy recovery and an onboard charger to further deliver zero-emissions operation without the need for grid-connected charging.  BAE Systems has 25 years of experience developing and fielding electric propulsion systems and accessories for transit buses. The company’s Series-ER technology is part of that foundation, helping transit agencies bridge the gap to zero emissions, without infrastructure requirements for vehicle charging.  The production and service support for the Series-ER systems will be conducted at the company’s facility in Endicott, N.Y.","3":"The first four CV90 Combat Support Vehicles were delivered to the Norwegian Armed Forces during a ceremony hosted by local industry partner Ritek AS in Levanger, Norway. The Norwegian CV90 fleet is fully digitalized, and among the most advanced combat vehicles in the world.The four vehicles are the first of 20 modernized CV90 engineering vehicles BAE Systems will deliver, in partnership with Ritek and the Norwegian Defense Materiel Agency.  “While rebuilding these vehicles, it has been important for the government that Norwegian jobs are supported, said Bent Joacim Bentzen, the State Secretary in the Ministry of Defense. “This has been possible thanks to a smooth and well-functioning collaboration between the Armed Forces, Defence Material Agency, Ritek and the licenser BAE Systems Hägglunds.”  Partnering with the Norwegian defense industry was a key factor in getting the contract signed and the vehicles into production quickly, under measures implemented by the Norwegian parliament to support the country’s economy through the challenges posed by the coronavirus pandemic.  BAE Systems serves as the main supplier, while Ritek plays a central role in purchasing, logistics, final assembly, and integration. Ritek has also been responsible for coordinating the project and growing the participation of Norwegian industry. As a result, about 20 Norwegian companies are now qualified suppliers of products and components for the CV90 vehicles, and an integral part of BAE Systems’ Norwegian supply chain.  “This is an example of how it is possible to achieve fast deliveries through well-functioning cooperation,” said Gro Jære, Director of the Defence Material Agency. “Just over a year after the contract was signed, we can now confirm that we are in the process of delivering the latest production series of CV90-based combat support vehicles to the Armed Forces. I would like to thank BAE Systems, Ritek, and my project staff for their flexibility, focus on delivery and effort so far.”  The close cooperation between all parties has broadened Norway’s overall national capacity in the defense vehicle space and its preparedness to support the vehicles. The Norwegian CV90 fleet is fully digitalized, and among the most advanced combat vehicles in the world.  “Norway should be proud of its ability to work with political leaders, procurement authorities, and industry to innovateand meet challenges like COVID-19 in a world of uncertainty,” said Tommy Gustafsson-Rask, managing director of BAE Systems Hägglunds. “Yet again, this milestone project demonstrates the strength of the relationships between all partners by delivering high-quality vehicles, on time and on cost.”  The delivery ceremony coincided with the completion of Ritek’s new assembly hall for the CV90 project, which increases the total workshop area to 5,500 square meters. The hall is designed to meet all requirements for lifting capacity and flexibility in Ritek’s existing defence-related project portfolio and for future projects.","4":"BAE Systems successfully tests third party software applications on SABER technology for Compass Call.BAE Systems successfully flight tested three third-party software applications on its Scalable Adaptive Bank of Electronic Resources (SABER) technology. SABER is the backbone of Compass Call, a next-generation electromagnetic attack weapon system that disrupts enemy command and control communications, radar, and navigation systems. The test flights demonstrated the technology’s agility in delivering advanced electromagnetic warfare capabilities to Compass Call.  “BAE Systems has been keeping Compass Call ahead of the curve as its prime mission system contractor for more than 20 years,” said Jared Belinsky, director of Electronic Attack Solutions at BAE Systems. “We’re continuously developing technology to help dominate the electromagnetic spectrum and keep our military service members safe.”  The hallmark of SABER is its open system architecture that enables the rapid integration of new technology through software updates instead of hardware reconfiguration. It also allows for multiple system upgrades to counter emerging threats.  The U.S. Air Force Compass Call Test Team, with support from BAE Systems, tested the new applications. BAE Systems integrated the applications with a non-proprietary SABER software development kit. The successful flight test is leading to fielding of the SABER capability on the EC-130H.  The EC-130H Compass Call mission system is currently being transferred to the Gulfstream G550 business jet, designated the EC-37B .  Work on SABER is being conducted at BAE Systems’ state-of-the-art facility in Hudson, N.H.","5":"BAE Systems, a leader in electric propulsion, will bring its next-generation power and propulsion technology to the heavy-duty industrial vehicle market.BAE Systems, a leader in electric propulsion, will bring its next-generation power and propulsion technology to the heavy-duty industrial vehicle market. The company’s electric drive system provides a revolutionary design which will help industrial vehicle original equipment manufacturers (OEMs) get their electric vehicles (EVs) to market faster and at a lower installed cost.  BAE Systems has over 15,000 power and propulsion systems in electrified commercial vehicles across the globe, and those systems have logged four billion on-road miles.  “We are providing an all-inclusive solution to bring the industrial vehicle market one step closer to a zero emission future,” said Steve Trichka, vice president and general manager of Power and Propulsion Solutions at BAE Systems. “Our next-generation components are the Swiss Army Knife of power electronics, delivering multifunctional capabilities in a compact and flexible design. This flexibility makes it easier for OEMs to cover multiple platforms, including traditional diesel and purpose built EVs.”  BAE Systems’ next-generation system for the heavy-duty industrial vehicle market builds on the company’s more than 25 years of experience in low and zero emission EV solutions for the transit bus and marine industries. The system uses fewer components and increases electrical efficiency. Its Modular Accessory Power System (MAPS) and Modular Power Control System (MPCS) also allow for scalable, customized solutions to provide the core power for a range of applications, from school buses and mining vehicles to sanitation and yard trucks.  Using a modular design, BAE Systems’ power electronics technology will provide both power and propulsion for battery electric, fuel cell, and electric-hybrid vehicles. In addition to MAPS and MPCS, the next-generation system is available with central motor, electric axle, battery and fuel cell solutions.  BAE Systems has a deep understanding of systems engineering, a revolutionary design for propulsion and accessory power, proven integration expertise, and aftermarket support to give manufacturers a reliable solution and faster path to market, at a lower installation cost.  BAE Systems develops and services its electric propulsion technology at its facilities in Endicott, N.Y., and Rochester, U.K.","6":"The Ministry of Defence has announced more than £2 billion of further funding for the Dreadnought nuclear deterrent submarines, which are under construction at BAE Systems’ shipyard in Barrow-in-Furness.The investment marks the latest financial commitment between the Ministry of Defence, BAE Systems and Rolls Royce. It is the initial investment within a planned total of nearly £10 billion for the whole of third delivery phase.  Dreadnought is one of the world’s most complex engineering programmes. More than £1 billion has been invested in advanced technology and upgraded infrastructure at BAE Systems’ Barrow shipyard to enable it to deliver Dreadnought, with £450 million of further investment to be made over the life of the programme.  The Dreadnought programme supports almost 30,000 jobs across the UK, with more than half of these estimated to be based in the North West of England, and a supply chain spend of £7.5 billion across 1,500 UK companies. In addition, BAE Systems currently has more than 1,000 employees in training on its early careers schemes within its Submarines business and is set recruit a further 340 apprentices and 90 graduates into the business this year.     This phase of the programme will see the first of four submarines, HMS Dreadnought, exit the BAE Systems’ shipyard to begin sea trials, laying the foundation to sustain the Continuous at Sea Deterrent for as long as the international security situation makes it necessary. It will also allow learning from this phase to be applied to the build and test of later boats.  The contracts with Rolls-Royce and BAE Systems will contribute significantly to the UK Government’s levelling-up ambitions and will support the training and development of the men and women of the Royal Navy who will take to the water in HMS Dreadnought when she enters service in the early 2030s.","7":"DARPA awards BAE Systems a $24 million contract as part of the Mission-Integrated Network Control (MINC) program.BAE Systems has received a $24 million contract from the U.S. Defense Advanced Research Projects Agency (DARPA) to develop software that autonomously configures tactical networks for mission-critical communications as part of the Mission-Integrated Network Control (MINC) program.  Reliable data and communications networks are critical in modern warfare. Currently, no capability exists to dynamically control interconnected networks and ensure that warfighters can communicate across domains in contested environments.  The MINC program seeks to build and demonstrate an integrated, advanced capability that creates a secure communications network to support multi-domain operations. Under the terms of the contract, BAE Systems’ FAST Labs™ research and development organization will develop the algorithms and software to anticipate, configure, and control available resources to optimize the flow of information.  “In today’s highly congested and contested environments, secure and adaptable multi-domain communications have never been more important,” said Brian Decleene, chief scientist at BAE Systems’ FAST Labs. “Recent research advances in networking, autonomy, and mission planning offers a unique opportunity for real-time control of the tactical network based on the mission and evolving operating environment. As a result of this program, we'll enable the operator to deliver the right information to the right user at the right time across multiple domains and improve mission outcome.”  BAE Systems’ work on this program leverages its robust networking, communications, and autonomy portfolios, including work on multi-domain programs such as Dynamic Network Adaptation for Mission Optimization, Resilient Synchronized Planning and Assessment for the Contested Environment, and Adapting Cross-Domain Kill-Webs.","8":"BAE Systems has unveiled a new lightweight, compact Head-Up Display (HUD) for use in commercial and military aircraft.LiteWave is a laptop sized HUD mounted above the pilot’s head which presents critical information, such as direction, altitude and speed, directly in their line of sight. Being 70% smaller and lighter than a traditional HUD, LiteWave can be fitted in aircraft with even the most limited cockpit space. It’s also up to 80% faster to install and its simple design makes maintenance quicker and cheaper.  Powered by BAE Systems’ revolutionary, patented waveguide technology, LiteWave can be easily adjusted to suit any individual flying position and allows the pilot to maintain excellent situational awareness, even during poor weather or at night.  “LiteWave can be fitted into virtually any cockpit in the world”, said Lee Tomlinson, director of HUD products at BAE Systems’ Electronic Systems business.  “Our engineers have created a digital display that is smaller, lighter and uses less power than any other Head-Up Display. It has the potential to revolutionise the market and make HUD technology far more accessible.”  LiteWave marks the next stage in bringing state-of-the-art digital technology to the marketplace, and is now available to begin flight trials for future customers on commercial and military aircraft.  LiteWave is manufactured at BAE Systems’ Electronic Systems site in Rochester, UK, which has innovated and invested in cockpit displays for over 60 years.  The Rochester site has produced more than 15,000 HUDs, which are in service on more than 50 different aircraft types in more than 50 countries globally. This includes some of the most advanced and demanding military aircraft, such as the Eurofighter Typhoon, F-16 Fighting Falcon and F-22 Raptor.  Learn more about BAE Systems HUD and display technology","9":"BAE Systems announced the opening of its new engineering and production facility in Manchester, N.H. as the latest step in a series of strategic facility investments across the country.BAE Systems has opened its new engineering and production facility in Manchester, N.H. as the latest step in a series of strategic facility investments across the country – including in Austin, Texas; Cedar Rapids, Iowa; and Huntsville, Ala.  The 200,000-square-foot Manchester facility includes engineering design space, modern laboratories, and office space, providing the company with additional capacity to support the design and development of electronic warfare (EW) systems for the United States and its allies.  “Our new Manchester facility is critical to developing next-generation electromagnetic warfare systems and accelerating the delivery of capabilities to our customers,” said Ray Brousseau, vice president and deputy general manager at BAE Systems Electronic Systems. “This investment will support our workforce, improve operational efficiency and research capabilities, and enable us to continue delivering high-quality, trusted products.”  BAE Systems’ advanced EW systems combine threat warning and self-protection capabilities to help pilots conduct their missions and return home safely. The growth of the company’s EW programs provides career growth opportunities for employees in Manchester. The company is hiring hundreds of skilled local candidates for critical roles to accommodate growth, including positions in engineering, finance, and project management.  “At BAE Systems, we offer challenging and rewarding work, great career opportunities, a welcoming culture, and an opportunity to take part in a mission that is critical to the safety and security of the U.S. military,” said Steve Copley, Manchester Project Director at BAE Systems. “Our Manchester facility provides an excellent, modern work environment for our employees, and deepens our roots in the Granite State.”  BAE Systems’ Electronic Systems sector is a global leader in researching, developing, implementing, and maintaining cutting-edge commercial, defense, and space electronics, with more than 6,000 employees in New Hampshire.","10":"AFRL awards BAE SystemsBAE Systems has been awarded a $2.8 million, three-year contract from the Air Force Research Laboratory to develop a new approach to defeat adversaries: by overwhelming them with complexity.  As part of the Complexity Modeling in Multiple Domains (COMMAND) program, BAE Systems will develop highly complex models to capture the “decision calculus” of an adversary, provide an estimate of how different attacks will affect their ability to respond, and ultimately drive them to the point of indecision.  “The goal of the COMMAND program is to understand the imposition of complex Courses of Action against an adversary’s integrated systems of systems by modelling their decision calculus,” said Mike Miller, technical group lead at BAE Systems’ FAST Labs™ research and development organization. “From kinetic attacks to jamming communications and cyber attacks, determining a combination of these various attack surfaces will make it challenging for the adversary to react in a timely and coherent manner.”  As part of Joint All-Domain Operations, the U.S. Department of Defense seeks to integrate effects against targets within the adversary’s Observe, Orient, Decide, and Act loop to push the adversary into strategic paralysis. By using \"complexity\" as an attack surface, this technology will shape how information flows through an opponent's decision making process.","11":"BAE Systems and distributed computing specialists Hadean will work together to develop next generation training for the military forces of tomorrow.Under a Memorandum of Understanding signed this week at IT2EC 2022, the parties will explore opportunities to apply BAE Systems expertise in military training to Hadean's technology to power a single synthetic environment, enabling air, land, sea, space and cyber forces to plug in and train together.     Hadean’s next generation platform brings together data and computation at scale, providing a unified platform for single synthetic environments, situational awareness and decision support.     This will allow military forces to regularly and securely train in a virtual world gaining crucial battlefield experiences without the challenges and constraints of live collective training and its limited warfare scenarios.     Director of Training Strategy for BAE Systems’ Air sector, said:  \"We are really excited to collaborate with Hadean which is a world leader in harnessing the power of computating technology for immersive synthetic training environments. “The aim is to combine Hadean’s computing expertise with our intimate understanding of our customers’ needs built on decades of working with the world's leading militaries to provide bespoke simulation environments and scenarios. This will deliver tangible advantages to next-generation training systems.    “The battlespace our customers are operating in is changing rapidly so we are adapting to stay ahead of the curve by partnering with cutting-edge companies like Hadean to meet this challenge.”     CEO and co-founder of Hadean, said:  “In the current climate, the demand for data and technical superiority has never felt more pertinent. “Collaborating with BAE Systems will allow us to progress digital transformation, where governments and militaries will be able to leverage our joint solutions to take advantage of the latest emerging spatial computing technologies to maximise their mission preparedness. “Legacy training simulations will be overcome through Hadean’s scalable infrastructure and BAE Systems’ significant experience to achieve massive, cross-domain synthetic environments that truly represent the complexity of modern battle spaces.” The initial proof of concept to be delivered by BAE Systems and Hadean will see them integrate multi-domain synthetic environments to enable complex collective training scenarios in a secure environment whilst leveraging data analytics and insights to improve the training capability and output.","12":"BAE Systems has been selected by GE Aviation to provide energy management solutions for the recently announced hybrid electric technology demonstrator program.BAE Systems has been selected by GE Aviation to provide energy management solutions for the recently announced hybrid electric technology demonstrator program. As part of the NASA research project, BAE Systems will design, test, and supply energy management components for electric aircraft in the megawatt power class.  NASA’s Electrified Powertrain Flight Demonstration (EPFD) project aims to progress hybrid electric flight technologies for commercial aviation. The project includes ground and flight-test demonstrations to be conducted over the next five years.  “We are harnessing our expertise in energy management systems and flight critical controls to support the development of electric propulsion systems for the future of flight,” said Ehtisham Siddiqui, vice president and general manager of Controls and Avionics Solutions at BAE Systems. “This effort continues our longstanding relationship with GE.”  In addition to energy storage, BAE Systems will provide the high-integrity controls and cables for the demonstrator’s power management system, which will be tested on CT7-9B turboprop engines. The company will also leverage its investment in aircraft electrification and expertise in flight-critical systems to provide guidance for electric flight certification requirements.  “We are excited about the opportunity to collaborate with BAE Systems on this demonstrator to advance energy storage systems at altitude,” said Mohamed Ali, vice president and general manager of engineering for GE Aviation. “GE Aviation is leading the development of hybrid electric technology for commercial aviation through this NASA collaboration. Energy management is an important component of our research program toward a more electric future of aviation with reduced carbon emissions and less reliance on fossil-based jet fuels.”  BAE Systems has over 25 years of experience developing and integrating electric propulsion systems for buses, boats, heavy-duty trucks, and military vehicles. The company also has more than 40 years of experience in controls and avionics for military and commercial aircraft.  Work on the project will be conducted at the company’s state-of-the-art facility in Endicott, N.Y.","13":"This was a critical opportunity for the business’s combat vehicle industrial base to come together to discuss challenges and promote opportunities within the industry, with congressional representatives, and U.S. Army and Marine Corps customers.This was a critical opportunity for the business’s combat vehicle industrial base to come together to discuss challenges and promote opportunities within the industry, with congressional representatives, and U.S. Army and Marine Corps customers.  “The work being done by the folks that make up our defense industrial base is critical to our national security,” said Rep. Mike Rogers (R-AL-3), ranking member of the House Armed Services Committee. “We must continue efforts to strengthen, enhance, and expand the industrial base.”  BAE Systems contracts about 1,000 suppliers in 45 states across its U.S. industrial base, to support combat vehicle manufacturing.  “The future of combat vehicle design and innovation must be a focal point across industry today,” said Andy Corea, BAE Systems vice president of the Combat Mission Systems business. “Bringing our best and brightest partners together for the unique opportunity to meet with our congressional stakeholders and customers is essential for a forward look at the next several years of combat vehicle manufacturing.\"  If you are interested in working with BAE Systems, visit our supplier website.","14":"BAE Systems set to spur voluntary sector recovery in Portsmouth by funding two new hubs.Two new voluntary sector hubs will be created in Portsmouth thanks to funding from BAE Systems, one of the city’s largest employers. The company’s £250,000 donation comes as newly-published research highlights that more than one in ten voluntary sector organisations offering wellbeing services in Portsmouth have been forced to close during the pandemic.  Increased demand for services, increased running costs, reduced ability to fundraise, lockdown restrictions and pressure on volunteers and staff were all cited as creating a highly challenging environment for the sector. 29 organisations which offered wellbeing services have ceased to operate in the past two years.  This includes a number of groups which provided support to disabled and elderly clients, as well as others operating in the provision of social welfare.  The two new hubs will allow voluntary sector organisations to share facilities, reduce costs and to collaborate on projects. The hubs aim to provide greater resilience within the local voluntary sector and will offer valuable support to some of the hundreds of organisations which provide a wide range of essential services to people in Portsmouth.  Both hubs, one in the city centre and one in the north of the city, will be delivered and managed by HIVE Portsmouth.  BAE Systems’ partnership with HIVE Portsmouth aims to address one of the main challenges faced by voluntary sector organisations: namely, the cost of operating premises. In addition to the financial support, BAE Systems employees will also be able to volunteer for projects run from the hubs as well as offering professional advice and mentoring to voluntary sector organisations in Portsmouth.","15":"BAE Systems is working on a C4\/UAS variant that will provide the transformational technology Marines need to observe their surroundings, collect and integrate information, and sense new targets over the horizon.Pending the results of the phase 1 study, the Marine Corps may pursue modification of an ACV to install the C4\/UAS payload. This C4\/UAS variant will provide the transformational technology Marines need to observe their surroundings, collect and integrate information, and sense new targets over the horizon.  With the proven ability to self-deploy from a variety of U.S. Navy ships, the ACV C4\/UAS will feature a state-of-the-art battle management system and advanced sensing capabilities. Offering a substantial level of commonality with other ACV variants, BAE Systems will work toward a fully open-architecture approach, allowing for rapid technology refresh and upgrades, including seamless integration of future technologies and capabilities. This has the potential to provide the Marine Corps significant economies of scale in development and life-cycle management costs.  “BAE Systems is dedicated to offering innovative combat system solutions to meet the multi-domain needs of the U.S. Marine Corps' modernization efforts,” said John Swift, vice president of amphibious programs at BAE Systems. “Adding the C4\/UAS variant to the ACV Family of Vehicles (FoV) may offer development and life cycle cost savings. We look forward to continuing our commitment to the Marines’ ability to be unmatched on the battlefield.”  The ACV is a highly mobile and proven solution capable of conducting rapid ship-to-objective maneuver, delivering enhanced combat power to the Fleet Marine Forces. Developed with teammate IVECO Defence Vehicles, the ACV represents the optimum balance of sea and land mobility, survivability, and future growth potential.  BAE Systems has received two full-rate production contracts since the Marine Corps declared Initial Operational Capability (IOC) for the ACV Family of Vehicles program, which includes the ACV personnel variant (ACV-P) and the ACV command variant (ACV-C). The company is currently under contract to design and develop a 30mm cannon variant (ACV-30), and a recovery variant (ACV-R) is also planned.  ACV C4\/UAS engineering, integration, and fabrication is taking place at BAE Systems locations in Stafford, Virginia; San Jose, California; Sterling Heights, Michigan; and York, Pennsylvania.","16":"Connecting interoperable sources to support data fusion, minimize disruptions, and provide curated data for mission needsBAE Systems will develop the mission data framework for Space Systems Command’s Enterprise Management and Control (EM&C) system. Under the prototype contract, BAE Systems will create an integrated data management environment, connecting interoperable sources to support fusion and discovery of data, minimize disruptions, deliver near real-time status of assets, and provide curated data for mission needs.  During a year-long development period, BAE Systems will perform four demonstrations. The demonstrations will show improved situational awareness for global satellite communications, or SATCOM, and underscore how the framework allows warfighters to rapidly respond to end users in contested, degraded, and operationally challenged environments.  “Our team is ready to provide the flexible data architecture and foundation required to build a resilient, responsive, and integrated SATCOM data environment,” said Ron Zuccaro, director of Resilient Ground Systems at BAE Systems. “Our cyber-resilient ground systems automate decision-making and integrate intelligence data from disparate sources.”  BAE Systems’ cloud computing suite integrates data sources and applications into a platform in which information flows through data services that act as the working memory of the EM&C system. This core data framework connects previously disparate data sources for mission operators and accelerates the ability for future mission-critical applications to be developed.  The Space Systems Command mission is to provide real-time global access to resilient and sustainable SATCOM capabilities for joint operations warfighters. EM&C enables resilient, uninterrupted satellite communications with the ability to rapidly plan, allocate, monitor, detect, locate, assess, and resolve issues to improve situational awareness and overall mission effectiveness.  Ground processing is a critical component of the overall space landscape, and combined with on-board processing capabilities, BAE Systems’ technology makes missions more effective. The company’s products increase the ability for on-orbit, real-time interaction and decision-making.","17":"BAE Systems has received a $89.4 million contract from the U.S. Navy to perform major modernization work aboard the Arleigh Burke-class guided-missile destroyer USS Mustin (DDG 89).The value of the competitively awarded contract could reach $95.2 million if all options are exercised.  Under the depot maintenance period (DMP) availability contract awarded, BAE Systems San Diego Ship Repair will dry-dock the ship, perform underwater hull preservation work, recondition the engineering spaces, upgrade its command and control equipment, and refurbish the crew’s living spaces. The DMP work is expected to begin in May 2022 and be completed in November 2023. The company expects to dry-dock the ship at the San Diego Naval Base and then complete the remaining work at its Barrio Logan facility.  “A depot maintenance availability is a significant project for upgrading the capability of Aegis destroyers,” said David M. Thomas, Jr., BAE Systems San Diego Ship Repair’s vice president and general manager. “Our ship repair team has the critical know-how for repairing DDGs from our prior work. The DMP availability we’ll perform on the USS Mustin will usher the ship into a higher phase of fleet readiness.”    BAE Systems’ San Diego shipyard is completing similar work aboard the guided missile destroyer USS Preble (DDG 88) and has previously completed a DMP availability aboard USS Shoup (DDG 86).  USS Mustin is the 39th ship in the Arleigh Burke class and was commissioned in July 2003. The ship is named in honor of the Mustin family who has more than a century of service in the U.S. Navy. One other U.S. Navy combatant has carried the family name, USS Mustin (DD 413).  BAE Systems is a leading provider of ship repair, maintenance, modernization, conversion, and overhaul services for the Navy, other government agencies, and select commercial customers. The company operates three full-service shipyards in California, Florida, and Virginia, and offers a highly skilled, experienced workforce; seven dry-docks and railways; and significant pier space and ship support services. The company’s San Diego shipyard has approximately 1,100 employees and works with the Navy and several subcontractor companies to accomplish its ship sustainment work.","18":"BAE Systems has received a $125.5 million contract from the U.S. Navy to drydock and provide maintenance service aboard the amphibious assault ship USS Essex (LHD 2).The ship recently completed a seven-month deployment to the Western Pacific.  BAE Systems’ San Diego shipyard will begin working aboard the 844-foot-long USS Essex in June. Under the docking selected restricted availability (DSRA) contract awarded, BAE Systems will perform hull, tank, and mechanical work; repair internal and exterior decks; and refurbish habitability spaces for the ship’s crew and embarked U.S. Marine Corps troops. Work on the ship is expected to be completed in September 2023. The contract includes options that, if exercised, would bring the cumulative value to $148.2 million.  “USS Essex recently returned to San Diego following an extended overseas deployment,” said David M. Thomas, Jr., vice president and general manager of BAE Systems San Diego Ship Repair. “I look forward to the BAE Systems-Navy team delivering upon our commitment to restore Essex’s material condition and prepare it for future deployments.”  USS Essex is the fifth U.S. ship named after Essex County, Mass. The ship was commissioned in October 1992 and is homeported in San Diego.  BAE Systems’ San Diego shipyard is currently completing a 22-month DSRA aboard USS Boxer (LHD 4), which is in the same ship class as Essex.  BAE Systems is a leading provider of ship repair, maintenance, modernization, conversion, and overhaul services for the Navy, other government agencies, and select commercial customers. The company operates three full-service shipyards in California, Florida, and Virginia, and offers a highly skilled, experienced workforce, seven drydocks and railways, significant pier space and ship support services. The company’s San Diego shipyard has approximately 1,100 employees and works with the Navy and several subcontractor companies to accomplish its ship sustainment work.","19":"BAE Systems receives $22 million for production and delivery of CMWS for a fleet of Apache helicopters in U.S. Foreign Military Sales contractBAE Systems has received a $22 million award to supply the AN\/AAR-57 Common Missile Warning System (CMWS) and associated equipment as part of a U.S. Foreign Military Sales contract. The deal – facilitated by the U.S. Army – is for the production and delivery of CMWS for a fleet of Apache helicopters.  The CMWS alerts crews to incoming hostile fire and missile threats, automatically coordinates and cues countermeasures, and enables data recording capabilities for post-mission analysis. The fleet will leverage BAE Systems’ new Gen3X Electronic Control Unit with updated components which provide increased processing capabilities and longer term sustainability.  “Our Common Missile Warning System is a tried-and-true, electronic warfare system that protects aircraft and their crews in the most complex battlespaces,” said Chris Austin, director of Threat Detection Solutions at BAE Systems. “We are honored to have been selected to provide this critical capability.”  Deployed across the U.S. Army’s rotary and fixed-wing fleet, as well as aircraft of 17 allied countries, more than 3,000 CMWS units have been installed on over 40 different platforms since 2005. The CMWS has logged approximately 4 million combat theater flight hours, saving dozens of aircraft and hundreds of lives in an ever-changing threat environment."},"url":{"0":"https:\/\/www.baesystems.com\/en\/article\/airborne-anti-jam-gps-receiver-broadens-compatibility-with-inertial-navigation-systems","1":"https:\/\/www.baesystems.com\/en\/article\/bae-systems--automated-flight-planning-service-deployed-to-the-cloud","2":"https:\/\/www.baesystems.com\/en\/article\/bae-systems-to-provide-more-than-500-electric-drive-systems-for-ontario-bus-fleets","3":"https:\/\/www.baesystems.com\/en\/article\/new-cv90-combat-support-vehicles-delivered-to-norway","4":"https:\/\/www.baesystems.com\/en\/article\/major-upgrade-to-compass-call-with-open-system-architecture","5":"https:\/\/www.baesystems.com\/en\/article\/bae-systems-to-bring-next-generation-electric-drive-system-to-heavy-duty-industrial-vehicle-market","6":"https:\/\/www.baesystems.com\/en\/article\/over--2-billion-for-next-phase-of-dreadnought-submarine-build","7":"https:\/\/www.baesystems.com\/en\/article\/bae-systems-to-develop-autonomous-network-technology-for-multi-domain-military-missions","8":"https:\/\/www.baesystems.com\/en\/article\/bae-systems-launches-new-lightweight-head-up-display-litewave","9":"https:\/\/www.baesystems.com\/en\/article\/bae-systems-opens-its-new-manchester--n-h--facility--expanding-job-opportunities-and-production-capabilities","10":"https:\/\/www.baesystems.com\/en\/article\/bae-systems-to-develop-new-techniques-to-overwhelm-military-adversaries","11":"https:\/\/www.baesystems.com\/en\/article\/bae-systems-to-collaborate-with-hadean-to-harness-supercomputing-technology-for-training","12":"https:\/\/www.baesystems.com\/en\/article\/bae-systems-has-been-selected-by-ge-aviation-to-provide-energy-management-solutions-for-the-recently-announced-hybrid-electric-technology-demonstrator-program-","13":"https:\/\/www.baesystems.com\/en\/article\/bae-systems-hosts-supplier-conference-for-unique-look-into-combat-vehicle-manufacturing-and-innovation","14":"https:\/\/www.baesystems.com\/en\/article\/bae-systems-set-to-spur-voluntary-sector-recovery-in-portsmouth-by-funding-two-new-hubs","15":"https:\/\/www.baesystems.com\/en\/article\/bae-systems-receives-task-instructions-for-new-amphibious-combat-vehicle-variant","16":"https:\/\/www.baesystems.com\/en\/article\/bae-systems-to-develop-mission-data-framework-for-space-systems-command","17":"https:\/\/www.baesystems.com\/en\/article\/bae-systems-san-diego-shipyard-to-modernize-the-destroyer-uss-mustin","18":"https:\/\/www.baesystems.com\/en\/article\/us-navy-awards-bae-systems-125-million-contract-to-provide-post-deployment-maintenance-on-uss-essex","19":"https:\/\/www.baesystems.com\/en\/article\/-22-million-contract-to-supply-aircraft-survivability-equipment"},"thumbnail":{"0":"https:\/\/www.baesystems.com\/en-media\/webImage\/20220602140641\/1573676275387.jpg","1":"https:\/\/www.baesystems.com\/en-media\/webImage\/20220602124150\/1573676273236.jpg","2":"https:\/\/www.baesystems.com\/en-media\/webImage\/20220601134414\/1573676186986.jpg","3":"https:\/\/www.baesystems.com\/en-media\/webImage\/20220520151333\/1573673987987.jpg","4":"https:\/\/www.baesystems.com\/en-media\/webImage\/20220509155514\/1573673787604.jpg","5":"https:\/\/www.baesystems.com\/en-media\/webImage\/20220524133727\/1573673777094.jpg","6":"https:\/\/www.baesystems.com\/en-media\/webImage\/20210402141925\/1434588298683.jpg","7":"https:\/\/www.baesystems.com\/en-media\/webImage\/20220505133746\/1573673673070.jpg","8":"https:\/\/www.baesystems.com\/en-media\/webImage\/20220504133300\/1573673615960.jpg","9":"https:\/\/www.baesystems.com\/en-media\/webImage\/20220502130121\/1573673543699.jpg","10":"https:\/\/www.baesystems.com\/en-media\/webImage\/20220427125004\/1573673476287.jpg","11":"https:\/\/www.baesystems.com\/en-media\/webImage\/20220426064840\/1573673427019.png","12":"https:\/\/www.baesystems.com\/en-media\/webImage\/20220421124942\/1573673353013.jpg","13":"https:\/\/www.baesystems.com\/en-media\/webImage\/20220428194935\/1573673198659.png","14":"https:\/\/www.baesystems.com\/en-media\/webImage\/20220408092512\/1573673208969.jpg","15":"https:\/\/www.baesystems.com\/en-media\/webImage\/20210727131206\/1434668143527.jpg","16":"https:\/\/www.baesystems.com\/en-media\/webImage\/20220406003203\/1573673148330.jpg","17":"https:\/\/www.baesystems.com\/en-media\/webImage\/20220405112413\/1573673129076.jpg","18":"https:\/\/www.baesystems.com\/en-media\/webImage\/20220322111945\/1573672793834.jpg","19":"https:\/\/www.baesystems.com\/en-media\/webImage\/20220404134914\/1434554701819.jpg"},"author":{"0":"Baesystems","1":"Baesystems","2":"Baesystems","3":"Baesystems","4":"Baesystems","5":"Baesystems","6":"Baesystems","7":"Baesystems","8":"Baesystems","9":"Baesystems","10":"Baesystems","11":"Baesystems","12":"Baesystems","13":"Baesystems","14":"Baesystems","15":"Baesystems","16":"Baesystems","17":"Baesystems","18":"Baesystems","19":"Baesystems"}}