{"date":{"0":"06\/22\/2022","1":"06\/08\/2022","2":"12\/16\/2021","3":"12\/14\/2021","4":"12\/15\/2020","5":"12\/10\/2020","6":"12\/24\/2019","7":"12\/23\/2019","8":"12\/12\/2018","9":"11\/20\/2018","10":"12\/28\/2017","11":"12\/21\/2017","12":"12\/20\/2016","13":"12\/15\/2016","14":"12\/07\/2015","15":"12\/03\/2015","16":"12\/19\/2014","17":"12\/16\/2014","18":"12\/30\/2013","19":"12\/12\/2013","20":"12\/17\/2012","21":"12\/13\/2012","22":"12\/16\/2011","23":"12\/13\/2011","24":"12\/20\/2010","25":"12\/17\/2010","26":"12\/09\/2009","27":"12\/01\/2009","28":"12\/15\/2008","29":"12\/04\/2008","30":"12\/20\/2007","31":"11\/14\/2007","32":"12\/11\/2006","33":"12\/07\/2006","34":"12\/14\/2005","35":"11\/28\/2005","36":"12\/30\/2004","37":"12\/22\/2004","38":"12\/18\/2003","39":"12\/15\/2003","40":"12\/16\/2002","41":"12\/13\/2002","42":"12\/17\/2001","43":"12\/11\/2001","44":"12\/28\/2000","45":"12\/08\/2000","46":"12\/31\/1999","47":"12\/08\/1999","48":"12\/16\/1998","49":"12\/10\/1998","50":"12\/15\/1997","51":"12\/10\/1997","52":"12\/20\/1996","53":"12\/19\/1996"},"title":{"0":"Fluor Awarded Engineering, Procurement and Construction Management Services Contract for Iluka’s Eneabba Rare Earths Refinery in Australia","1":"Fluor Selected for Interstate 35 Capital Express South Project in Austin, Texas","2":"Fluor-Led JV Completes A9 Roadways Project in Amsterdam","3":"Fluor-Backed NuScale Power Signs Agreement to Accelerate Small Modular Reactor Commercialization","4":"Stork Awarded Maintenance Contract by Sitech in the Netherlands","5":"Fluor Reports Third Quarter 2020 Results","6":"COOEC-Fluor Completes Module Program for KIPIC Al-Zour Project in Kuwait","7":"Fluor-Led Joint Venture Opens Loop 202 South Mountain Freeway Project","8":"Fluor Set to Modernize Red & Purple Rail Lines in Chicago","9":"Fluor Selected for Lithium and Boron Mine Project in Nevada","10":"Power on the Way to Major Urban Areas as Fluor Completes Work on Priority Lines in Puerto Rico","11":"Fluor Selected as FEMA’s Zone 1 Contractor for its Technical Assistance Contracts IV","12":"Fluor to Design and Build $2 Billion Diabetes API Manufacturing Facility for Novo Nordisk in North Carolina","13":"Fluor-Led Team Completes Tappan Zee Bridge Towers","14":"Fluor Agrees to Acquire Stork Holding B.V., a Global Industrial Services Company","15":"Fluor Garners UK Binding Corporate Rules Approval for Secure Employee and Client Data","16":"AMECO Celebrates Grand Opening of its New Global Headquarters","17":"Fluor Begins Work on ExxonMobil Antwerp Refinery Delayed Coker Project in Belgium","18":"Fluor to Provide Consulting Services for Kuwait Oil Company Projects","19":"Fluor’s NuScale Power Awarded U.S. DOE Funding to Advance Nuclear Small Modular Reactor Technology","20":"Fluor Team Selected for Tappan Zee Bridge Replacement in New York","21":"Fluor’s John Hopkins Assumes Role of Chairman and CEO of NuScale Power","22":"Fluor Awarded Base Operations Support Contract by U.S. Navy for Jacksonville-Area Bases","23":"Fluor Signs MOU with Clean Line Energy for 800-Mile Transmission Line","24":"Retired Army Lieutenant General Richard A. Hack Joins Fluor’s Government Group","25":"Fluor Team Achieves Financial Close on Windsor-Essex Parkway","26":"Utah DOT Selects Fluor-Led Team for $1.1 Billion Major Expansion of I-15 Corridor","27":"National Safety Council Selects AMECO for Best Safety Performance","28":"Fluor Honored by Hart Energy","29":"Fluor Forms New Business Unit to Focus on Offshore Market","30":"Fluor-Transurban Consortium and VDOT Sign Contract to Design, Build and Operate I-495 HOT Lanes","31":"Fluor to Present at the Bear Stearns Annual Commodities and Capital Goods Conference","32":"Fluor Opens Northeast Region Office, Employs 200 Professionals","33":"AMECO Celebrates 15 Million Safe Work Hours","34":"Fluor Awarded Front-end Engineering Contract for Louisiana Refinery Expansion","35":"Fluor to Present at the Bear Stearns Annual Commodities and Capital Goods Conference","36":"Fluor Corporation Exercises Rights Under Convertible Notes Indenture","37":"Fluor Selected By Sasol to Upgrade South African Refinery","38":"Ishikawajima-Harima Heavy Industries Co. Ltd. & ICA Fluor Consortium Awarded First LNG Terminal in Mexico","39":"Fluor and Lukoil Neftegazstroy to Build Russian Oil Products Export Terminal","40":"ICA Fluor Daniel Signs Contract to Build 498 MW Power Plant for Iberdrola","41":"Fluor Celebrates 50 Years of Community Service","42":"Fluor Appoints Alan Boeckmann Chairman and Chief Executive Officer","43":"Fluor Selected by Kennecott to Provide Maintenance Services at Utah Smelter","44":"Fluor Provides Guidance on 'Stub' Period and First Quarter","45":"'New' Fluor Corporation Announces Dividend Schedule for 2001","46":"Fluor Corp. Media Relations Officials Available To Comment on Y2K Status Throughout New Year's Weekend","47":"Fluor Corp. Raises Quarterly Dividend, Signals Change in Long Term Strategy","48":"American Equipment Company Acquires Full Interest in Mexico's Maquinaria Panamericana, S.A. de C.V.","49":"Fluor Corporation Appoints Senior Vice President of Human Resources","50":"Fluor Corporation Announces Strategic Alternatives Analysis","51":"Fluor Corporation Board Declares Quarterly Dividend","52":"Fluor Announces SEC Filing","53":"Fluor Daniel And Mitsubishi Heavy Industries Win First Major LNG Contract"},"article":{"0":"IRVING, Texas--(BUSINESS WIRE)-- Fluor Corporation (NYSE: FLR) announced today that its Mining & Metals business was awarded a contract to perform engineering, procurement and construction management (EPCM) for Iluka Resources Limited s Eneabba project, a fully integrated rare earths refinery in Eneabba, Western Australia. Fluor will book the undisclosed reimbursable contract value in the second quarter of 2022. Image is a 3D model of Iluka s Eneabba Phase 3, a fully integrated rare earths refinery. Fluor is the engineering, procurement and construction management contractor with construction expected to begin in 2022, and first production scheduled for 2025. (Photo: Business Wire) Fluor will complete the front-end engineering design and execute the EPCM services to deliver the refinery. The completed refinery will produce both light and heavy rare earth oxides including neodymium, praseodymium, dysprosium and terbium, which are essential to global electrification. It will have a feed capacity of approximately 55,000 tonnes per annum to produce an estimated 17,500 tonnes per annum of rare earth oxides and will be capable of processing rare earth feedstocks sourced from both Iluka s portfolio and from a range of potential third party concentrate suppliers. Rare earths are critical minerals that provide key inputs to a broad range of technologies including the permanent magnets that are essential for electric vehicles and renewable energy infrastructure, said Tony Morgan, president of Fluor s Mining & Metals business. When completed, the Eneabba project will add significant capacity to an evolving clean technologies ecosystem in Australia. The Eneabba rare earths refinery has the potential to become a strategic hub for the downstream processing of Australia s rare earth resources. Fluor is pleased to be selected as a trusted partner to deliver this strategic project for Iluka. Fluor will build on its successful long-term project delivery experience in Australia and expand the company s geographic footprint in the rare earths sector. Execution of this project will be a demonstration of our value chain offering in future-facing technologies. Fluor s Perth, Australia office will lead the project. Construction of the refinery is scheduled to begin later this year with first production expected in 2025. About Fluor Corporation Fluor Corporation (NYSE: FLR) is building a better future by applying world-class expertise to solve its clients greatest challenges. Fluor s 41,000 employees provide professional and technical solutions that deliver safe, well-executed, capital-efficient projects to clients around the world. Fluor had revenue of $12.4 billion in 2021 and is ranked 259 among the Fortune 500 companies. With headquarters in Irving, Texas, Fluor has provided engineering, procurement and construction services for more than 110 years. For more information, please visit www.fluor.com or follow Fluor on Twitter, LinkedIn, Facebook and YouTube. #m&m Brian Mershon Media Relations 469.398.7621 Jason Landkamer Investor Relations 469.398.7222 Source: Fluor Corporation","1":"IRVING, Texas--(BUSINESS WIRE)-- Fluor Corporation (NYSE: FLR) announced today that it was awarded a construction contract for the Interstate 35 (I-35) Capital Express South project in Austin, Texas, by the Texas Department of Transportation (TxDOT). Fluor will book the nearly $548 million contract value in the second quarter of 2022. Fluor Selected for TxDOT Interstate 35 Capital Express South Project in Austin, Texas (photo credit: TxDOT) This new award is a continuation of Fluor s Texas-centric infrastructure focus and reinforces the strength of our relationships with state and local officials across the state, said Thomas Nilsson, president of Fluor s Infrastructure business. This is the first in a series of vital infrastructure projects to rebuild the I-35 corridor in Austin in response to business and population expansion in one of the country s most dynamic regions. The approximately 9-mile project will add two non-tolled high-occupancy vehicle managed lanes in each direction along I-35 from U.S. 290 West\/State Highway 71\/Ben White Boulevard to State Highway 45 Southeast. Fluor s scope includes a combination of at-grade and elevated lanes in the median, reconstruction of bridges and frontage roads, the addition of a shared-use pedestrian and bicycle path, and enhanced safety and mobility improvements. I-35 through Austin is one of the most traveled interstates in Texas and serves as the backbone of the local, regional and national transportation network. This portion of the interstate serves more than 150,000 vehicles per day. Construction is scheduled to begin in late 2022 with substantial completion anticipated in late 2027. Fluor has been designing and building infrastructure projects in Texas for nearly 20 years and is currently executing the I-635 LBJ East, Southern Gateway and I-35E projects in Dallas; the Oak Hill Parkway project in Austin; and performing capital maintenance for the Horseshoe project in Dallas. About Fluor Corporation Fluor Corporation (NYSE: FLR) is building a better future by applying world-class expertise to solve its clients greatest challenges. Fluor s 41,000 employees provide professional and technical solutions that deliver safe, well-executed, capital-efficient projects to clients around the world. Fluor had revenue of $12.4 billion in 2021 and is ranked 259 among the Fortune 500 companies. With headquarters in Irving, Texas, Fluor has provided engineering, procurement and construction services for more than 110 years. For more information, please visit www.fluor.com or follow Fluor on Twitter, LinkedIn, Facebook and YouTube. #infra Brian Mershon Media Relations 469.398.7621 Jason Landkamer Investor Relations 469.398.7222 Source: Fluor Corporation","2":"IRVING, Texas & AMSTERDAM--(BUSINESS WIRE)-- Fluor Corporation (NYSE: FLR) announced today that its joint venture with Balast Nedam and Heijmans completed the A9 public-private-partnership roadways project in Amsterdam. With a focus on sustainable construction, the project team installed more than 5,000 solar panels on the roof of the tunnel that generate enough electricity to power the equivalent of 600 homes. Fluor s Pieter Teeuw and Ger van der Schaaf (shown third & fourth L to R) celebrate the completion of upgrades and expansion of the A9 highway between Holendrecht and Diemen junctions in Amsterdam. (Photo: Business Wire) The project consisted of the upgrade and expansion of 7 kilometers of the existing A9 highway between the junctions of Holendrecht and Diemen, including the bridge over the river Gaasp, the road surface on the A9 Gaasperdammerweg and the construction of the Netherlands largest cut-and-cover tunnel with five tunnel tubes. The expansion of A9 maintains driver accessibility in the region and enhances quality of life for those who reside in the area by minimizing traffic noise and improving the air quality along the tunnel, said Thomas Nilsson, president of Fluor s Infrastructure business. We were able to use 3D modeling to demonstrate our design expertise and test numerous situations to validate our ideas before beginning construction. Using smart construction methods and sustainable materials improved the impact on the community and the environment. The Fluor joint venture will operate and maintain the roadway for 20 years. Construction began in early 2015. About Fluor Corporation Fluor Corporation (NYSE: FLR) is building a better world by applying world-class expertise to solve its clients greatest challenges. Fluor s 44,000 employees provide professional and technical solutions that deliver safe, well-executed, capital-efficient projects to clients around the world. Fluor had revenue of $14.2 billion in 2020 and is ranked 196 among the Fortune 500 companies. With headquarters in Irving, Texas, Fluor has been providing engineering, procurement and construction services for more than 100 years. For more information, please visit www.fluor.com or follow Fluor on Twitter, LinkedIn, Facebook and YouTube. #infra Brian Mershon Media Relations 469.398.7621 Jason Landkamer Investor Relations 469.398.7222 Source: Fluor Corporation","3":"- Merger agreement with Spring Valley Acquisition Corp. anticipated to close in first half of 2022 - Combined company expected to be first publicly-traded advanced small modular reactor (SMR) technology developer - NuScale s module design enables future low-carbon power generation IRVING, Texas--(BUSINESS WIRE)-- Fluor Corporation (NYSE: FLR) announced today that NuScale Power, LLC, in which Fluor is the majority investor, has signed a merger agreement with Spring Valley Acquisition Corp. (NASDAQ: SV) (Spring Valley). Fluor has invested more than $600 million in NuScale Power since 2011 to help bring its technology to market. The proposed transaction is anticipated to close in the first half of 2022 subject to customary closing conditions. Upon completion of the transaction, Fluor projects to own approximately 60 percent of the combined company, based on the PIPE investment commitments received and the current equity and in-the-money equity equivalents of NuScale Power and Spring Valley. Fluor expects that the proposed transaction will bolster and accelerate the path to commercialization and deployment of NuScale Power s unique small modular nuclear reactor technology, said Alan Boeckmann, executive chairman, Fluor. This is the next step in Fluor s plan, first outlined 10 years ago, to work closely with NuScale Power, Congress and the Department of Energy to commercialize this unique carbon-free energy technology. Today s announcement is further evidence that cost-shared government funding to build first-of-a kind commercial scale technology can attract private investment and yield results. Fluor will continue to serve as an important partner by providing NuScale Power and its clients with world-class expertise in engineering services, project management and supply chain support, Boeckmann said. NuScale Power is the developer of the only SMR technology that has received Standard Design Approval from the U.S. Nuclear Regulatory Commission (NRC). After merging with Spring Valley, the combined company will become the first and only publicly-traded company focused on development of advanced SMR technology. NuScale Power s innovative, carbon-free nuclear power solution offers clients safe, scalable and deployable 77-megawatt modules in configurations of four, six or 12 modules. The SMR technology can be integrated into electric grids to complement existing renewable energy sources and provide ongoing, consistent and reliable baseload power. Fluor, together with NuScale Power, continues to advance the first SMR cost-reimbursable services contract with Utah Associated Municipal Power Systems (UAMPS). UAMPS awarded Fluor a contract in January 2021 to provide estimating, development, design and engineering services for its Carbon-Free Power Project. Forward-Looking Statements This release may contain forward-looking statements (including without limitation information concerning the timing and results of the proposed transaction and statements to the effect that Fluor or its management will, believes, expects, anticipates, plans or other similar expressions). Actual results may differ materially as a result of a number of factors. Caution must be exercised in relying on these and other forward-looking statements. Due to known and unknown risks, Fluor s results may differ materially from its expectations and projections. Additional information concerning factors that could affect Fluor s results can be found in Fluor s public periodic filings with the Securities and Exchange Commission, including the discussion under the heading Item 1A. Risk Factors in Fluor s Form 10-K filed on February 26, 2021. Such filings are available either publicly or upon request from Fluor s Investor Relations Department: (469) 398-7222. Fluor disclaims any intent or obligation other than as required by law to update its forward-looking statements in light of new information or future events. About Fluor Corporation Fluor Corporation (NYSE: FLR) is building a better world by applying world-class expertise to solve its clients greatest challenges. Fluor s 44,000 employees provide professional and technical solutions that deliver safe, well-executed, capital-efficient projects to clients around the world. Fluor had revenue of $14.2 billion in 2020 and is ranked 196 among the Fortune 500 companies. With headquarters in Irving, Texas, Fluor has been providing engineering, procurement and construction services for more than 100 years. For more information, please visit www.fluor.com or follow Fluor on Twitter, LinkedIn, Facebook and YouTube. #corp Brian Mershon Media Relations 469.398.7621 Jason Landkamer Investor Relations 469.398.7222 Source: Fluor Corporation","4":"IRVING, Texas & UTRECHT, the Netherlands--(BUSINESS WIRE)-- Fluor Corporation (NYSE: FLR) announced today that Stork, part of Fluor s Diversified Services segment, was awarded a 26-month maintenance contract extension by Sitech Manufacturing Services in the Netherlands. Fluor will book the undisclosed value in the fourth quarter of 2020. This press release features multimedia. View the full release here: https:\/\/www.businesswire.com\/news\/home\/20201215005177\/en\/ A Stork welder is shown providing services for one of the company's valued clients. (Photo: Business Wire) We are pleased that Sitech extended the contract with Stork to be their continued partner of choice for the coming years, said Taco de Haan, president of Stork. Stork and Sitech s 25-year relationship exemplifies the importance of a successful business partnership. Both companies recognize the benefits derived from long-term partnerships that enable continuous performance improvement in safety, cost and overall plant asset performance. Under this framework agreement, Stork will provide maintenance services and will execute projects and turnarounds. The scope of work includes mechanical, electrical and instrumentation services complemented by a portfolio of specialist services such as valves and rotating equipment maintenance and repair, high-voltage services, calibration, on-site machining and bolting, and heat treatment services. Stork will deliver these services using its site office together with Stork s nearby Solutions Center in Elsloo and Fluor s local engineering capabilities. Services will be provided at various renowned asset owners at the Chemelot industrial complex site in Geleen, the Netherlands. This award renewal is another great indication that clients appreciate Stork s strong performance in safety and delivery. Stork provides a broad portfolio of services for our clients in a very efficient one-stop-shop approach, said Alejandro Escalona, Stork s regional vice president, Europe. We look forward to continuing our longstanding relationship with Sitech and to continuously improve together. The framework agreement started in October 2020 and has extension options after the expiration date in December 2022. About Stork Stork, a Fluor company, continually improves the performance of its clients assets through a wide range of integrated, innovative and data-driven solutions, from operations and maintenance to turnarounds and modifications. We are committed to growing our clients business sustainably and successfully by setting new standards of excellence in asset management. Underpinned with our core values Safety, Integrity, Teamwork, Client Focus and Excellence we aim to be the industry reference, every day, everywhere. For more information, please visit www.stork.com or follow us on Twitter @StorkTS, LinkedIn. About Fluor Corporation Fluor Corporation (NYSE: FLR) is a global engineering, procurement, fabrication, construction and maintenance company with projects and offices on six continents. Fluor s 45,000 employees build a better world and provide sustainable solutions by designing, building and maintaining safe, well executed projects. Fluor had revenue of $17.3 billion in 2019 and is ranked 181 among the Fortune 500 companies. With headquarters in Irving, Texas, Fluor has served its clients for more than 100 years. For more information, please visit www.fluor.com or follow Fluor on Twitter, LinkedIn, Facebook and YouTube. #stork View source version on businesswire.com: https:\/\/www.businesswire.com\/news\/home\/20201215005177\/en\/ Brian Mershon Media Relations 469.398.7621 Jason Landkamer Investor Relations 469.398.7222 Beatrijs van de Ven Stork Media Relations +316.515.66.513 Source: Fluor Corporation","5":"Fluor reports earnings per share of $0.14 for the third quarter of 2020 No material project execution charges in the first three quarters of 2020 Company now current with all financial filings and debt requirements COVID-19 continues to delay new awards as clients defer capital investments IRVING, Texas--(BUSINESS WIRE)-- Fluor Corporation (NYSE: FLR) today announced financial results for its quarter ended September 30, 2020. Revenue for the quarter was $3.8 billion and net earnings from continuing operations attributable to Fluor was $19 million, or $0.14 per share. Consolidated segment profit for the quarter was $129 million compared to $79 million a year ago. Operating cash flow in the quarter was $80 million. New awards for the third quarter were $1.7 billion and ending backlog was $27.8 billion. Corporate general and administrative expenses for the quarter were $68 million which included foreign currency transaction losses of $30 million and investigation expenses of $19 million in the quarter. With today s 10-Q filing, Fluor is now current with its financials, said Carlos Hernandez, Fluor s chief executive officer, While 2020 has provided a lot of unexpected challenges for our business, we are pleased to report that for the third consecutive quarter, we have had no material project execution charges. Outlook Although Fluor has suspended its guidance for 2020, the company expects to report fourth quarter results and 2021 guidance to the investment community in February 2021. The company expects its cash balance to remain around $2 billion through the end of the year. COVID-19 continues to impact our business as clients are deferring capital investment decisions and the pandemic has slowed down our ability to fully staff and execute projects. Business Segments The Energy & Chemicals segment reported profit of $95 million in the third quarter of 2020 up from $85 million in the third quarter of 2019. Segment profit for the quarter improved primarily due to increased activity on a liquefied natural gas project and favorable foreign currency transaction gains. New awards were $141 million and backlog is $11.6 billion. The Mining & Industrial segment reported profit of $18 million in the third quarter of 2020 compared to $57 million in the third quarter of 2019. Revenue and segment profit in the quarter decreased due to deferred execution activities on a few large mining projects due to COVID-19. New awards were $268 million including the influenza and antivenom cell culture facility in Australia for Seqirus. Third quarter ending backlog is $4.8 billion. The Infrastructure & Power segment reported profit of $6 million in the third quarter of 2020 compared to $1 million in the third quarter of 2019. Lower margin contributions from certain infrastructure projects for which charges were recognized during 2019 continue to adversely impact near term segment profit margin. In the third quarter, Fluor terminated its contract with the Maryland Department of Transportation for the Purple Line Project and removed the project from its backlog. New awards were $683 million including the Oak Hill Parkway for Texas Department of Transportation. Third quarter ending backlog is $5.6 billion. The Government segment reported profit of $26 million in the third quarter of 2020, up from $22 million in the third quarter of 2019. Results include new awards of $188 million and ending backlog is $3.4 billion. The Diversified Services segment reported a segment profit of $7 million in the third quarter of 2020 compared to $11 million in the third quarter of 2019. Stork divested EQIN, its equipment rental business in Europe, in the third quarter. New awards were $469 million in the quarter and ending backlog is $2.3 billion. The Other segment, which is comprised of NuScale and the Radford and Warren government projects, reported a loss of $23 million in the third quarter of 2020 compared to a loss of $97 million in the third quarter of 2019. NuScale expenses in the third quarter of 2020 were $22 million. Remaining backlog in the segment is $145 million. Discontinued Operations Results from discontinued operations, which includes the held-for-sale AMECO equipment business, were immaterial. During the quarter, Fluor sold its AMECO Jamaica business for $18 million net of working capital and recognized a loss of $1 million. The company expects to complete the sale of the remaining AMECO business within the first half of 2021. Non-GAAP Financial Measures This news release contains a discussion of consolidated segment profit from continuing operations that would be deemed a non-GAAP financial measure under SEC rules. Segment profit is calculated as revenue less cost of revenue and earnings attributable to noncontrolling interests excluding the following: corporate general and administrative expense; impairment, restructuring and other exit costs; interest expense; interest income; domestic and foreign income taxes; other non-operating income and expense items; and earnings from discontinued operations. The company believes that consolidated segment profit from continuing operations provides a meaningful perspective on its business results as it is the aggregation of individual segment profit measures that the company utilizes to evaluate and manage its business performance. A reconciliation of consolidated segment profit from continuing operations to earnings from continuing operations before taxes is included in the press release table. About Fluor Corporation Fluor Corporation (NYSE: FLR) is a global engineering, procurement, fabrication, construction and maintenance company with projects and offices on six continents. Fluor s 45,000 employees build a better world and provide sustainable solutions by designing, building and maintaining safe, well executed projects. Fluor had revenue of $17.3 billion in 2019 and is ranked 181 among the Fortune 500 companies. With headquarters in Irving, Texas, Fluor has served its clients for more than 100 years. For more information, please visit www.fluor.com or follow Fluor on Twitter, LinkedIn, Facebook and YouTube. Forward-Looking Statements: This release may contain forward-looking statements (including without limitation statements to the effect that the Company or its management \"will,\" \"believes,\" \"expects,\" \"plans,\" \"continue\" is \"positioned\" or other similar expressions). These forward-looking statements, including statements relating to strategic and operation plans, future growth, backlog, earnings and the outlook for the company s business, projected cash balances and liquidity are based on current management expectations and involve risks and uncertainties. Actual results may differ materially as a result of a number of factors, including, among other things, the severity and duration of the COVID-19 pandemic and actions by governments, businesses and individuals in response to the pandemic, including the duration and severity of economic disruptions;the cyclical nature of many of the markets the Company serves, including the Company s Energy & Chemicals segment; the Company's failure to receive new contract awards; cost overruns, project delays or other problems arising from project execution activities, including the failure to meet cost and schedule estimates; failure to remediate material weaknesses in our internal controls over financial reporting or the failure to maintain an effective system of internal controls; failure to prepare and timely file our periodic reports; the restatement of certain of our previously issued consolidated financial statements; intense competition in the industries in which we operate; failure to obtain favorable results in existing or future litigation and regulatory proceedings, dispute resolution proceedings or claims, including claims for additional costs; failure of our joint venture or other partners, suppliers or subcontractors to perform their obligations; cyber-security breaches; foreign economic and political uncertainties; client cancellations of, or scope adjustments to, existing contracts; failure to maintain safe worksites and international security risks; risks or uncertainties associated with events outside of our control, including weather conditions, pandemics, public health crises, political crises or other catastrophic events; the use of estimates and assumptions in preparing our financial statements; client delays or defaults in making payments; the failure of our suppliers, subcontractors and other third parties to adequately perform services under our contracts; risks related to our indebtedness; the availability of credit and restrictions imposed by credit facilities, both for the Company and our clients, suppliers, subcontractors or other partners; possible limitations on bonding or letter of credit capacity; failure to successfully implement our strategic and operational initiatives; risks or uncertainties associated with acquisitions, dispositions and investments; risks arising from the inability to successfully integrate acquired businesses; uncertainties, restrictions and regulations impacting our government contracts; the inability to hire and retain qualified personnel; the potential impact of certain tax matters; possible information technology interruptions or inability to protect intellectual property; the Company s failure, or the failure of our agents or partners, to comply with laws; the Company's ability to secure appropriate insurance; new or changing legal requirements, including those relating to climate change and environmental, health and safety matters; liabilities associated with the performance of nuclear services; foreign currency risks; the loss of one or a few clients that account for a significant portion of the Company's revenues; damage to our reputation; failure to adequately protect intellectual property rights; asset impairments; and restrictions on possible transactions imposed by our charter documents, Delaware law and our stockholder rights agreement. Caution must be exercised in relying on these and other forward-looking statements. Due to known and unknown risks, the Company s results may differ materially from its expectations and projections. Additional information concerning these and other factors can be found in the Company's public periodic filings with the Securities and Exchange Commission, including the discussion under the heading \"Item 1A. Risk Factors\" in the Company's Form 10-K filed on September 25, 2020. Such filings are available either publicly or upon request from Fluor's Investor Relations Department: (469) 398-7222. The Company disclaims any intent or obligation other than as required by law to update its forward-looking statements in light of new information or future events. SUMMARY FINANCIALS AND U.S. GAAP RECONCILIATION OF CONSOLIDATED SEGMENT PROFIT Three Months Ended September 30, Nine Months Ended September 30, (in millions) 2020 2019 2020 2019 Revenue Energy & Chemicals $ 1,336.0 $ 1,611.6 $ 4,187.4 $ 4,485.2 Mining & Industrial 920.9 1,374.0 3,107.8 3,703.6 Infrastructure & Power 386.5 392.5 1,247.1 965.9 Government 753.7 718.2 2,173.2 2,196.2 Diversified Services 370.3 521.7 1,210.3 1,525.0 Other 35.8 10.6 87.0 32.7 Revenue $ 3,803.2 $ 4,628.6 $ 12,012.8 $ 12,908.6 Segment profit (loss) $ and margin % Energy & Chemicals $ 94.9 7.1 % $ 84.7 5.3 % $ 129.4 3.1 % $ (125.1 ) (2.8 )% Mining & Industrial 18.2 2.0 % 56.9 4.1 % 86.7 2.8 % 129.1 3.5 % Infrastructure & Power 6.4 1.7 % 0.9 0.2 % 15.1 1.2 % (188.0 ) (19.5 )% Government 25.7 3.4 % 22.4 3.1 % 67.1 3.1 % 87.2 4.0 % Diversified Services 7.1 1.9 % 10.5 2.0 % 7.4 0.6 % 22.2 1.5 % Other (22.9 ) (64.0 )% (96.6 ) NM (63.7 ) (73.2 )% (200.2 ) NM Total segment profit (loss) $ and margin % (1) $ 129.4 3.4 % $ 78.8 1.7 % $ 242.0 2.0 % $ (274.8 ) (2.1 )% Corporate G&A (68.1 ) (11.2 ) (93.8 ) (119.7 ) Impairment, restructuring and other exit costs (334.0 ) (302.7 ) (388.0 ) Interest expense, net (13.4 ) (4.9 ) (31.3 ) (14.7 ) Earnings (loss) attributable to NCI from Cont Ops 4.3 12.5 20.5 (2.4 ) Earnings (loss) from Cont Ops before taxes 52.2 (258.8 ) (165.3 ) (799.6 ) Income tax expense (benefit) 28.8 495.3 (6.9 ) 434.8 Net earnings (loss) from Cont Ops $ 23.4 $ (754.1 ) $ (158.4 ) $ (1,234.4 ) New awards Energy & Chemicals $ 141.2 $ 256.3 1,880.8 1,990.7 Mining & Industrial 268.2 118.8 2,598.0 1,335.5 Infrastructure & Power 682.6 1,992.7 751.2 2,542.2 Government 187.8 1,130.1 1,813.1 1,853.5 Diversified Services 468.5 259.8 1,087.4 1,643.4 Other 0.5 152.1 Total new awards $ 1,748.3 $ 3,758.2 $ 8,130.5 $ 9,517.4 New awards related to projects located outside of the U.S. 54% 40% (1) Total segment profit (loss) is a non-GAAP financial measure. We believe that total segment profit (loss) provides a meaningful perspective on our results as it is the aggregation of individual segment profit (loss) measures that we use to evaluate and manage our performance. Backlog September 30, 2020 December 31, 2019 Energy & Chemicals $ 11,609.2 $ 14,128.9 Mining & Industrial 4,777.6 5,383.9 Infrastructure & Power 5,577.7 6,079.4 Government 3,353.4 3,556.1 Diversified Services 2,311.1 2,541.6 Other 145.2 244.0 Total backlog $ 27,774.2 $ 31,933.9 Backlog related to projects located outside of the U.S. 63% 67% Backlog related to lump-sum projects 53% 52% #corp View source version on businesswire.com: https:\/\/www.businesswire.com\/news\/home\/20201210005113\/en\/ Brian Mershon Media Relations 469.398.7621 tel Jason Landkamer Investor Relations 469.398.7222 tel Source: Fluor Corporation","6":"IRVING, Texas--(BUSINESS WIRE)--Fluor Corporation (NYSE: FLR) announced today that its joint venture COOEC-Fluor Heavy Industries, Co., Ltd. (COOEC-Fluor) fabrication yard in Zhuhai, China, has safely completed the entire module program for the Kuwait Integrated Petroleum Industries Company (KIPIC) Al-Zour project in Kuwait. The COOEC-Fluor yard completed the modular program over a period of 24 months from the start of steel fabrication to load out of the last modules, said Chris Vertanness, vice president and director of operations at the yard. The COOEC-Fluor team has accomplished numerous fabrication and logistics milestones on this project working closely with the Fluor-led joint venture team, and I look forward to continuing to show the world what our yard can do. To achieve this milestone, COOEC-Fluor delivered 188 modules in 20 separate shipments with a combined weight of 65,000 metric tons. In addition, the yard fabricated more than 95,000 pipe spools of carbon, alloy and stainless steel pipe which will be installed by the project team at the site. Leveraging COOEC-Fluor for fabrication and modular assembly was a key component in the KIPIC project s overall execution strategy. By performing large-scale modularization at the fabrication yard, field labor at the project site was significantly reduced resulting in greater cost efficiency, enhanced safety performance, and minimized strain on the local labor market. The project was executed with a relentless focus on health, safety and environmental performance, achieving a total case incident rate of 0.06 and a lost-time injury rate of 0.02. The final module shipment of 8,600 metric tons was shipped from COOEC-Fluor and recently arrived at the project site in Kuwait. Fluor is leading a joint venture that is working to deliver two engineering, procurement, fabrication and construction packages for key process support units, utilities and infrastructure for the Al-Zour refinery project in Kuwait. Upon completion, the new complex is expected to be one of the largest refineries in the world and produce 615,000 barrels of oil per day. About Fluor Corporation Founded in 1912, Fluor Corporation (NYSE: FLR) is a global engineering, procurement, fabrication, construction and maintenance company that transforms the world by building prosperity and empowering progress. Fluor serves its clients by designing, building and maintaining safe, well executed, capital-efficient projects around the world. With headquarters in Irving, Texas, Fluor ranks 164 on the Fortune 500 list with revenue of $19.2 billion in 2018 and has more than 53,000 employees worldwide. For more information, please visit www.fluor.com or follow Fluor on Facebook, Twitter, LinkedIn and YouTube. Brian Mershon Media Relations 469.398.7621 Jason Landkamer Investor Relations 469.398.7222","7":"Largest highway project in Arizona s history IRVING, Texas & PHOENIX--(BUSINESS WIRE)--Fluor Corporation (NYSE: FLR) announced today that its joint venture team has opened the Loop 202 South Mountain Freeway in Phoenix for the Arizona Department of Transportation (ADOT). Located in the Phoenix metropolitan area, it is the largest highway project in the state s history and the first freeway project procured under Arizona s public-private-partnership statute. It is also ADOT s first design-build-maintain project. The completion of this project on-time is a clear demonstration of our ability to successfully execute complex road and bridge projects, said Terry Towle, group president of Fluor s Infrastructure & Power business. Not only will it lead to a more prosperous area around the highway, but it will increase the connectivity for commuters for generations to come. The Loop 202 South Mountain Freeway Project comprises 42 bridges and 22 miles of improved mobility via four lanes in each direction three general-use lanes and one High-Occupancy Vehicle (HOV) lane and includes modern features such as rubberized asphalt and aesthetics that reflect nearby communities. The project also includes a freeway-to-freeway interchange, including approximately five miles of tie-in work on I-10 Papago Freeway. Construction began in 2016 and the project has achieved more than 5.5 million work hours without a lost time incident. Working in partnership with ADOT over the last three and half years, we have achieved our goal of providing Arizona with a safe, innovative, cost-effective and much needed connection that will help alleviate traffic congestion and improve the safety and operational efficiency for drivers throughout the Phoenix-metro area, said Walter J. Lewis, III, project director for Fluor and Connect 202 Partners, LLC. The Fluor-led joint venture consortium, Connect 202 Partners, is a design-build and maintenance partnership of Fluor Enterprises Inc., Granite Construction Co., and Ames Construction Inc. WSP Inc. is lead designer. Connect 202 Partners has been recognized for its commitment to diversity by the Arizona Million Dollar Circle of Excellence and by the Women in Transportation Rosa Parks Diversity Leadership Award for exceeding its requirement to award more than $100 million to Disadvantaged Business Enterprises during the life of the project. The project was funded by a combination of Regional Area Road Fund revenues, Highway User Revenue Fund revenues and federal funds dedicated to the Maricopa County region and ADOT. ADOT funded the project s capital costs with a combination of available public funds from sales tax revenues and tax-exempt bonds. Fluor will maintain the project for 30 years with oversight from ADOT. About Fluor Corporation Founded in 1912, Fluor Corporation (NYSE: FLR) is a global engineering, procurement, fabrication, construction and maintenance company that transforms the world by building prosperity and empowering progress. Fluor serves its clients by designing, building and maintaining safe, well executed, capital-efficient projects around the world. With headquarters in Irving, Texas, Fluor ranks 164 on the Fortune 500 list with revenue of $19.2 billion in 2018 and has more than 53,000 employees worldwide. For more information, please visit www.fluor.com or follow Fluor on Facebook, Twitter, LinkedIn and YouTube. Brian Mershon Media Relations 469.398.7621 Jason Landkamer Investor Relations 469.398.7222","8":"Fluor to design and build Chicago Transit Authority s largest capital project in history IRVING, Texas--(BUSINESS WIRE)--Fluor Corporation (NYSE: FLR) announced today that the joint venture team of Walsh Construction Company and Fluor has been selected as the preferred partner to design and build Phase One of the Red and Purple Line Modernization Program for the Chicago Transit Authority (CTA). The $2.1 billion project will be the largest capital project in CTA s history, ultimately resulting in expanded capacity and improved infrastructure along the region s most used rail lines. Fluor plans to book its share of the undisclosed design and construction contract value in the first quarter of 2019. Fluor is pleased to have been selected by the CTA to deliver this massive project on the nearly century-old Red and Purple Lines, said Terence Easton, president of Fluor s infrastructure business. When complete, this project will help build prosperity and empower progress for the region as well as improve transit for the citizens of Chicago. This selection further solidifies Fluor s industry-leading expertise in North America as a frontrunner in transit projects and the delivery of infrastructure megaprojects. Fluor and Walsh, along with the team s designer Stantec Consulting Services, will bring decades of industry megaproject and transit experience to this massive program that will deliver state-of-the-art services, improved quality, safety and reliability, and an upgraded customer experience to the users of the Red and Purple Lines. The project includes designing and building new elevated tracks along a 1.9 mile section in Chicago including new bridges, support structures and existing tracks; upgrading 3.2 miles of the signal system; construction of a grade-separated bypass for the Brown Line at Clark Junction that will result in improved mobility, and replacing four of the CTA s busiest stations. The project will begin in the first quarter of 2019 and is scheduled to be completed in early 2025. About Fluor Corporation Founded in 1912, Fluor Corporation (NYSE: FLR) is a global engineering, procurement, fabrication, construction and maintenance company that transforms the world by building prosperity and empowering progress. Fluor serves its clients by designing, building and maintaining safe, well executed, capital-efficient projects around the world. With headquarters in Irving, Texas, Fluor ranks 153 on the Fortune 500 list with revenue of $19.5 billion in 2017 and has more than 56,000 employees worldwide. For more information, please visit www.fluor.com or follow Fluor on Facebook, Twitter, LinkedIn and YouTube. Brian Mershon\/Brett TurnerMedia Relations469.398.7621\/864.281.6976 Jason LandkamerInvestor Relations469.398.7222","9":"IRVING, Texas--(BUSINESS WIRE)--Fluor Corporation (NYSE: FLR) announced today that ioneer Ltd. has selected Fluor to deliver its lithium and boron mine outside of Tonopah, Nevada. Fluor will initially provide a definitive feasibility study, and subsequently, engineering, procurement and construction management (EPCM) services as the project progresses. Fluor will book the feasibility study contract value in the fourth quarter of 2018 and expects to book the full EPCM contract value in 2019 dependent on a final investment decision. With the growing demand for electric vehicles and energy storage, Fluor is excited to work with ioneer on our first lithium mine project in Nevada, said Tony Morgan, president of Fluor s Mining & Metals business. Our team brings the right combination of technical and execution expertise. We will leverage our full suite of integrated solutions tools, including our Zero Base ExecutionSM process and fit-for-purpose modular design strategy, to develop an execution approach to deliver this project safely and with excellence. The mine will extract and process ore to produce 20,200 tons of lithium carbonate and 173,000 tons of boric acid, annually. Lithium is a key component in batteries used for electric vehicles, power tools, drones and other items. Boron is widely used in the glass industry to strengthen and increase heat resistance for glass cookware, laboratory glassware and glass screens used in mobile phones, tablets and liquid crystal display televisions. Boron is also used in fiberglass, insulation, electronics and as a micronutrient in agriculture. The full notice to proceed on the EPCM phase is expected in 2019 with first production expected in 2021. About Fluor Corporation Founded in 1912, Fluor Corporation (NYSE: FLR) is a global engineering, procurement, fabrication, construction and maintenance company that transforms the world by building prosperity and empowering progress. Fluor serves its clients by designing, building and maintaining safe, well executed, capital-efficient projects around the world. With headquarters in Irving, Texas, Fluor ranks 153 on the Fortune 500 list with revenue of $19.5 billion in 2017 and has more than 56,000 employees worldwide. For more information, please visit www.fluor.com or follow Fluor on Facebook, Twitter, LinkedIn and YouTube. Brian Mershon\/Brett TurnerMedia Relations469.398.7621\/864.281.6976 Jason LandkamerInvestor Relations469.398.7222","10":"Fluor Corporation (NYSE: FLR) confirmed today that the company, working under its contract with the U.S. Army Corps of Engineers (USACE) in support of a Federal Emergency Management Agency (FEMA) mission to help repair and restore the power grid in Puerto Rico, has completed work on portions of three priority 38kv power lines in large urban areas near San Juan and a fourth priority 38kv line near Caguas. The completion allows the Puerto Rico Electric Power Authority (PREPA) to re-energize lines in Rio Piedras, Caguas and Minillas, as well as lines that run from Can vanas to Palmer. These lines will carry electricity to a pharmaceutical manufacturing facility in Caguas, schools, residential neighborhoods and several busy commercial districts. Every day, our crews go to their work sites knowing that what they are doing is vitally important to the people of Puerto Rico, said Matt Hunt, Fluor s executive program director, Puerto Rico Power Restoration Project. We work in close coordination with PREPA and the Corps to make progress every day, and we have brought additional resources to the island to ensure we complete our job as safely, quickly and as efficiently as possible. Fluor has more than 1,600 people on the island dedicated to the restoration of power. The company has purchased more than $37 million in goods and services from over 60 local subcontractors and vendors. Fluor has a unique combination of government contingency operations, commercial power experience and a 54-year presence in the Commonwealth. The company provides design, engineering, procurement, construction and commissioning services to Puerto Rican clients in a broad range of high employment industries, including power, pharmaceuticals, biotechnology, aerospace, manufacturing and food and beverage. This expertise will enable ongoing efforts to help sustain economic recovery on the island. About Fluor Corporation Fluor Corporation (NYSE: FLR) is a global engineering, procurement, fabrication, construction and maintenance company that designs, builds and maintains capital-efficient facilities for its clients on six continents. For more than a century, Fluor has served its clients by delivering innovative and integrated solutions across the globe. With headquarters in Irving, Texas, Fluor ranks 149 on the Fortune 500 list with revenue of $19 billion in 2016 and has more than 60,000 employees worldwide. For more information, please visit www.fluor.com or follow Fluor on social media at Facebook, Twitter, LinkedIn and YouTube. Fluor CorporationMedia Relations:Brian Mershon, 469-398-7621orBrett Turner, 864-281-6976orInvestor Relations:Geoff Telfer, 469-398-7070orJason Landkamer, 469-398-7222","11":"Fluor Corporation (NYSE: FLR) announced today that the Federal Emergency Management Agency (FEMA) has selected Fluor to provide recovery services to Zone 1 of the Public Assistance Division s Technical Assistance Contracts IV (PA-TAC IV). This is part of a new approach by FEMA to align PA-TAC IV contractors with one of three geographical zones to more effectively provide resource support. The Fluor contract includes the zone that extends from along the Atlantic Coast to the Gulf Coast including 19 states and the District of Columbia. The contract has a five-year period of performance and is valued at $610 million. From tornadoes in Kansas, river floods in North Dakota, earthquakes and flooding in California and hurricanes all along the U.S. Gulf Coast, Fluor has worked closely with FEMA for 20 years to provide assistance in disaster-stricken locations, said Tom D Agostino, president of Fluor Government Group. Today, Fluor is on the ground supporting FEMA in Texas and Florida with recovery efforts from hurricanes Harvey and Maria, and in California where the state is recovering from record flooding. This is exactly the kind of work Fluor does well delivering innovative and integrated solutions that meet the needs of disaster victims in a timely manner. With this contract, we stand ready to continue our work with FEMA and to help those in need in the future. As one of three contractors selected to work on the PA-TAC IV indefinite delivery\/indefinite quantity contract, Fluor is responsible for the resource requirements for major disasters and emergencies declared within Zone 1. The PA-TAC IV contract was issued under the Public Assistance Program, as authorized under the Robert T. Stafford Disaster Relief and Emergency Assistance Act. Through this program, FEMA provides supplemental federal disaster grant assistance for debris removal, emergency protective measures, and the repair, replacement and restoration of disaster-damaged, publicly-owned facilities and the facilities of certain private nonprofit organizations. The Public Assistance Program also encourages protection of these damaged facilities from future events by providing assistance for hazard mitigation measures during the recovery process. About Fluor Corporation Fluor Corporation (NYSE: FLR) is a global engineering, procurement, fabrication, construction and maintenance company that designs, builds and maintains capital-efficient facilities for its clients on six continents. For more than a century, Fluor has served its clients by delivering innovative and integrated solutions across the globe. With headquarters in Irving, Texas, Fluor ranks 149 on the Fortune 500 list with revenue of $19 billion in 2016 and has more than 60,000 employees worldwide. For more information, please visit www.fluor.com or follow Fluor on social media at Facebook, Twitter, LinkedIn and YouTube. Fluor CorporationMedia RelationsBrian Mershon, 469-398-7621orBrett Turner, 864-281-6976orInvestor RelationsGeoff Telfer, 469-398-7070orJason Landkamer, 469-398-7222","12":"Fluor Corporation (NYSE: FLR) has been awarded an engineering, procurement, construction and construction management contract by Novo Nordisk for its new $2 billion diabetes Active Pharmaceutical Ingredient (API) manufacturing facility in Clayton, North Carolina. Fluor has been providing basic design services since Novo Nordisk announced plans for the new facility in August 2015 and now will be executing the full scope of work. Fluor booked its $1.2 billion value of the investment in the fourth quarter of 2016. Fluor is honored to have the opportunity to assist Novo Nordisk in building this world-class facility in North Carolina to provide modern treatments to diabetes patients, said Juan G. Hern ndez, president of Fluor s Life Sciences and Advanced Manufacturing business. This project is the single largest life sciences facility investment in North Carolina s history, which fits well with Fluor s legacy of building numerous significant life sciences and manufacturing projects in the southeast United States. Novo Nordisk selected Fluor for this critical project, the largest in our history, based on their strong safety culture, technical competence in the life sciences industry and ability to deliver the full scope of work, said Morten Nielsen, senior vice president, Novo Nordisk, and responsible for the construction of the new facility. We look forward to continued strong cooperation for the success of this project. The new facility will measure more than 830,000 square feet, the equivalent of nearly seven football fields, and will produce life-saving medicines for use by patients around the world. Nearly 2,500 craft employees and subcontractor jobs are expected at peak construction with about 700 new jobs at the facility when it is completed. Fluor participated in a groundbreaking event this past spring, and its Greenville, South Carolina office is leading the project, leveraging Fluor s global resources as needed. Construction is expected to be completed in mid-2019. Fluor s unique integrated solutions model will enable the company to leverage its global expertise across business lines such as power generation, as well as its staffing and construction equipment entities, water expertise and others for this project. About Fluor Corporation Fluor Corporation (NYSE: FLR) is a global engineering, procurement, fabrication, construction and maintenance company that designs, builds and maintains capital-efficient facilities for its clients on six continents. For more than a century, Fluor has served our clients by delivering innovative and integrated solutions across the globe. With headquarters in Irving, Texas, Fluor ranks 155 on the FORTUNE 500 list with revenue of $18.1 billion in 2015 and has more than 60,000 employees worldwide. For more information, please visit www.fluor.com or follow us on Twitter @FluorCorp. About Novo Nordisk Novo Nordisk is a global healthcare company with more than 90 years of innovation and leadership in diabetes care. Headquartered in Denmark, Novo Nordisk employs approximately 42,000 people in 75 countries and markets its products in more than 180 countries. For more information, visit novonordisk.com. Fluor CorporationMedia Relations:Brian Mershon, 469-398-7621Brett Turner, 864-281-6976orInvestor Relations:Geoff Telfer, 469-398-7070Jason Landkamer, 469-398-7222","13":"Largest Bridge Project in New York s History Fluor Corporation (NYSE: FLR) announced today that Tappan Zee Constructors, LLC, comprised of Fluor Enterprises, Inc., American Bridge Company, Granite Construction Northeast, Inc., and Traylor Bros., Inc., has completed all eight 419-foot towers of the iconic New NY Tappan Zee Bridge project. Construction of the eight sleek, chamfered-designed concrete towers four on both the eastbound and westbound spans began in the late summer of 2015. The towers will support the 2,230-foot cable-stayed main span. The Fluor-led project team will install a total of 192 stay cables ranging in length from 190 feet to 623 feet. Installation began in July 2016 with more than 60 stay cables anchored and tensioned to date. We are making incredible progress on one of the largest and safest construction projects in the country, said Terry Towle, Fluor s senior vice president and president of Tappan Zee Constructors, LLC. This is an exceptionally challenging project. Everything is being done on a huge scale under extreme conditions and on tight timeframes. I am proud of the tremendous team we have working day and night keeping this project on track. Together we are building an iconic bridge that will serve this community for generations. The 3.1-mile twin span cable-stayed bridge is the single largest bridge construction project in New York s history. The bridge will replace the existing Governor Malcolm Wilson Tappan Zee Toll Bridge that connects Rockland County to Westchester County over the Hudson River. Construction is scheduled for completion in 2018. About Fluor Corporation Fluor Corporation (NYSE: FLR) is a global engineering, procurement, fabrication, construction and maintenance company that designs, builds and maintains capital-efficient facilities for its clients on six continents. For more than a century, Fluor has served our clients by delivering innovative and integrated solutions across the globe. With headquarters in Irving, Texas, Fluor ranks 155 on the FORTUNE 500 list with revenue of $18.1 billion in 2015 and has more than 60,000 employees worldwide. For more information, please visit www.fluor.com or follow us on Twitter @FluorCorp. Fluor CorporationGlobal Media RelationsBrian Mershon, 469-398-7621orBrett Turner, 864-281-6976orInvestor RelationsGeoff Telfer, 469-398-7070orJason Landkamer, 469-398-7222","14":"Creating a global leader in industrial services broadening geographic coverage Expanding services scope throughout the full lifecycle of operating plants Fluor s Operations & Maintenance organization to be combined with Stork Combined group branded Stork and headquartered in the Netherlands Fluor Corporation (NYSE: FLR) and Stork announced today that Fluor has signed an agreement with UK-based private equity firm Arle Capital Partners to acquire 100 percent of Stork Holding B.V., based in the Netherlands, for an investment of 695 million ($755 million). Stork is a global provider of maintenance, modification and asset integrity services associated with large existing industrial facilities in the oil and gas, chemicals, petrochemicals, industrial and power markets. Founded in 1827, Stork has built a powerful brand in the industry and has long-term relationships with a diverse range of blue chip customers. It has operations in Continental Europe, United Kingdom, the Middle East, Asia Pacific and the Americas, with an annualized run-rate revenue of approximately 1.6 billion ($1.7 billion) and EBITDA of approximately 100 million ($109 million), implying a transaction multiple of just under seven times EBITDA. The acquisition of Stork is consistent with Fluor s goal to further enhance our integrated solutions capabilities in thoughtful, strategic ways that will increase the value we deliver to our clients and shareholders, said Fluor s Chairman and CEO David Seaton. We are pleased to welcome Stork s talented workforce of more than 15,000 employees, which will provide us with additional flexibility and capacity to increase our maintenance and direct construction activities. Stork is highly complementary to Fluor as it gives both businesses the opportunity to market diverse services and capabilities to new customers and across new geographies. Stork s business is largely driven by ongoing operating budgets and is therefore less impacted by volatile commodity prices. In addition, Stork s continuous site presence will help us improve our ability to meet our customers needs throughout the full lifecycle of an operating plant, and provide Fluor with an ongoing earnings stream and robust growth opportunities, Seaton added. According to current Stork CEO Arnold Steenbakker, We are very proud that a world-class company like Fluor recognizes Stork s strong reputation, capable workforce and performance as a global industrial services provider. The combination will create new opportunities to expand our global footprint and deepen the product and services offering to our customers. Stork s activities are complementary to those of Fluor and the combination will create a global leader in the industrial services business. Upon closing of the acquisition, Fluor will begin combining Fluor s Operations & Maintenance organization with Stork. Current Stork CEO, Arnold Steenbakker, will lead the combined group and report directly to Fluor s CEO, David Seaton. The management team will be formed by Stork s existing management combined with the managers of Fluor s Operations & Maintenance business. The combined group, branded Stork and headquartered in the Netherlands, will have an annual turnover of approximately 2.1 billion ($2.3 billion) and a total of approximately 19,000 employees. The acquisition is expected to be accretive to Fluor s earnings per share in 2016. Fluor expects to achieve significant synergies including increased revenues from cross-selling and expansion into new markets. The transaction multiple would be under six times Stork s EBITDA including run-rate revenue synergies. Fluor intends to fully finance the cash required for the transaction through the issuance of debt in international markets. The acquisition is expected to close in the first half of 2016 and is subject to regulatory approvals and consultation procedures with Stork s work council. Goldman Sachs acted as exclusive financial adviser to Fluor. About Stork Stork offers services and products associated with maintenance, modifications and assurance of asset integrity of production facilities. The company delivers technical support that spans the asset lifecycles of its customers operations. From concept through to execution, Stork aims to reduce risk, assure safety and improve asset performance for its customers to enhance their profits. With more than 15,000 employees worldwide (Middle East, Asia, Europe, Africa and the Americas), Stork provides innovative solutions in the areas of asset integrity, maintenance, modifications, consultancy, inspections, repair, renovations, relocations and other related complex projects in the oil and gas, chemicals, petrochemicals, industrial and power markets. About Fluor Corporation Fluor Corporation (NYSE: FLR) is a global engineering and construction firm that designs and builds some of the world's most complex projects. The company creates and delivers innovative and integrated solutions for its clients in engineering, procurement, fabrication, construction, maintenance and project management on a global basis. For more than a century, Fluor has served clients in the energy, chemicals, government, industrial, infrastructure, mining and power market sectors. Headquartered in Irving, Texas, Fluor ranks 136 on the FORTUNE 500 list. With 40,000 employees worldwide, the company's revenue for 2014 was $21.5 billion. For more information, visit www.fluor.com or follow on Twitter @FluorCorp. Forward-Looking Statements: This release contains forward-looking statements (including without limitation statements using words such as \"believes,\" \"expects,\" intends, \"anticipates,\" will, \"plans,\" goals or other similar expressions) with respect to the acquisition of Stork. These forward-looking statements can be identified by the fact that they do not relate only to historical or current facts. Such forward-looking statements include, but are not limited to, statements about the benefits of the transaction, including anticipated future financial and operating results; synergies, accretion and growth rates; the Company s plans with regard to Stork s future operations, plans and objectives; the expected timing of completion of the transaction; and the Company s plans to finance the transaction. Actual plans and results may differ materially as a result of a number of factors, including, among other things, failure to realize the expected benefits and synergies of the transaction; general economic and business conditions that affect the Company or Stork following the transaction; significant unknown Stork liabilities; changes in global, political, economic, business, competitive, market and regulatory forces; changes in tax and other laws, regulations, and policies; the loss of key senior management of Stork; the availability of international debt at favorable rates; and the delay or failure to receive regulatory approvals. Caution must be exercised in relying on these and other forward-looking statements. Due to known and unknown risks, the Company s plans with regard to Stork and actual results may differ materially from its expectations and projections. Additional information concerning risks and other uncertainties can be found in the Company's public periodic filings with the Securities and Exchange Commission, including the discussion under the heading \"Item 1A. Risk Factors\" in the Company's Form 10-K filed on February 18, 2015. Such filings are available either publicly or upon request from Fluor's Investor Relations Department: (469) 398-7070. The Company disclaims any intent or obligation other than as required by law to update its forward-looking statements in light of new information or future events. Fluor CorporationMedia RelationsLisa Bottle, +1-469-816-2983orJanet Kearns, +44 7802 373466orInvestor RelationsGeoff Telfer, +1-469-398-7070orJason Landkamer, +1-469-398-7222orStork Holding B.V.Media RelationsBeatrijs van de Ven, +31 (0) 6 51 566 513","15":"Fluor Corporation (NYSE: FLR) announced today that the Information Commissioner s Office (ICO) of the United Kingdom has formally approved Fluor s Binding Corporate Rules for handling of employee and client data. The data protection authorities in other European Union member states have accepted the approval under a mutual recognition procedure, and Fluor will seek approval in certain other member states as well. Under European Union law, the transfer of personal information to non-European Union countries is only permitted where appropriate systems and safeguards have been put in place. Adoption of Binding Corporate Rules is one way in which organizations can satisfy these requirements. The ICO approval indicates that Fluor meets the high standards required under European Union law when it transfers personal information among Fluor entities globally. The approval process involved a detailed analysis of the data protection safeguards in place within Fluor, and was led by the ICO in conjunction with data protection authorities in Spain and Poland. This approval represents a significant achievement for Fluor, said David Seaton, chairman and CEO of Fluor. It demonstrates Fluor s continued commitment to the welfare of its employees and clients through top notch data privacy and security, and reinforces Fluor s leadership role in the areas of ethics and compliance. Data privacy and security will continue to be at the heart of Fluor's business practices, as we strive to maintain this leadership in a rapidly evolving technology landscape. As one of the world s foremost engineering, procurement, construction, fabrication, maintenance and project management companies, we recognize that information management is a key aspect of the services we provide. Safe and sound information management in this day and age just makes good business sense especially for a global company like Fluor. About Fluor Corporation Fluor Corporation (NYSE: FLR) is a global engineering and construction firm that designs and builds some of the world's most complex projects. The company creates and delivers innovative and integrated solutions for its clients in engineering, procurement, fabrication, construction, maintenance and project management on a global basis. For more than a century, Fluor has served clients in the energy, chemicals, government, industrial, infrastructure, mining and power market sectors. Headquartered in Irving, Texas, Fluor ranks 136 on the FORTUNE 500 list. With 40,000 employees worldwide, the company's revenue for 2014 was $21.5 billion. For more information, visit www.fluor.com or follow us on Twitter @FluorCorp. Fluor CorporationMedia RelationsBrian Mershon, 469-398-7621orBrett Turner, 864-281-6976orInvestor RelationsGeoff Telfer, 469-398-7070orJason Landkamer, 469-398-7222","16":"Fluor Corporation (NYSE: FLR) announced that AMECO, its tool and equipment unit, celebrated the grand opening of its new global headquarters today in Greenville, South Carolina. Fluor designed and engineered the new LEED-certified space that features collaborative working space and the latest technology. Senior executives from Fluor and AMECO and elected officials and employees attended the celebration of the new headquarters. AMECO s expertise in tools and equipment for large construction projects is an integral part of Fluor s construction offerings and is just one visible element of Fluor s commitment to increasing its self-perform construction work, said Garry Flowers, president of AMECO and head of Project Support Services for Fluor. With the demand for AMECO s capabilities and services, it was apparent just how much AMECO had outgrown the capacity of the old building, which had been used for 20 years as a multipurpose facility, said Tracey Cook, AMECO s vice president of Global Operations. By consolidating AMECO's staff resources into one building in one location, we are better able to effectively and efficiently execute project work no matter where it is located throughout the world. With AMECO s deep roots in Greenville, the company elected to construct its new facility on the grounds of the property that has housed AMECO operations for nearly 40 years and is familiar to customers, suppliers and contractors. About AMECO AMECO, a unit of Fluor Corporation, is a leader in integrated mobile equipment and tool solutions and has provided a wide range of services to construction, mining, government and industrial markets across the globe for more than 65 years. The company is focused on three primary businesses operations fleet services, construction site services and equipment distribution. Headquartered in Greenville, South Carolina, AMECO has office locations throughout the Americas and South Africa, as well as project locations all over the globe. For more information, visit www.ameco.com. About Fluor Corporation Fluor Corporation (NYSE: FLR) is a global engineering and construction firm that designs and builds some of the world's most complex projects. The company creates and delivers innovative solutions for its clients in engineering, procurement, fabrication, construction, maintenance, and project management on a global basis. For more than a century, Fluor has served clients in the energy, chemicals, government, industrial, infrastructure, mining and power market sectors. Headquartered in Irving, Texas, Fluor ranks 109 on the FORTUNE 500 list. With more than 40,000 employees worldwide, the company's revenue for 2013 was $27.4 billion. Visit Fluor at www.fluor.com and follow on Twitter @FluorCorp. Fluor CorporationMedia RelationsBrian Mershon, 469-398-7621orEric Krantz, 281-263-6030orInvestor RelationsGeoff Telfer, 469-398-7070orJason Landkamer, 469-398-7222","17":"Fluor Corporation (NYSE: FLR) has started construction activities on a new delayed coker unit for ExxonMobil Petroleum & Chemical BVBA (ExxonMobil) at its Antwerp, Belgian refinery. Construction on the project, which will expand the refinery s production capabilities, formally kicked off at a groundbreaking ceremony in October. Fluor s responsibilities span the project s life cycle and include design, engineering, procurement, module fabrication, transportation, installation and construction. Fluor is responsible for the new delayed coker unit that will convert heavy, higher sulfur residual oils into transportation fuel products such as marine gasoil and diesel fuel. Fluor will provide our full suite of engineering, procurement and construction services on this lump-sum refinery expansion project for the European downstream market, said Taco de Haan, president of Fluor s Energy & Chemicals business for the Europe, Africa and the Middle East region. We are applying our modular execution and construction innovations in order to deliver schedule and capital efficiencies through an integrated solution to ExxonMobil. Engineering and design work for the project began in June 2014 and is being led by Fluor s office in the Netherlands. Fluor booked the project into backlog for an undisclosed value earlier in 2014. About Fluor Corporation Fluor Corporation (NYSE: FLR) is a global engineering and construction firm that designs and builds some of the world's most complex projects. The company creates and delivers innovative solutions for its clients in engineering, procurement, fabrication, construction, maintenance and project management on a global basis. For more than a century, Fluor has served clients in the energy, chemicals, government, industrial, infrastructure, mining and power market sectors. Headquartered in Irving, Texas, Fluor ranks 109 on the FORTUNE 500 list. With more than 40,000 employees worldwide, the company's revenue for 2013 was $27.4 billion. Visit Fluor at www.fluor.com and follow on Twitter @FluorCorp. Fluor CorporationMedia RelationsBrian Mershon, 469-398-7621orEric Krantz, 281-263-6030orInvestor RelationsGeoff Telfer, 469-398-7070orJason Landkamer, 469-398-7222","18":"IRVING, Texas & FARNBOROUGH, United Kingdom--(BUSINESS WIRE)--Fluor Corporation today announced that it was selected by Kuwait Oil Company (KOC), a subsidiary of Kuwait Petroleum Corporation (KPC), to provide comprehensive consulting services, specializing in front-end design and project and construction management in support of KOC s capital expenditure program for Kuwait. This award follows 10 years of successful Fluor support to KOC. The value of the five-year contract is $410 million and will be booked in Fluor s fourth quarter. The services related to the construction of new facilities and upgrading of existing facilities are broad based, and include project management, coordination, planning, front-end design, engineering, contracting, procurement, project controls, construction management and training of KOC project staff. Services will be performed at KOC headquarters in Ahmadi, Kuwait, with front-end design packages executed in Fluor s Farnborough, U.K., office. Fluor has supported clients and executed Middle East projects for more than 50 years, said Peter Oosterveer, president of Fluor's Energy & Chemicals Group. During that time we have developed a strong relationship with KOC by partnering with them and offering support with project development and management for its capital spending program. This new agreement strengthens that partnership and we are excited to provide our continued expertise to their projects. KOC is a wholly-owned subsidiary of KPC, which is the government-owned entity responsible for Kuwait's hydrocarbon interests throughout the world. As part of the global energy industry, KPC helps to supply the world with vital oil and gas resources through the exploration, production, refining, transporting and marketing of crude oil and products in Kuwait and internationally. About Fluor Corporation For more than 100 years, Fluor Corporation (NYSE: FLR) has partnered with its clients to design, build and maintain many of the world's most challenging and complex capital projects. Through its global network of offices on six continents, more than 41,000 employees provide comprehensive capabilities and world-class expertise in the fields of engineering, procurement, construction, commissioning, fabrication, operations, maintenance and project management. Today, the company serves a global client base in the energy, chemicals, government, industrial, infrastructure, operations & maintenance, manufacturing & life sciences, mining, power and transportation sectors. Headquartered in Irving, Texas, Fluor ranks 110 on the FORTUNE 500 list and had revenue of $27.6 billion in 2012. For more information, visit www.fluor.com and follow us on Twitter at @FluorCorp. Photos\/Multimedia Gallery Available: http:\/\/www.businesswire.com\/multimedia\/home\/20131230005326\/en\/Fluor LimitedMedia RelationsBrian Mershon, +1-864-281-6484mobile +1-864-569-5526orJanet Kearns, 44 (0) 252 292039","19":"Fluor Corporation (NYSE: FLR) announced today that NuScale Power, for which Fluor is the majority investor, was named a recipient of U.S. Department of Energy (DOE) funding that will support the development, licensing and commercialization of the company s nuclear small modular reactor (SMR) technology. This project represents a significant investment in first-of-a-kind engineering and design certification for small modular reactors in the United States. Through a five-year cost-share agreement, the DOE will invest up to half of the total project cost with the project s industry partners matching this investment by at least one-to-one. The specific total will be negotiated between the DOE and NuScale and will be derived from the total $452 million identified for the Department s Small Modular Reactor Licensing Technical Support program. Fluor and NuScale continue to be approached by numerous entities, and are evaluating potential investors, manufacturers and other supply chain partners for future potential SMR development efforts. Fluor is extremely pleased by the DOE s funding decision in favor of NuScale s innovative SMR technology, said Dave Dunning, Fluor s group president, Global Business Development & Strategy. The determination by a panel of independent experts that NuScale s SMR technology offers tremendous potential to produce safe, reliable, scalable power validates the same conclusion reached by Fluor when we initially decided to invest and support NuScale s commercialization efforts. Fluor made its investment in NuScale Power in October 2011 prior to the announcement of the DOE cost-sharing program. With growing long-term energy needs in the U.S. and abroad, Fluor s investment complements the company s EPC new-build and project management strengths together with our clients demand for diverse fuel technology capabilities. Fluor has been actively involved in the engineering, procurement, construction and maintenance of nuclear power plants for more than 60 years at more than 20 nuclear power units. About Fluor Corporation For more than 100 years, Fluor Corporation (NYSE: FLR) has partnered with its clients to design, build and maintain many of the world's most challenging and complex capital projects. Through its global network of offices on six continents, more than 41,000 employees provide comprehensive capabilities and world-class expertise in the fields of engineering, procurement, construction, commissioning, fabrication, operations, maintenance and project management. Today, the company serves a global client base in the energy, chemicals, government, industrial, infrastructure, operations & maintenance, manufacturing & life sciences, mining, power and transportation sectors. Headquartered in Irving, Texas, Fluor ranks 110 on the FORTUNE 500 list and had revenue of $27.6 billion in 2012. For more information, visit www.fluor.com and follow us on Twitter at @FluorCorp. Fluor CorporationMedia RelationsKeith Stephens, 469-398-7624orBrian Mershon, 469-398-7621orInvestor RelationsKen Lockwood, 469-398-7220orJason Landkamer, 469-398-7222","20":"IRVING, Texas--(BUSINESS WIRE)--Fluor Corporation (NYSE: FLR) confirmed today that the New York State Thruway Authority and the New York State Department of Transportation announced that Tappan Zee Constructors, a Fluor-led team consisting of Fluor Enterprises, Inc., American Bridge Company, Granite Construction Northeast, Inc., and Traylor Bros., Inc., was selected for the multi-billion dollar, design-build contract for the new Tappan Zee Hudson River Crossing Project. Three design concepts and corresponding budgets were presented to the public by the Authority and New York s Governor Andrew Cuomo on December 5, 2012, in Albany. Tappan Zee Constructors submission, shown as Proposal One, was recommended at that time by the Selection Committee. Today, the Authority s Board of Directors made the final selection of the Tappan Zee Constructors proposal. Based on its 30 percent ownership of the joint venture, Fluor will book its portion of the project into backlog once the contract receives final approval and a notice to proceed is issued. \"The combined experience of our team enabled us to put forward an attractive and cost competitive design,\" said Steve Dobbs, president of Fluor s Industrial & Infrastructure Group. \"We also will be able to leverage our recent successful bridge construction experiences, like the San Francisco-Oakland Bay Bridge, and our unique equipment capabilities in making this important project a reality.\" The 3.1-mile-long Tappan Zee Bridge connects Rockland County to Westchester County in the Lower Hudson Valley (approximately 25 miles north of midtown Manhattan) and is a vital transportation link that serves approximately 138,000 vehicles per day. The mega-project will be the single largest bridge project in New York s history. It is the state s first application of its recently enacted design-build legislation and has produced substantial savings relative to the $5.2 billion estimated cost. The Fluor team developed a unique and innovative design that reduced the weight of the structure and minimized the number and size of foundations required. The design solution also utilizes a shallow superstructure and a 350 long-span design to minimize the number of piers and provide a sleeker looking bridge that enhances the view corridors within the lower Hudson Valley. The main span is a composite deck cable-stayed structural system with outwardly inclined main span towers that create an iconic look and accommodate future transit loads. The design will allow for dredge quantities to be reduced from 1.8 million cubic yards to less than one million cubic yards, lessening environmental impacts, costs, and schedule durations. In addition, the construction schedule will benefit from utilizing unique heavy lifting equipment that Fluor and its partner American Bridge own and had custom built for the San Francisco-Oakland Bay Bridge project. Construction will take approximately five years with completion projected for 2018. About Fluor Corporation Fluor Corporation (NYSE: FLR) designs, builds and maintains many of the world's most challenging and complex projects. Founded in 1912, the company was started by John Simon Fluor Sr. with a modest investment of $100. Since those humble beginnings, the company has grown into one of the largest engineering & construction companies in the world. Fluor is celebrating its 100th anniversary during 2012. Today, through its global network of offices on six continents, the company provides comprehensive capabilities and world-class expertise in engineering, procurement, construction, commissioning, operations, maintenance and project management. Headquartered in Irving, Texas, Fluor is a FORTUNE 200 company and had revenue of $23.4 billion in 2011. For more information, visit www.fluor100.com and www.fluor.com. Fluor CorporationMedia RelationsKeith Stephens, 469-398-7624orBrian Mershon, 469-398-7621orInvestor RelationsKen Lockwood, 469-398-7220orJason Landkamer, 469-398-7222Fax: 469-398-7277","21":"Fluor Corporation (NYSE: FLR) announced today that John Hopkins, group executive for Corporate Development & New Ventures, will assume the roles of chairman and chief executive officer for NuScale Power LLC. Fluor made its initial investment in NuScale in October 2011 and is today the majority investor in the company. Current NuScale chairman and CEO Paul Lorenzini will retire, but will continue as a consultant to the company. Commensurate with his move to lead NuScale, Hopkins will retire from Fluor at the end of March 2013. John Hopkins has played a significant leadership role in our company for almost three decades. He has brought a true professionalism to our sales force and worked across business groups and industries to deliver the comprehensive Fluor value that our global customers and clients have come to expect, said David Seaton, Fluor s chairman and chief executive officer. Because of its importance to our company, I have asked John to take on this new challenge of leading NuScale's expansion of its strategic partnerships, efficiently managing costs and working to capture markets and geographies that best meet NuScale's business goals. I look forward to taking on this new challenge and working with the NuScale management team as we move toward full commercialization and compete for business around the world, said Hopkins. I want to thank Paul Lorenzini for all he has done to bring NuScale from an initial idea to being on the cusp of delivering new, innovative and passively safe energy to customers around the world. I strongly believe in NuScale s SMR technology and the potential it has to produce safe, reliable, scalable power. One of the key focal points for Hopkins will be working with his management team toward securing the next U.S. Department of Energy (DOE) Funding Opportunity Announcement (FOAs) that will support the development, licensing and commercialization of nuclear small modular reactor technology. Both Fluor and NuScale continue to be approached by, and are evaluating potential investors, manufacturing partners and other supply chain members for future SMR development efforts. Since joining Fluor in 1984, Hopkins has held a variety of senior management, sales and operations roles around the world. These positions have included: group president of Fluor s Government Group; group executive of Fluor Global Services; president and chief executive officer of TradeMC, the capital goods sourcing venture jointly owned by Fluor and IBM; group president of Corporate Sales & Marketing, Corporate Development and Project Finance; president of Chemicals & Life Sciences; and president of Chemicals, Plastics & Fibers. He also has served in the company's government unit, where he gained experience in managing complex government contracts and completed a two-year assignment with the North Atlantic Treaty Organization (NATO) in Turkey. About Fluor Corporation Fluor Corporation (NYSE: FLR) designs, builds and maintains many of the world's most challenging and complex projects. Founded in 1912, the company was started by John Simon Fluor Sr. with a modest investment of $100. Since those humble beginnings, the company has grown into one of the largest engineering & construction companies in the world. Fluor is celebrating its 100th anniversary during 2012. Today, through its global network of offices on six continents, the company provides comprehensive capabilities and world-class expertise in engineering, procurement, construction, commissioning, operations, maintenance and project management. Headquartered in Irving, Texas, Fluor is a FORTUNE 200 company and had revenue of $23.4 billion in 2011. For more information, visit www.fluor100.com and www.fluor.com. Fluor CorporationMedia RelationsKeith Stephens, 469-398-7624orBrian Mershon, 469-398-7621orInvestor RelationsKen Lockwood, 469-398-7220orJason Landkamer, 469-398-7222","22":"IRVING--(BUSINESS WIRE)--Fluor Corporation (NYSE: FLR) announced today that the company was awarded a contract by the U.S. Navy to provide base operations support services at the Naval Air Station Jacksonville; Naval Station Mayport; Bureau of Medicine and Surgery, Jacksonville; and Blount Island Command. The firm-fixed-price, indefinite-delivery\/indefinite-quantity contract will have a maximum value in year one of approximately $40 million with a maximum total life time contract value of $318 million. Under this new contract, Fluor will be providing base operations support services which includes: port services; supply; personnel support; facilities support; facility management\/facility investment; utilities; electrical; water; wastewater; telecommunications; base support vehicles and equipment; and environmental services. Work will be performed at Navy bases and installations in the greater Jacksonville, Fla. area. This new contract from the Navy is a strategic win for our services business. Providing quality, cost-competitive solutions to the Navy is work that Fluor employees take great pride in, said Bruce Stanski, president of Fluor Government Group. We are proud that Fluor was chosen to provide these important services which will allow the Navy team to focus on the most important aspects of their missions. About Fluor Corporation Fluor Corporation (NYSE: FLR) designs, builds and maintains many of the world's most challenging and complex projects. Through its global network of offices on six continents, the company provides comprehensive capabilities and world-class expertise in the fields of engineering, procurement, construction, commissioning, operations, maintenance and project management. Headquartered in Irving, Texas, Fluor is a FORTUNE 200 company and had revenue of $20.8 billion in 2010. For more information visit www.fluor.com. Fluor CorporationMedia RelationsKeith Stephens, 469-398-7624orBrian Mershon, 469-398-7621orInvestor RelationsKen Lockwood, 469-398-7220orJason Landkamer, 469-398-7222","23":"IRVING, Texas--(BUSINESS WIRE)--Fluor Corporation (NYSE: FLR) announced today that it has signed a memorandum of understanding with Plains and Eastern Clean Line LLC (Clean Line), an affiliate of Clean Line Energy Partners LLC, to provide development support, preliminary engineering, procurement and construction services (EPC) for the proposed Plains & Eastern Clean Line project, which is an 800-mile high-voltage direct current (HVDC) transmission line from Oklahoma to Tennessee and is currently in the development and permitting stages. As part of Fluor s MOU with Clean Line, the company with Pike Electric Corporation as a subcontractor to Fluor will provide initial permitting and development support services for the project. After the project has received all permits and regulatory and financial approvals, Fluor and Pike will provide the full EPC services for the transmission line project. The Plains & Eastern Clean Line will consist of approximately 800 miles of overhead HVDC transmission lines that will deliver 3,500 megawatts of power from Oklahoma, Texas and Kansas to the southeastern United States. Fluor continues to play a vital role in the renewables energy space and we are excited to assist Clean Line Energy with the development of this unique transmission line project, said Dave Dunning, president of Fluor s Power Group. Clean Line is committed to working with local businesses and vendors and our agreement with Fluor will help us build the supply chain around this project that will benefit the communities in our project area, said Michael Skelly, president of Clean Line Energy Partners. We are very pleased to select a firm of Fluor s stature as our EPC Alliance partner. Fluor s experience and expertise building large infrastructure projects will help us fulfill our mission of tapping Oklahoma s energy resources. The completion of the Plains & Eastern Clean Line transmission project will make possible an estimated $7 billion of new renewable energy projects that otherwise may not be built due to limitations of the existing electric transmission grid. The Plains & Eastern Clean Line will create thousands of jobs and increase state and local tax revenues. The project is expected to take several years to fully permit and could begin commercial operations as early as 2017. About Clean Line Energy Partners Clean Line s mission is to connect abundant, renewable energy resources to areas that have a high demand for clean, reliable energy. Clean Line is developing a series of long distance high voltage direct current transmission projects to move renewable energy to market. For more information please visit www.cleanlineenergy.com. About Fluor Corporation Fluor Corporation (NYSE: FLR) designs, builds and maintains many of the world's most challenging and complex projects. Through its global network of offices on six continents, the company provides comprehensive capabilities and world-class expertise in the fields of engineering, procurement, construction, commissioning, operations, maintenance and project management. Headquartered in Irving, Texas, Fluor is a FORTUNE 200 company and had revenue of $20.8 billion in 2010. For more information, visit www.fluor.com. Fluor CorporationMedia Relations:Keith Stephens, 469-398-7624orBrian Mershon, 469-398-7621orInvestor Relations:Ken Lockwood, 469-398-7220orJason Landkamer, 469-398-7222","24":"IRVING, Texas--(BUSINESS WIRE)--Fluor Corporation (NYSE: FLR) announced today that Richard A. Hack has joined the company s Government Group (FGG) as a senior executive overseeing logistics and contingency work for U.S. armed forces serving abroad. He will be based in Fluor s Greenville, S.C., operations center. Prior to joining Fluor, Hack spent more than 33 years in the U.S. Army in a variety of leadership positions, and prior to retirement, he served as the Deputy Commanding General and Chief of Staff of the Army Materiel Command (AMC) based in Ft. Belvoir, Va. AMC is one of the largest commands in the U.S. Army, with more than 50,000 employees and activities in 42 states and in more than a dozen foreign countries. Since retiring in November 2005, Hack has held senior roles at Booz Allen Hamilton and KBR. Serving the men and women of the U.S. Armed Forces is the top priority for our LOGCAP and CETAC work. Fluor has an outstanding record of performing this work well, and Rick Hack s addition to our senior leadership team will only help solidify our focus on serving the troops on the ground, said Bruce Stanski, president of Fluor Government Group. Rick s military and private sector experience is a welcomed addition to our team and our company. Hack received a Bachelor of Arts from the Virginia Military Institute and holds a Master of Business Administration degree from the Florida Institute of Technology. While serving in the Army, Hack was recognized with military decorations including the Distinguished Service Medal (two awards), Legion of Merit (four awards), the Meritorious Service Medal (five awards), the Army Commendation Medal (three awards) and the Army Achievement Medal. Additionally, he is a member of the U.S. Army Ordnance Hall of Fame. About Fluor Corporation Fluor Corporation (NYSE: FLR) designs, builds and maintains many of the world's most challenging and complex projects. Through its global network of offices on six continents, the company provides comprehensive capabilities and world-class expertise in the fields of engineering, procurement, construction, commissioning, operations, maintenance and project management. Headquartered in Irving, Texas, Fluor is a FORTUNE 200 company and had revenues of $22.3 billion in 2008. For more information visit www.fluor.com. Fluor CorporationMedia Relations:Keith Stephens, 469-398-7624orBrian Mershon, 469-398-7621orInvestor Relations:Ken Lockwood, 469-398-7220orJason Landkamer, 469-398-7222","25":"IRVING, Texas--(BUSINESS WIRE)--Fluor Corporation (NYSE: FLR) announced today that Windsor Essex Mobility Group (WEMG), an equity consortium of Fluor Canada Ltd. (Fluor), ACS Infrastructure Canada Inc (ACSIC), and Acciona Concessions Canada Inc (Acciona), each with a one-third share, reached financial close on the Windsor-Essex Parkway project in Canada. In November 2010, WEMG was named the preferred proponent for the finance, design, construction, operations and maintenance of the Windsor-Essex Parkway. Fluor will book its portion of the $1.2 (CAD) billion project into backlog in the fourth quarter of 2010. In addition to its role on the equity consortium, Fluor is also a member of Parkway Infrastructure Constructors (PIC), the design-build joint venture which will perform the design and construction activities for the Parkway project in conjunction with a team of local subcontractors. PIC includes Fluor, Dragados Canada and Acciona Infrastructures Canada, each which also has a one-third share. PIC expects to receive a notice to proceed with design and construction from WEMG the first week of January 2011. \"We are extremely pleased to be able to reach financial close ahead of schedule and advance this high profile project into the design and construct phase for the citizens of Ontario,\" said Patrick Flaherty, senior vice president of Fluor's Infrastructure business line. The Windsor-Essex Parkway represents the most significant single highway investment in Ontario's history. The project will be an approximately 11-kilometer, six-lane, below-grade freeway featuring wide cut and cover tunnels, connecting bridges, and earth-retaining structures. The project will also include construction of surrounding local service roads, interchanges, landscaped parklands, and recreational walking and cycling trails. Unique to this project will be the public parks and other landscaped green spaces that will be built on top of the tunnels and adjacent to the roadway. In total, the project will include more than 300 acres of green space and 20 kilometers of recreational trails. The Parkway will be a publicly owned highway, and not a toll road. About Fluor Corporation Fluor Corporation (NYSE: FLR) designs, builds and maintains many of the world's most challenging and complex projects. Through its global network of offices on six continents, the company provides comprehensive capabilities and world-class expertise in the fields of engineering, procurement, construction, commissioning, operations, maintenance and project management. Headquartered in Irving, Texas, Fluor is a FORTUNE 200 company and had revenues of $22 billion in 2009. For more information visit www.fluor.com. Fluor CorporationMedia RelationsKeith Stephens, 469-398-7624orBrian Mershon, 469-398-7621orInvestor RelationsKen Lockwood, 469-398-7220orJason Landkamer, 469-398-7222","26":"IRVING, Texas--(BUSINESS WIRE)--Fluor Corporation (NYSE: FLR) announced today that the Utah Department of Transportation (UDOT) selected Provo River Constructors, a Fluor-led joint venture, as the team with the best fixed-price, best-design proposal for the expansion of the I-15 Corridor Reconstruction (CORE) project. The proposed scope of work is along a 23-mile stretch of the existing interstate in Utah County, one of the fastest growing counties in the U.S. I-15 is the major north-south commuter route between Salt Lake City and the Provo\/Orem region. The design-build contract value is expected to be in the range of $1.1 billion. Fluor will book its 40 percent share of the project into backlog when the contract is signed and all material financing uncertainties have been resolved, which is expected to be no later than the first quarter of 2010. Utah s State Legislature previously authorized a revenue and bond package to support the project. Fluor s track record of successfully completing design-build road projects and delivering value to our transportation clients across the United States is an area in which we take great pride, said Patrick Flaherty, head of Fluor s Infrastructure business line. Fluor developed an excellent relationship with UDOT during the Legacy Parkway project from 2000 to 2003 and we look forward to building on that relationship to deliver the I-15 project with excellence, concluded Flaherty. The I-15 CORE project will add 23 miles of two additional lanes on both southbound and northbound routes from American Fork to Provo and extend the existing express lane from Orem to Provo. Additionally, aging bridges (built in the 1960s) and outdated and congested interchanges will be redesigned, modified and\/or replaced to facilitate increased mobility and safety. Provo River Constructors is a Fluor-led joint venture that includes Ames Construction, Inc, Ralph L. Wadsworth Construction Company and Wadsworth Brothers Construction. As managing partner, Fluor will be responsible for all aspects of construction including roadway, drainage and bridge construction. Other members of the team include: Fluor-HDR Global Design Consultants LLC (lead design) with Jacobs Engineering, Michael Baker Jr. Inc, and Kleinfelter West Inc as subcontractors. About Fluor Corporation Fluor Corporation (NYSE: FLR) designs, builds and maintains many of the world's most challenging and complex projects. Through its global network of offices on six continents, the company provides comprehensive capabilities and world-class expertise in the fields of engineering, procurement, construction, commissioning, operations, maintenance and project management. Headquartered in Irving, Texas, Fluor is a FORTUNE 200 company and had revenues of $22.3 billion in 2008. For more information, visit www.fluor.com. Fluor CorporationMedia RelationsKeith Stephens, 469-398-7624orBrian Mershon, 469-398-7621orInvestor RelationsKen Lockwood, 469-398-7220orJason Landkamer, 469-398-7222","27":"IRVING, Texas--(BUSINESS WIRE)--AMECO, a unit of Fluor Corporation (NYSE: FLR), providing integrated equipment and tool solutions to government and industry, announced today that the National Safety Council (NSC) has recognized the firm with multiple safety awards, most prominently, for its Industry Leader Award. AMECO was recognized at the recent NSC 2009 Safety Congress and Expo in Orlando, Fla., and was distinguished for achieving the best safety performance in its category within construction, mining, forestry machinery, and equipment leasing and rental. This industry recognition by NSC, a well-known, independent third party organization, demonstrates the level of AMECO s commitment to safety excellence on a global basis, said Gary Bernadez, president of AMECO. World-class safety performance is ingrained in our employees work habits and culture at every single operating location and project throughout the world. The Industry Leader Award is an outstanding achievement for any company, but especially for one that operates in challenging environments and extreme geographies. The award is one component of NSC s Occupational Award Program. Top members of their program are judged by their overall safety performance over the past year. There are more than 48,000 members in the NSC including businesses, labor organizations, schools, public agencies, private groups and individuals. This national recognition for our safety accomplishments shows the effectiveness of our safety management system and the dedication of our employees to live it on a daily basis, said David Taylor, AMECO s health, safety and environment manager. Our objective going forward is to continue this level of outstanding safety performance for our employees and our clients employees both at work and at home. In addition to the industry recognition award, AMECO also received the following four specialty safety awards from NSC: Perfect Record Award for more than eight years (March 2001 to August 2009) without a lost workday case Million Hour Award for more than 28 million hours without a lost workday case National Safety Achievement Award for a total case incident rate being safer than 50 percent of the industry rate for 2009 Safety Leadership Award for more than five years without a lost workday case (2005-2009) The NSC also recognized four AMECO operating locations for safety performance at its three Texas-based offices (Borger, Houston and Tyler) and Greenville, S.C. About AMECO AMECO, a unit of Fluor Corporation (NYSE: FLR), has delivered fully integrated equipment and tool solutions for more than 60 years. The company is focused on three primary businesses: operations fleet services, construction site services and equipment distribution. About Fluor Corporation Fluor Corporation (NYSE: FLR) designs, builds and maintains many of the world's most challenging and complex projects. Through its global network of offices on six continents, the company provides comprehensive capabilities and world-class expertise in the fields of engineering, procurement, construction, commissioning, operations, maintenance and project management. Headquartered in Irving, Texas, Fluor is a FORTUNE 200 company and had revenues of $22.3 billion in 2008. For more information, visit www.fluor.com. Fluor CorporationMedia RelationsKeith Stephens, 469-398-7624orBrian Mershon, 469-398-7623orInvestor RelationsKen Lockwood, 469-398-7220orJason Landkamer, 469-398-7222","28":"Recognized for Visionary Solutions in Transforming World s Energy Infrastructure IRVING, Texas--(BUSINESS WIRE)--Fluor Corporation (NYSE: FLR) announced today that Hart Energy Publishing LP of Houston has honored the company with its Energy & Environmental Excellence award for Visionary Solutions. The award ceremony took place at Hart s 2008 Energy Solutions Conference and was accepted by David Zelinski, senior vice president of downstream sales in Fluor s Energy & Chemicals group. We are pleased to be honored by Hart Energy for our significant contributions in the energy sector s multiple fuel lines, said David Seaton, president, Fluor s Energy & Chemicals Group. Our energy-related engineering workforce has doubled over the past 3 years to assist our global clients in meeting the world s growing energy needs. Hart Energy recognized Fluor specifically for achievements in transforming the world s energy infrastructure with innovations in solar, wind and nuclear energies, gasification of coal and other fossil fuels, carbon dioxide emissions reduction and carbon footprint reduction. We are honored to have hosted such an esteemed group of energy leaders and are confident that all of our nominees are taking important steps toward guiding the future of our industry in a significant way, said Fred Potter, executive vice president, Hart Energy. Our award winners have proven that they are thinking about the future of not only the energy industry, but of the effect it will have around the globe. About Fluor Fluor Corporation (NYSE: FLR) provides services on a global basis in the fields of engineering, procurement, construction, operations, maintenance and project management. Headquartered in Irving, Texas, Fluor is a FORTUNE 500 company with revenues of $16.7 billion in 2007. For more information, visit www.fluor.com. (FLRG) Fluor CorporationMedia RelationsKeith Stephens, 469-398-7624orBrian Mershon, 469-398-7621orInvestor RelationsKen Lockwood, 469-398-7220orJason Landkamer, 469-398-7222","29":"Fluor Offshore Solutions Ready to Address Global Oil & Gas Needs IRVING, Texas--(BUSINESS WIRE)--Fluor Corporation (NYSE: FLR) announced today that it has formed a dedicated business unit within its Upstream business line to address the specific needs of its global oil & gas clients in the offshore market. The entity will be known as Fluor Offshore Solutions and build off the company s strong history of project execution on complex and remote offshore projects around the globe. The Fluor Offshore Solutions business unit will be headquartered in Fluor s Sugar Land, Texas, location. It will also have offices in Trinidad, Abu Dhabi and Manila and leverage Fluor's global office network to offer execution capability around the world. Fluor is a well-known entity in the offshore market dating from the 1960s when it performed work under the Fluor Ocean Services banner. The company maintained that strong reputation in the offshore industry by providing key engineering and construction services on a number of projects in the ensuing decades. In recent years, Fluor performed significant roles on a number of high-profile offshore projects for a variety of clients around the world. Those projects include: Kizomba A and B in West Africa; Bayu Undan between Australia and East Timor; Bleo Holme in the North Sea; Enfield off the Northwest Cape of Australia; Bohai Bay off the coast of China; and Cannonball and Poinsettia projects in Trinidad. To execute Fluor s offshore strategy, the company has appointed Skip Alvarado to lead this business unit and leverage personnel and assets across the entire Fluor network. Additionally, Bimal Parikh will lead the business development efforts for the new business unit focusing on prospect screening, customer and partner relationships, and overall strategic planning. Our team is well-suited to serve the needs of our offshore clients. They have a depth of industry knowledge that is rarely surpassed, said David Seaton, president of Fluor s Energy & Chemicals business group. While oil prices have come down from their highs this past summer, we know that our clients will continue to have the need to go to more remote and harsh environments to access oil & gas. We are dedicating the people and financial resources to make this new business unit a strong industry player for years to come. To take advantage of Fluor s vast offshore experience in program and project management, engineering, procurement and construction, we are now putting all those resources under one roof, said Skip Alvarado, vice president and head of Fluor Offshore Solutions. We intend to vigorously pursue opportunities around the world, and our industry-leading project management systems and safety performance record position us well for this expanding market. Fluor Offshore Solutions will continue to offer its clients of all sizes a wide range of services including: studies, engineering, procurement, fabrication, installation, commissioning and other related services. Fluor Corporation (NYSE: FLR) provides services on a global basis in the fields of engineering, procurement, construction, operations, maintenance and project management. Headquartered in Irving, Texas, Fluor is a FORTUNE 500 company with revenues of $16.7 billion in 2007. For more information visit www.fluor.com. (FLRG) Fluor CorporationMedia Relations:Keith Stephens, 469-398-7624orBrian Mershon, 469-398-7621orInvestor Relations:Ken Lockwood, 469-398-7220orJason Landkamer, 469-398-7222","30":"Infrastructure Initiative Will Bring Needed Improvements and New Choices to Capital Beltway Drivers IRVING, Texas--(BUSINESS WIRE)--Fluor Corporation (NYSE: FLR) announced today that its subsidiary Fluor Enterprises and partner Transurban Group reached a final agreement with the Virginia Department of Transportation (VDOT) for the financing, design, construction, operation and maintenance of the new Capital Beltway High Occupancy Toll (HOT) Lanes on Interstate 495 in Northern Virginia. Fluor is the managing partner of the approximately $1.4 billion design and construction contract working with The Lane Construction Corp. The company will book the entire contract amount in the fourth quarter 2007. Work will begin in spring 2008 with the new lanes opening in 2013. Today s agreement is the culmination of more than five years of work among numerous local, private, regional, state and federal entities. Fluor and Transurban formed Capital Beltway Express LLC as the operating entity for the 80-year concession management of the I-495 HOT Lanes. Transurban will be the majority owner of the concession company with a 90 percent share and Fluor will be a 10 percent minority owner. The Capital Beltway HOT Lanes project will provide Northern Virginia drivers with an improved Capital Beltway and a key part of the overall solution for addressing regional congestion, said Fluor Senior Vice President Patrick Flaherty. At a time when we are seeing high levels of interest from many states to team with the private sector to deliver badly needed infrastructure improvements, the I-495 Capital Beltway Project is certain to become a model for smart and effective use of Public-Private Partnerships (PPP) in the U.S. We applaud the leadership demonstrated by the Virginia Department of Transportation to work in partnership with Fluor and Transurban to bring this signature project to financial close. Our focus has been and will continue to be on delivering a project that gives new choices to Capital Beltway drivers. Our approach is to do it safely while minimizing traffic impact and delays during construction. Frankly, we will be here long after the final layer of asphalt is applied and we want the new HOV and HOT lane users to have a good experience from ground-breaking to ribbon-cutting and beyond, said Fluor Vice President of Operations Herb Morgan. The project includes improvements and replacement of a significant portion of the aging infrastructure along a 14-mile stretch of the Capital Beltway in northern Virginia. In addition to improving the existing roadway, Fluor and Lane will construct four, new HOT lanes in the center section of the interstate. Vehicles with three or more passengers, buses and emergency vehicles will use the HOT lanes at no charge. Drivers with fewer passengers can choose to pay a variable toll to use this new express service. Existing free lanes will adjoin the HOT lanes. The project will include: Two new lanes in each direction from the Springfield Interchange to just north of the Dulles Toll Road; First-time introduction of HOV to the Beltway and Tysons Corner; Congestion-free network for transit service on the Beltway; Replacement of more than $250 million of aging infrastructure, including replacement of 42 bridges and overpasses; Upgrades to 11 key interchanges; Construction of more than 70,000 linear feet (13 miles) of soundwalls to double existing protection for local neighborhoods; Construction of Springfield Interchange Phase VIII to create a seamless HOV network on I-95\/395, Capital Beltway, I-66, the Dulles Toll Road and future HOV lanes on Braddock Road; Improved connection at I-66 to improve traffic flow onto the Beltway; and Three new access points to the Capital Beltway at Rt. 29\/Lee Highway, Westpark Bridge and Jones Branch Drive. More than 200,000 drivers a day use this stretch of the I-495 Interstate. The planned improvements on the Beltway will give commuters new options to more quickly reach their destination. Highway design modifications will increase traffic capacity and safety while minimizing the impact to neighboring homes and businesses. For more information about the I-495 Capital Beltway Project go to www.virginiahotlanes.com About Transurban Transurban Group is an international toll road investor and manager with more than 10 years experience developing and operating complex toll road infrastructure. Transurban is a US $6.4 billion company with interests in seven key toll roads in Australia and the US, including Pocahontas Parkway in Richmond, Virginia. Transurban is proud to be included in the Dow Jones Sustainability Index as one of the world s most sustainable companies. For more information on Transurban visit www.transurban.com. About Fluor Fluor Corporation (NYSE: FLR) provides services on a global basis in the fields of engineering, procurement, construction, operations, maintenance and project management. Headquartered in Irving, Texas, Fluor is a FORTUNE 500 company with revenues of $14.1 billion in 2006. For more information visit www.fluor.com. (FLRG) Fluor CorporationMedia Relations:Keith Stephens, 469-398-7624orJeff Wagner, 513-484-2348orInvestor Relations:Ken Lockwood, 469-398-7220orJason Landkamer, 469-398-7222","31":"IRVING, Texas--(BUSINESS WIRE)--Fluor Corporation s Chairman and Chief Executive Officer, Alan Boeckmann and Chief Financial Officer, Mike Steuert, will give a presentation to investors at the Third Annual Bear Stearns Annual Commodities and Capital Goods Conference in New York on Wednesday, November 28, 2007 at 9:00 a.m. Eastern Standard Time. When: November 28, 2007 Time: 9:00 a.m. EST Where: Bear Stearns World Headquarters 383 Madison Avenue New York, New York A live webcast of this presentation will be available at http:\/\/investor.fluor.com. A replay of this presentation will be available shortly after the conclusion of the live presentation and will be archived until December 5th. If you have any questions regarding this webcast, please contact Fluor s Investor Relations department at 469-398-7189 or investor.relations@fluor.com. Fluor Corporation (NYSE:FLR) provides services on a global basis in the fields of engineering, procurement, construction, operations, maintenance and project management. Headquartered in Irving, Texas, Fluor is a FORTUNE 500 company with revenues of $14.1 billion in 2006. For more information, visit www.fluor.com. (FLRF) Fluor CorporationMedia RelationsKeith Stephens, 469-398-7624orBrian Mershon, 469-398-7621orInvestor RelationsKen Lockwood, 469-398-7220orJason Landkamer, 469-398-7222","32":"IRVING, Texas--(BUSINESS WIRE)--Fluor Corp. (NYSE:FLR) has leased 47,900 square feet in Mt. Laurel, N.J., for a regional office focusing on energy, chemicals, manufacturing and life sciences and operations and maintenance. The office will employ 200 professionals including approximately 100 new hires. Fluor will move into the new space Monday, Dec. 18. This is a strong growth market, and we re pleased to be able to offer our clients this local office loaded with employees with experience in the local market and needs, said Steve Gilbert, Fluor Senior Vice President, Human Resources & Administration. We ve had great response from clients about our capabilities here. To recruit additional employees, Fluor will host a jobs fair from 4 to 7 p.m., Tuesday, Jan. 23, 2007 at the new offices. The company will also participate in local job fairs and is targeting established engineers in the market as well as local universities and technical colleges. Former Fluor employees in the region have already been contacting us about positions, and we re busy staffing up for some of the exciting projects being planned for this region, as well as mega-projects around the world, said Luis Martinez, Vice President of Operations for Northeast Regional Office. We re in the midst of one of the strongest energy and chemicals markets in history, and it s a great time to work at Fluor. The office is located at 1120 Route 73, Mt. Laurel, N.J. Initially the Fluor team will occupy 25,000 square feet, but by February 2007 the entire 47,900 square feet will be occupied. This month, some 100 Fluor employees from the Philadelphia area will relocate to the space. These Fluor employees are from the energy and chemicals; manufacturing and life sciences; TRS Staffing Solutions; and operations and maintenance divisions. Manufacturing and life sciences is also seeing strong growth globally, said Ivor Harrington, Senior Vice President, Manufacturing & Life Sciences. We give employees the opportunity to work on large-scale, challenging projects. Our clients are some of the biggest names in the industry. Fluor s Operations and Maintenance division has a significant presence in the Northeast region. The Northeast is a strategic target area for growth. Having a local presence will strengthen our ability to support existing clients, such as Dupont, IBM, Uniqema, Loreal, and Proctor & Gamble, while positioning us for the future, said Charlie Bailey, Fluor Vice President, Operations and Maintenance. Fluor provides services on a global basis in the fields of engineering, procurement, construction, operations, maintenance and project management. Now headquartered in Irving, Texas, Fluor is a FORTUNE 500 company with revenues of nearly $13.2 billion in 2005. For more information, visit www.fluor.com. (FLRG) Fluor Corp.Media RelationsKeith Stephens\/Steve Roth, 469-398-7624\/469-398-7623orInvestor RelationsKen Lockwood\/Jason Landkamer, 469-398-7220\/469-398-7222469-398-7277 fax","33":"GREENVILLE, S.C.--(BUSINESS WIRE)--AMECO, a unit of Fluor Corporation (NYSE:FLR) providing integrated equipment and tool solutions to government and industry, today announced that its global workforce of more than 1,500 employees has worked 15 million safe work hours from March 2001 through October 2006 with no lost-time injuries. The 15 million safe work hour milestone collectively acknowledges the individual commitment by our employees to maintain a safe and healthy work environment, said Larry Gibbs, AMECO s Health, Safety and Environmental director. The achievement is even more impressive when considering AMECO s diverse operational footprint, which covers construction support projects, branch operation and fleet management contracts throughout North America, Latin America, Africa and the Middle East. Having our employees return safely to their homes and families at the end of each day is the best achievement we can attain. AMECO employees continue to set the safety standard in our industry, said Gary Bernardez, president of AMECO. Reaching 15 million consecutive hours without a lost workday represents an outstanding accomplishment by our global operations and demonstrates to our customers the importance we place on safety. In addition to the 15 million safe work hour milestone, AMECO s 2006 safety achievements included the National Safety Council s 2005 Industry Leader Award, the National Safety Council s Perfect Record Award and the South Carolina Chamber of Commerce Safety Excellence Award. AMECO has delivered fully integrated equipment and tool solutions for nearly 60 years. The company is focused on two primary businesses, Fleet OutsourcingSM and Site ServicesSM. The Fleet Outsourcing business assists clients in the government and industrial markets, including heavy industrial, power and manufacturing facilities, with complete management and maintenance of fleet, tool and asset management functions. The Site Services business provides a complete service package consisting of equipment, tool and construction indirects to capital construction projects. Fluor Corporation (NYSE:FLR) provides services on a global basis in the fields of engineering, procurement, construction, operations, maintenance and project management. Headquartered in Irving, Texas, Fluor is a FORTUNE 500 company with revenues of $13.2 billion in 2005. For more information, visit www.fluor.com. (FLRG) Fluor CorporationMedia RelationsKeith Stephens, 469-398-7624Steve Roth, 469-398-7623orInvestor RelationsKen Lockwood, 469-398-7220Jason Landkamer, 469-398-7222","34":"Fluor Corporation (NYSE: FLR) announced today that it has been selected by Marathon Petroleum Company LLC (MPC), a wholly-owned subsidiary of Marathon Oil Corporation (NYSE: MRO), to provide front-end engineering design (FEED) services for a proposed $2.2 billion expansion at the company's Garyville, La., refinery. Marathon's final investment decision for this expansion is subject to completion of the FEED and receipt of applicable permits. The FEED contract value was not disclosed and will be booked in the fourth quarter. \"Fluor is pleased to continue its long-standing relationship with Marathon by being part of an important project that would provide much-needed refining capacity to the U.S. We are dedicated to supporting Marathon's success on this project,\" said Jeff Faulk, Fluor's group president of Energy & Chemicals. Fluor's services will include front-end engineering for new processing units, as well as utilities and off sites. The contract will be performed over a 12-month period and executed in Fluor's office in Houston, with support from the company's global engineering centers. \"Marathon looks forward to working with Fluor through the design phase of this important project, which would increase the capacity at our Garyville refinery from 245,000 barrels per day (bpd) to 425,000 bpd, enabling us to better meet the fuel supply needs of our customers,\" said Gary R. Heminger, Marathon executive vice president and president of MPC. Fluor provides services on a global basis in the fields of engineering, procurement, construction, operations, maintenance and project management. Headquartered in Aliso Viejo, California, Fluor is a FORTUNE 500 company with revenues of nearly $9.4 billion in 2004. For more information, visit www.fluor.com. This release contains forward-looking statements with respect to the Garyville expansion project. Some factors that could cause the actual results to be different than expected include satisfactory results of the FEED work, Marathon board and necessary regulatory approvals, crude oil supply and transportation logistics, availability of materials and labor, unforeseen hazards such as weather conditions, and other risks customarily associated with construction projects. The foregoing factors (among others) could cause actual results to differ materially from those set forth in the forward- looking statements. In accordance with the \"safe harbor\" provisions of the Private Securities Litigation Reform Act of 1995, Marathon Oil Corporation has included in its Annual Report on Form 10-K for the year ended December 31, 2004, and subsequent Forms 10-Q and 8-K, cautionary language identifying other important factors, though not necessarily all such factors, that could cause future outcomes to differ materially from those set forth in the forward-looking statements. Leann Vandergrift\/Lisa BoyetteMedia Relations949.349.7420\/3652 tel Ken LockwoodInvestor Relations949.349.3815 Media Relations, Leann Vandergrift, +1-949-349-7420, or LisaBoyette, +1-949-349-3652, or Investor Relations, Ken Lockwood,+1-949-349-3815, all of Fluor Corporation\/\/Web site: http:\/\/www.fluor.com \/","35":"Fluor Corporation's Senior Vice President and General Manager, Mining & Minerals, Dwayne Wilson, will give a presentation to investors at the Bear Stearns Annual Commodities and Capital Goods Conference in New York on Thursday, December 8, 2005, at 10:10 a.m., Eastern time. When: December 8, 2005 Time: 10:10 a.m., ET Where: Bear Stearns Headquarters383 Madison AvenueNew York City Fluor Corporation (NYSE: FLR) provides services on a global basis in the fields of engineering, procurement, construction, operations, maintenance and project management. Headquartered in Aliso Viejo, California, Fluor is a FORTUNE 500 company with revenues of $9.4 billion in 2004. For more information, visit www.fluor.com. Leann Vandergrift\/Lisa BoyetteMedia Relations949.349.7420\/3652 Ken LockwoodInvestor Relations949.349.3815 tel949.349.5375 fax Media, Leann Vandergrift, +1-949-349-7420, or Lisa Boyette,+1-949-349-3652, or Investors, Ken Lockwood, +1-949-349-3815, or fax,+1-949-349-5375, all of Fluor Corporation\/\/Web site: http:\/\/www.fluor.com \/","36":"In early 2004, Fluor Corporation (NYSE: FLR) issued $330 million principal amount of 1.5 percent senior convertible notes due 2024. The conversion of the notes into the company's common stock is contingent upon the share price reaching approximately $72.72, or a premium of 30 percent of the conversion trigger price of $55.94. Fluor announced today that it has exercised its right under the convertible notes indenture to pay in cash the principal amount of the notes presented for conversion. Any stock appreciation amount above the conversion trigger price of $55.94 will be satisfied by the company through the issuance of common stock. Statement of Financial Accounting Standards No. 128, \"Earnings per Share\" had been widely interpreted to allow the exclusion of common shares underlying contingently convertible debt instruments from the calculation of diluted earnings per share until the contingent conversion share price is reached (in Fluor's case, when the share price reaches approximately $72.72). In late 2004, the Emerging Issues Task Force of the Financial Accounting Standards Board reached a final consensus that the accounting for contingent convertible instruments should follow the same accounting treatment as traditional convertible instruments -- the \"if converted\" method of accounting -- and that the potential dilutive effect of the instrument should be included in diluted earnings per share immediately upon its issuance, but that principal amounts that must be settled entirely in cash may be excluded from the computations. This consensus becomes effective December 31, 2004. Fluor irrevocably elected to pay the principal amount of the convertible debentures in cash, and, therefore, there will be no dilutive impact until the average stock price exceeds the conversion trigger price of $55.94. Fluor will then use the treasury stock method of accounting for the difference between the market stock price in a quarter and $55.94. The shares required to cover this difference will be included in calculating diluted earnings per share. Previously reported diluted earnings per share for the first, second, and third quarters of 2004 will not change as a result of the application of the consensus. \"This election to pay the principal amount of the notes in cash is in line with Fluor's capital structure management strategy and reflective of our financial strength and business outlook,\" states Michael Steuert, Fluor Corporation's senior vice president and chief financial officer. Fluor Corporation (NYSE: FLR) provides services on a global basis in the fields of engineering, procurement, construction, operations, maintenance and project management. Headquartered in Aliso Viejo, California, Fluor is a FORTUNE 500 company with revenues of nearly $9 billion in 2003. For more information, visit www.fluor.com. Additional information can be found in press releases as well as Fluor's public periodic filings with the Securities and Exchange Commission. Note: This document contains forward-looking statements regarding, among other things, the Company's projected financial results and the expected performance of the Company's business. These forward-looking statements reflect current analysis of existing information. As a result, caution must be exercised in relying on forward-looking statements. Due to known and unknown risks, the Company's actual results may differ materially from its expectations or projections. Additional information concerning these and other factors can be found in press releases as well as periodic filings with the Securities and Exchange Commission, including the discussion under the heading \"Item 1. Business-Other Matters-Company Business Risks\" in the Company's Form 10-K filed March 15, 2004. These filings are available either publicly or upon request from Fluor's Investor Relations Department: (949) 349-3909. The Company disclaims any intent or obligation to update its forward-looking statements. For further information, please contact: Media Relations, Jerry Holloway, +1-949-349-7411, or Leann Vandergrift, +1-949-349-7420, or Investor Relations, Lila Churney, +1-949-349-3909, or fax, +1-949-349-5375, all of Fluor Corporation. media relations, Jerry Holloway, +1-949-349-7411, or LeannVandergrift, +1-949-349-7420, or investor relations, Lila Churney,+1-949-349-3909, or fax, +1-949-349-5375, all of Fluor Corporation\/\/Web site: http:\/\/www.fluor.com \/","37":"Fluor Corporation (NYSE: FLR) today announced that it has been selected by Sasol Ltd., to provide engineering, procurement and construction management services at its Natref refinery near Sasolburg, South Africa. Contract value to Fluor was not disclosed and was booked in the company's third quarter. The project will upgrade the refinery to produce diesel fuel with reduced sulfur content, in compliance with stricter South African clean fuels standards. Major construction is planned to begin early in 2005. \"Fluor has been working with Sasol for decades, and we're pleased to continue that relationship on this project. We look forward to providing value-added service to help Sasol meet their clean fuels compliance needs, an area in which Fluor is a global leader,\" said Jeff Faulk, president of Fluor's Energy & Chemicals group. Based in South Africa and operating in more than 30 other countries, Sasol is the leading provider of liquid fuels in South Africa and a major international producer of chemicals. Fluor Corporation (NYSE: FLR) provides services on a global basis in the fields of engineering, procurement, construction, operations, maintenance and project management. Headquartered in Aliso Viejo, Calif., Fluor is a FORTUNE 500 company with revenues of nearly $9 billion in 2003. For more information, visit www.fluor.com. Jerry Holloway\/Leann VandergriftMedia Relations949.349.7411\/7420 Lila ChurneyInvestor Relations949.349.3909 tel949.349.5375 fax Media Relations, Jerry Holloway, +1-949-349-7411, or LeannVandergrift, +1-949-349-7420, or Investor Relations, Lila Churney,+1-949-349-3909, or fax, +1-949-349-5375, all of Fluor Corporation\/\/Web site: http:\/\/www.fluor.com \/","38":"The consortium formed by Ishikawajima-Harima Heavy Industries (IHI) and ICA Fluor today announced that it has entered into a lump-sum, turnkey agreement with Terminal de LNG de Altamira S de RL de CV, for the construction of the first Mexican liquefied natural gas (LNG) regasification terminal. The contract value for the consortium is approximately US$ 250 million. The facility, to be located in the port of Altamira, Tamaulipas, on Mexico's Gulf coast, will have an initial capacity of 650 million cubic feet per day, with provisions for future expansion. The project will be constructed over 36 months and includes design, engineering, procurement, construction and start-up services. IHI is the consortium representative and the technical leader. ICA Fluor will act as the overall project manager and provide all local services. The facility will include LNG unloading and ship berthing facilities, storage consisting of two 150,000 cubic meter double containment LNG tanks, regasification, send-out installations and all related utilities. The engineering for the project will be done mainly in Mexico and will create regional employment opportunities for some 1,500 construction workers at the peak. Terminal de LNG de Altamira is a joint venture company owned by the Royal Dutch \/ Shell Group and the Total Group. IHI, founded in Japan in 1853, provides technology-oriented products and services to the industrial, private and public sectors and has a network of 33 offices and subsidiary companies acting worldwide. ICA Fluor is jointly owned by Fluor Corporation (NYSE: FLR) and Empresas ICA Sociedad Controladora (NYSE: ICA; BMV) and is the leading industrial engineering company in Mexico, dedicated to the engineering, procurement, and construction of telecommunication installations and chemical, petrochemical, automotive, refinery, electricity generation plants. Founded in Mexico in 1947, ICA has completed construction and engineering projects in 21 countries. ICA's principal business units include civil construction and industrial construction. Through its subsidiaries, ICA also manages airports and operates specialized port terminals, tunnels, highways, and municipal services under government concession contracts and\/or partial sale of long term contract rights. For more information, visit www.ica.com.mx Fluor Corporation (NYSE: FLR) provides services on a global basis in the fields of engineering, procurement, construction, operations, maintenance and project management. Headquartered in Aliso Viejo, Calif., Fluor is a Fortune 500 company with revenues of $10 billion in 2002. For more information, visit www.fluor.com For further information please contact: Media Relations, Jerry Holloway, +1-949-349-7411, or Lori Serrato, +1-949-349-7420, or Investor Relations, Lila Churney, +1-949-349-3909, fax +1-949-349-5375, all of Fluor Corporation Media Relations, Jerry Holloway, +1-949-349-7411, or LoriSerrato, +1-949-349-7420, or Investor Relations, Lila Churney,+1-949-349-3909, fax +1-949-349-5375, all of Fluor Corporation","39":"Fluor Corporation (NYSE: FLR) today announced that its team has been selected by Lukoil, one of Russia's largest oil companies, to build a crude oil and petroleum products export terminal on Vysotsky Island, near St. Petersburg, on the Gulf of Finland. Fluor and its consortium partner, Lukoil Neftegazstroy (LNGS), have signed a lump-sum turnkey engineering, procurement and construction contract for the project, which is expected to be complete in December 2004. LNGS is Lukoil's construction affiliate. Value of the contract to Fluor is $330 million. The terminal will enable Lukoil to export additional quantities of crude and oil products annually by December 2004. \"Fluor is very pleased to be working together with Lukoil Neftegazstroy to build this interesting and important project for Lukoil,\" said Jeff Faulk, Fluor's group president of Oil, Gas & Power. The project includes two tank farms, a marine jetty, a railroad station and dredging in the Gulf of Finland to allow for the passage of double-hulled crude and product ice-breaker tankers. The project will comply with the stringent international environmental standards set by the World Bank, the Overseas Private Investment Corporation, the Baltic Marine Environment Protection Commission and the International Maritime Organization. Under the scope of Fluor's technical services agreement with Lukoil, which preceded the engineering, procurement and construction contract, Fluor developed the project's environmental impact assessment, assisted in preparing other health, safety and environment documents, and recommended design modifications to ensure that the project complies with international environmental and safety standards, including those of the World Bank. Fluor was also Lukoil's exclusive financial consultant for the project. In this capacity, Fluor assisted Lukoil to structure and arrange the project's long-term financing. Financing consists of a 12-year, $225-million loan from HBK Fund LP, based in Dallas, Texas, to \"RPK -- Vysotsk LUKOIL II,\" the special purpose company owning the terminal. OPIC provided a $130-million loan guarantee, while Credit Suisse First Boston arranged the financing and provided a $75-million loan guarantee. Fluor Corporation (NYSE: FLR) provides services on a global basis in the fields of engineering, procurement, construction, operations, maintenance and project management. Headquartered in Aliso Viejo, Calif., Fluor is a Fortune 500 company with revenues of $10 billion in 2002. For more information, visit www.fluor.com . For further information, please contact Media Relations, Jerry Holloway, +1-949-349-7411, or Lori Serrato, +1-949-349-7420, or Investor Relations, Lila Churney, +1-949-349-3909, fax +1-949-349-5375, all of Fluor Corporation. Media Relations, Jerry Holloway, +1-949-349-7411, or LoriSerrato, +1-949-349-7420, or Investor Relations, Lila Churney,+1-949-349-3909, fax +1-949-349-5375, all of Fluor Corporation\/\/Web site: http:\/\/www.fluor.com \/","40":"ALISO VIEJO, Calif.--(BUSINESS WIRE)--ICA Fluor Daniel, the industrial engineering company jointly owned by Fluor Corporation (NYSE: FLR) and Empresas ICA Sociedad Controladora (NYSE: ICA), today announced the signing of a contract for the construction of a combined-cycle power plant in Gomez Palacios, Durango, Mexico. Awarded by Iberdrola Energia S.A., a subsidiary of Spain's Grupo Iberdrola, the plant has been named La Laguna II. The US$ 250 million plant will have a capacity of 498 megawatts and will provide electricity to the booming northern industrial zone of Mexico, as well as stabilizing the electrical grid in the area. Power generated will be sold to the Federal Electricity Commission (CFE), under its program to develop independent power producers (IPPs). The contract is a 30-month, lump-sum, turnkey project that involves engineering, procurement, construction and start-up services. The project is scheduled for completion in April 2005. \"This plant will be a clean, combined-cycle, gas-fired plant designed to have minimal environmental impact. It will meet the highest atmospheric emissions standards and have low water consumption by means of an air-cooled condenser. Additionally, the plant will conserve fresh water by recycling residential waste water,\" said Jorge Borja, general director of ICA Fluor Daniel. \"This project is the second power plant awarded by Iberdrola to ICA Fluor Daniel. Currently, ICA Fluor Daniel is constructing the 1,036 MW Altamira III-IV power plant on the Mexican Gulf Coast. This new contract ratifies Iberdrola's confidence in ICA Fluor Daniel's performance,\" he added. Grupo Iberdrola is one of the leading electricity companies in Europe. It has more than US$ 13 billion in assets, and has more than 13 million customers in Spain and Latin America. Grupo Iberdrola also operates in the energy, telecommunications, and real estate sectors. ICA Fluor Daniel is the leading industrial engineering company in Mexico, dedicated to the engineering, procurement, and construction of telecommunication installations and chemical, petrochemical, automotive, refinery, electricity generation plants. Founded in 1947, ICA has completed construction and engineering projects in 21 countries. ICA's principal business units include Civil Construction, and Industrial Construction. Through its subsidiaries, ICA also manages airports and operates specialized port terminals, tunnels, highways, and municipal services under government concession contracts and\/or partial sale of long term contract rights. Fluor Corporation (NYSE: FLR) provides services on a global basis in the fields of engineering, procurement, construction, operations, and maintenance and project management. Headquartered in Aliso Viejo, Calif., Fluor is a Fortune 500 company with revenues of $9 billion in fiscal year 2001. For more information, visit www.fluor.com. Jerry Holloway\/Lori Serrato Media Relations 949.349.7411\/.7420 tel Lila Churney Investor Relations 949.349.3909 tel 949.349.5375 fax Media Relations, Jerry Holloway, +1-949-349-7411, or Lori Serrato, +1-949-349-7420, or Investor Relations, Lila Churney, +1-949-349-3909, or fax, +1-949.349.5375, all of Fluor Corporation\/","41":"Fluor Corporation employees are celebrating 50 years of corporate and employee community involvement this month with a series of service projects around the world. In Chile and the United States that means building homes. In the Philippines, Puerto Rico, the Netherlands and England, they are providing toys and food to children in local hospitals and orphanages. Elsewhere, the efforts will include blood, book, food and clothing drives, and service projects for the elderly and the homeless. The activities are part of a global commemoration of the creation of the Fluor Foundation in 1952. The foundation began with a budget of $19,000, targeted at communities that were home to Fluor's major U.S. offices. Today, Fluor and the Fluor Foundation contribute $4 million to $5 million annually to educational and community organizations throughout the world. To date, total contributions exceed $100 million. Supporting Fluor employees' volunteer spirit is an important component of the foundation's focus. \"Our employees have a passion to build caring communities. The foundation gives employees a partner in giving and a structure for doing so,\" said Bob Fluor, vice president of Corporate and Public Affairs and Fluor Foundation president. \"Our employees have donated thousands of hours and completed hundreds of projects since the establishment of the Fluor volunteer program in 1976.\" \"We are a global company dedicated to having a positive impact on the communities we touch,\" said Alan Boeckmann, Fluor chairman and chief executive officer. \"Whether through corporate philanthropic giving, educational grants and scholarships or the generous volunteerism of our employees, we strive to make a difference in our communities.\" Fluor Corporation (NYSE: FLR) provides services on a global basis in the fields of engineering, procurement, construction, operations, maintenance and project management. Headquartered in Aliso Viejo, Calif., Fluor is a Fortune 500 company with revenues of $9 billion in fiscal year 2001. For more information, visit www.fluor.com. For further information please contact: Media Relations, Jerry Holloway, +1-949-349-7411, or Lori Serrato, +1-949-349-7420, or Investor Relations, Lila Churney, +1-949-349-3909, or fax, +1-949-349-5375, all of Fluor Corporation. Media Relations, Jerry Holloway, +1-949-349-7411, or Lori Serrato, +1-949-349-7420, or Investor Relations, Lila Churney, +1-949-349-3909, or fax, +1-949-349-5375, all of Fluor Corporation\/","42":"Fluor Corporation's (NYSE: FLR) Board of Directors today announced the appointment of Fluor and industry veteran Alan L. Boeckmann to the position of chairman and chief executive officer (CEO), effective February 6, 2002. Boeckmann, 53, succeeds current Fluor Chairman and CEO Philip J. Carroll Jr. In making the announcement, Carroll said, \"I have worked closely with Alan during my years at Fluor, and I am pleased that the board has approved my recommendation to appoint him to this important position. Given the company's strategic focus on its core capabilities in engineering, procurement, construction and maintenance (EPC&M), the board concluded that Alan's extensive industry experience, thorough knowledge of Fluor's operations and demonstrated leadership capabilities suit him well for directing the company. \"I have been impressed with his ability to work with the senior leadership team in forging a focused strategic vision for the company and building close relationships with our clients. I believe our company is ready for this succession of leadership,\" Carroll added. \"I am grateful for the significant opportunities I've been given during my 27 years with Fluor, and I am honored to have been selected to represent the considerable talent that Fluor employees represent,\" said Boeckmann. \"Our industry is entering a renewed growth phase, and Fluor is prepared to capitalize on the long-term up-cycle we see developing in many of the major markets we serve. We are committed to delivering the kind of performance that will make Fluor the undeniable leader within the global building and services marketplace and a superior investment for shareholders.\" Commenting on Carroll's tenure, Boeckmann said, \"The board and company are grateful to Phil for his significant contributions. He has accomplished what he came here to do. He was instrumental in redirecting the company's strategy and increasing its focus on clients. He led the separation of Massey Coal from Fluor, creating significant value for shareholders of both companies. Fluor's improved financial performance is a result of Phil's emphasis on fiscal discipline and focus on serving select clients for whom Fluor can deliver value. His work on succession planning and developing the next generation of management enabled this change now, and we are confident that Fluor will prosper as a result of the fundamental improvements he has implemented.\" During his tenure with Fluor, Boeckmann has held management positions of increasing responsibility, including assignments in California, Texas, South Carolina, South Africa and Venezuela. Since February 2001, he has been serving as president and chief operating officer of Fluor Corporation. Previously, Boeckmann served as president and CEO of Fluor Daniel, the engineering and construction unit of Fluor. He previously served as president of Fluor Daniel's Energy & Chemicals Group; Fluor Daniel's Chemicals, Plastics & Fibers Operating Company; and the Chemical Processes & Industrial Business Group. Prior to that, he served as vice president of the company's business unit that formed its DuPont alliance and as the functional leader of Engineering. Carroll, 64, has served as chairman and CEO of Fluor Corporation since 1998. Prior to joining Fluor, Carroll served 37 years with Shell Oil Company, retiring as its president and CEO. In another change, Vice Chairman Jim Stein, 58, is retiring from Fluor and its Board of Directors, effective January 2, 2002. Stein began his nearly 40-year career at Fluor as a management trainee in 1964. Since that time, he has held a variety of positions, including president and CEO of Fluor Global Services; president and chief operating officer of Fluor Daniel, and group president of Diversified Services. Fluor Corporation provides services on a global basis in the fields of engineering, procurement, construction, operations, maintenance and project management. Headquartered in Aliso Viejo, California, Fluor is a Fortune 500 company with revenues of $10 billion in fiscal year 2000. Fluor is a publicly held corporation that trades under the symbol FLR on the New York Stock Exchange. Complete information about Fluor is available through the company's Internet site at www.fluor.com . Note: This release contains forward-looking statements, including statements relating to the expected performance of the Company's business. The forward-looking statements are based on current management expectations. Actual results may differ materially as a result of several factors, including, among other things, projected earning levels, the timely and successful implementation of strategic initiatives, difficulties or delays incurred in the execution of contracts and changes in global business, economic, political and social conditions. Caution must be exercised in relying on these and other forward-looking statements. Due to known and unknown risks, the Company's results may differ materially from its expectations and projections. Additional information concerning these and other factors can be found in press releases as well as the Company's public periodic filings with the Securities and Exchange Commission, including the discussion under the heading \"Item 5. Business -- Other Matters\" in the Company's Form 8-K filed on September 25, 2001. Such filings are available either publicly or upon request from Fluor's Investor Relations Department: (949) 349-3909. The Company disclaims any intent or obligation to update its forward-looking statements. EXECUTIVE PROFILE Alan L. BoeckmannChairman and Chief Executive OfficerFluor Corporation Alan L. Boeckmann is chairman and chief executive officer of Fluor Corporation, effective February 6, 2002. Prior to his current position, Boeckmann served as president and chief operating officer. He also has served as president and chief executive officer of Fluor Daniel, the engineering and construction unit of Fluor Corporation and president of Fluor Daniel's Energy & Chemicals Group, Fluor Daniel's Chemicals, Plastics & Fibers Operating Company, and the Chemical Processes & Industrial Business Group. Prior to that, he served as vice president of the company's business unit that formed its DuPont alliance and as the functional leader of Engineering. Since joining Fluor in 1974 as an engineer, Boeckmann has held various management positions, including assignments in California, Texas, South Carolina, South Africa and Venezuela. Active in a variety of business and professional organizations, Boeckmann, in addition to serving on Fluor's board, serves as a director of Burlington Northern Santa Fe, the American Petroleum Institute and the Business Council for International Understanding. Boeckmann was graduated from the University of Arizona with a degree in electrical engineering. Fluor Corporation provides services on a global basis in the fields of engineering, procurement, construction, operations, maintenance and project management. Headquartered in Aliso Viejo, California, Fluor is a Fortune 500 company with revenues of $10 billion in fiscal year 2000. Fluor is a publicly held corporation that trades under the symbol FLR on the New York Stock Exchange. Complete information about Fluor is available through the company's Internet site at www.fluor.com . MEDIA FACT SHEET Fluor Corporation Headquarters: One Enterprise DriveAliso Viejo, CA 92656-2606 Senior Executives: Alan L. Boeckmann (effective February 6, 2002)Chairman and Chief Executive Officer D. Michael SteuertSenior Vice President and Chief Financial Officer Internet URL: www.fluor.com Trading Symbol: FLR Stock Market: New York Stock Exchange Corporate Description: Fluor Corporation provides services on a global basis in he fields of engineering, procurement, construction, operations, maintenance and project management. Total Employees: 55,000 Fiscal Year Revenues: $10 billion for 2000 Shares Outstanding: 80,000,000 CORPORATE HISTORY Index of Past Leaders: J. Simon Fluor 1912-1944 Peter E. Fluor 1944-1947 Donald W. Darnell 1949-1952 J. Simon Fluor, Jr. 1952-1962 J. Robert Fluor 1962-1984 David S. Tappan, Jr. 1984-1990 Les G. McGraw 1991-1997 Peter J. Fluor 1997-1998 Philip J. Carroll, Jr. 1998-2002 Fluor CorporationMedia RelationsKeith Karpe, +1-949-349-7661Lori Serrato, +1-949-349-7420","43":"Fluor Corporation (NYSE: FLR) today reported that its Operations & Maintenance business unit has been selected to provide maintenance services at Kennecott Utah Copper's smelter in Copperton, Utah. Value of the contract, which was not disclosed, will be booked into Fluor's backlog in the first half of 2002, officials said. The Kennecott leadership team conducted an extensive search for a world-class organization that could optimize cost and increase equipment uptime while driving step-change improvement in the overall economics of the plant. According to officials at Kennecott, Fluor was selected because of its reputation as a recognized world leader in maintenance, its commitment to an injury-free workplace, and its willingness to accept a performance-based contract. Fluor's duties at the smelter will include full continuous maintenance services and reliability engineering. The company also will manage the site's maintenance contractors, as well as oversee planning, scheduling, monitoring, reporting and assessing routine maintenance, turnaround and small capital performance. Approximately 130 workers will perform this function, officials projected. \"We view this new relationship with Kennecott as one that will prove successful for both of our organizations on many levels, including management and operational expertise,\" said Fluor's John Hopkins, group executive, Global Services. \"We are confident that by efficiently carrying out our responsibilities at the smelter, the decision by Kennecott to outsource this work will be validated.\" In addition to leveraging Fluor's breadth of experience in this service industry, former Kennecott maintenance employees may apply for positions with Fluor, officials of both companies said. Fluor Corporation provides services on a global basis in the fields of engineering, procurement, construction, operations, maintenance, project management and business services. Headquartered in Aliso Viejo, California, Fluor is a Fortune 500 company with revenues of $10 billion in fiscal year 2000. Fluor is a publicly held corporation that trades under the symbol FLR on the New York Stock Exchange. Complete information about Fluor is available through the company's Internet site at www.fluor.com. For further information, please contact Keith Karpe, +1-949-349-7661, or Lori Serrato, +1-949-349-7420, both of Fluor Corporation Media Relations. Fluor CorporationKeith Karpe, +1-949-349-7661orLori Serrato, +1-949-349-7420","44":"Fluor Corporation (NYSE: FLR) today announced that results for November and December 2000, which will be reported as a separate \"stub\" period due to the company's change to a calendar fiscal year in 2001, will be impacted by an unusual compensation charge. As a result of its recent reverse spin off of Massey Energy, the \"stub\" period will reflect a charge for the conversion of existing \"old\" Fluor stock-based awards to \"new\" Fluor stock-based awards. Depending on the final closing price on December 31, Fluor expects the charge will be in the range of $13 million to $17 million after-tax, or $.17 to $.22 per share. Additionally, the company indicated that its first fiscal quarter, ending March 31, 2001, is expected to be in the range of $.35 to $.40 per share. Although the volume of new awards has been increasing, and the outlook remains encouraging, there is a time lag in the recognition of earnings resulting from recent bookings, particularly from large, multi-year projects. First quarter results also will be impacted by the ramp-up in expenses related to implementation of Fluor's new SAP system. Fluor confirms the full year expectation of $2 per share, with positive trends in new project bookings. This momentum will more positively impact earnings in the second half of the year. Additionally, the outlook for new awards remains favorable and expectations for 2001 and 2002 remain strong. With 2000 revenues of $10 billion, Fluor Corporation provides services on a global basis in the fields of engineering, procurement, construction, maintenance, operations, project management and business services. NOTE REGARDING FORWARD-LOOKING STATEMENTS: The foregoing release contains forward-looking statements regarding projected earnings levels, new awards and backlog levels and the implementation of strategic initiatives. Such forward-looking statements reflect current analysis of existing information. Caution must be exercised in relying on forward-looking statements. Due to known and unknown risks, the Company's actual results may differ materially from its expectations or projections. Factors potentially contributing to such differences include, among others: Changes in global business, economic, political and social conditions; The Company's failure to receive anticipated new contract awards; Customer cancellations of, or scope adjustments to, existing contracts; resulting in cost overruns or liabilities; Customer delays or defaults in making payments; Fluctuations in the demand for, and price of, coal and other natural resource commodities; Difficulties and delays incurred in the implementation of strategic initiatives; and Competition in the global engineering and construction industry. Greater than expected environmental costs and liabilities. The forward-looking statements are also based on various operating assumptions regarding, among other things, overhead costs and employment levels that may not be realized. While most risks affect only future costs or revenues anticipated by the Company, some risks may relate to accruals that have already been reflected in earnings. The Company's failure to receive payments of accrued amounts could result in a charge against future earnings. Additional information concerning these and other factors can be found in press releases as well as Fluor's public periodic filings with the Securities and Exchange Commission, including the discussion under the heading \"Item 1. Business -- Other Matters -- Company Business Risks\" in Fluor's Form 10-K for its fiscal year ended October 31, 1999, and in Fluor's Definitive Proxy Statement on Schedule 14A that was filed with the Securities and Exchange Commission on September 21, 2000. Such filings are available either publicly or upon request from Fluor's Investor Relations Department: (949) 349-3909. Fluor disclaims any intent or obligation to update its forward-looking statements. For further information, please contact Lila Churney, 949-349-3909, or media relations, Keith Karpe, 949-349-7661, or Lori Serrato, 949-349-7420, all of Fluor Corporation.","45":"Fluor Corporation today announced that, with the recent conclusion of its spinoff from \"old\" Fluor Corporation (now Massey Energy Company), \"new\" Fluor expects to announce its first quarterly dividend in early March 2001, payable in late March 2001. As previously announced, \"new\" Fluor intends to change its fiscal year-end from October 31 to December 31, and will announce results for an interim, two-month period ending December 31, 2000. The announcement for the interim period will be made in late January. As previously disclosed, and in accordance with past policy, Fluor intends to pay an overall annual dividend of 30 to 35 percent of the company's long-term operating performance expectations. It is expected that each calendar year's dividends will be paid on a quarterly basis in March, June, September and December. With 2000 revenues of $10 billion, Fluor Corporation provides services on a global basis in the fields of engineering, procurement, construction, maintenance, operations, project management and business services. From December 1 through December 21, 2000, \"new\" Fluor shares are tradeable on the New York Stock Exchange under the symbol \"FLR-WI.\" After that date, the symbol will revert to \"FLR.\" For further information, please contact Keith Karpe, Media Relations, 949-349-7661, or Lori Serrato, Media Relations, 949-349-7420, both of Fluor Corporation. Keith Karpe, Media Relations, 949-349-7661, or Lori Serrato, Media Relations, 949-349-7420, both of Fluor Corporation","46":"Media relations personnel from global engineering and construction giant Fluor Corp. (NYSE:FLR) are available to immediately comment on the company's worldwide Year 2000 status during the Y2K \"click over.\" The firm will be monitoring its global operations from its Aliso Viejo headquarters beginning at 5 a.m. on Friday, Dec. 31, 1999. It will receive reports from its 50 worldwide offices beginning with Australia at 5 a.m., Friday, Dec. 31, and then circling the globe some 19 hours later to California. Spokespersons will be available throughout the weekend on a 24 hour basis. Reporters are invited to contact the following, around the clock from 5 a.m., Friday, Dec. 31, 1999 to Jan. 3, 2000 for comment and status updates. Keith Karpe Lori Serrato Fluor Media Relations Fluor Media Relations 949\/637-2309 cell 949\/500-4137 cell 888\/639-3025 pager 888\/608-8947 pager Fluor Corp., with 1999 revenues of $12.4 billion, conducts business on a global basis in the fields of engineering, procurement and construction, global services and coal production. Fluor Corp., Aliso ViejoMedia RelationsKeith Karpe949\/637-2309 (cell)888\/639-3025 (pager)orLori Serrato949\/500-4137 (cell)888\/608-8947 (pager)","47":"Fluor Corp. (NYSE:FLR), in another sign of its improving business outlook and continuing financial strength, Wednesday declared an increase in its quarterly cash dividend. During a board of directors' meeting in Houston, the company declared a quarterly dividend of 25 cents per share on Fluor common stock, compared with 20 cents in fiscal 1999. First quarter dividends are payable Jan. 12, 2000 to holders of record on Dec. 22, 1999. \"As we strive to achieve stronger financial performances from our global operations through the implementation of our new strategic direction, it is our objective to tangibly reward our loyal shareholders with increased cash dividends and share appreciation,\" said Philip J. Carroll, chairman and chief executive officer. \"In further support of this desire, our dividend policy is being changed for the first time in many years.\" According to Fluor officials, dividend amounts now will be based on long-term operating performance expectations, compared with the company's previous practice of basing dividend levels on the prior year's performance. In addition, the guideline dividend payout range will be increased to 30-35 percent from the previous 25-30 percent. \"The new dividend policy is another step toward achieving the goals we have set in our new strategic direction,\" said Ralph Hake, executive vice president and chief financial officer. \"Our major goal is to create value for our shareholders, which includes a cash return component, while, at the same time, maintaining a strong financial position. \"We believe in stable, consistent dividend payments with increases, when warranted, within the new policy,\" Hake added. Fluor Corp., with 1999 revenues of $12.4 billion, conducts business on a global basis in the fields of engineering, procurement and construction, global services, and coal production. Fluor has headquarters in Aliso Viejo and trades on the New York Stock Exchange under the symbol FLR. \"Safe Harbor\" Provision On Forward-Looking Statements The foregoing release contains forward-looking statements regarding projected earnings levels, cost reductions, new awards and backlog levels and the implementation of strategic initiatives. Such forward-looking statements reflect current analysis of existing information. Caution must be exercised in relying on forward-looking statements. Due to known and unknown risks, the company's actual results may differ materially from its expectations or projections. Factors potentially contributing to such differences include, among others: -- Changes in global business, economic, political and social conditions; -- The company's failure to receive anticipated new contract awards; -- Customer cancellations of, or scope adjustments to, existing contracts; -- Difficulties or delays incurred in the execution of construction contracts resulting in cost overruns or liabilities; -- Customer delays or defaults in making payments; -- Fluctuations in the demand for, and price of, coal and other natural resource commodities; -- Difficulties and delays incurred in the implementation of strategic initiatives; and -- Competition in the global engineering and construction industry. The forward-looking statements are also based on various operating assumptions regarding, among other things, overhead costs and employment levels that may not be realized. While most risks affect only future costs or revenues anticipated by the company, some risks may relate to accruals that have already been reflected in earnings. The company's failure to receive payments of accrued amounts could result in a charge against future earnings. Additional information concerning factors that may influence the company's results can be found in its news releases as well as its periodic filings with the Securities and Exchange Commission. In this regard, risk factors are specifically discussed under the heading \"Item I. Business -- Other Matters -- Fluor Business Risks\" in the company's Form 10-K filed Jan. 22, 1999. Such filings are available publicly and upon request from Fluor's Investor Relations Department: 949\/349-3909. The company disclaims any intent or obligation to update its forward-looking statements. Fluor Corp., Aliso ViejoKeith Karpe (media relations), 949\/349-7661orLori Serrato (media relations), 949\/349-7420orLila Churney (investor relations), 949\/349-3909","48":"American Equipment Company (AMECO), the wholly owned equipment rental and sales subsidiary of Fluor Corp., Wednesday announced that it obtained full ownership of Maquinaria Panamericana, S.A. de C.V. (MAPSA) from Grupo ICA on Nov. 30, 1998. MAPSA will continue to operate under its current name. In June 1997, AMECO acquired a majority share -- 65 percent -- of MAPSA from Grupo ICA. The transaction cost was not material to Fluor. A leading provider of equipment services in Mexico, MAPSA is a proprietary dealer for several premier manufacturers of construction, mining and industrial machinery, with offices in Mexico City, Guadalajara, Puebla, Villahermosa, and three parts-and-service locations in remote regions of Mexico. Fluor Corp. (NYSE:FLR) is one of the world's leading engineering, construction, maintenance, technical and diversified services companies, and is a major producer of low-sulfur coal. In 1998, Fluor Corp.'s sales were $13.5 billion.","49":"Fluor Corp. (NYSE: FLR) Thursday announced that Frederick J. Grigsby, Jr., 51, has been elected by its board of directors to the position of senior vice president of Human Resources and Administration. He joined Fluor earlier this month and has a companywide focus on its Human Resources activities. \"Fred brings a great deal of energy and proven leadership skills to the Human Resources organization,\" said Fluor's Chairman and Chief Executive Officer Philip J. Carroll. \"Our overall objective is to ensure that our Human Resources policies and practices support the strategic direction of the company. \"Fred adds an external perspective to our Human Resources activities. His skills and experiences are highly complementary to our current team of seasoned, experienced Human Resources executives.\" Grigsby started his 29-year business career with the Westinghouse Electric Corp., moving through positions of increasing responsibilities. During his tenure at Westinghouse, he led innovative, global human resources programs and restructuring initiatives. Since 1995, he has held the position of vice president, Human Resources, for Thermo King Corp., a wholly owned subsidiary of Westinghouse, which was acquired by Ingersoll-Rand in 1997. He succeeds Chuck Bradley, a 40-year Fluor employee and its current vice president of Human Resources and Administration, who will retire at the end of the year. Grigsby will formally assume his role at that time. Grigsby and his wife, Cheryl, and their sons, Quentin and Kevin, will relocate to Southern California from Minneapolis. Fluor Corp. is a global engineering, construction, maintenance and diversified services company, and a major producer of low-sulfur coal.","50":"Fluor Corporation announced today that the primary objective of its newly created Office Of The Chairman is to accelerate ongoing actions focused on building shareholder value. As part of this direction, the company has reconfirmed its commitment to the engineering, construction, maintenance and technical services businesses conducted through Fluor Daniel, as well as to its A.T. Massey Coal Company business. An analysis of strategic alternatives for certain Fluor Daniel units, such as its equipment leasing subsidiary--American Equipment Company--will be undertaken immediately. The company's investment in growing American Equipment during the last three years has generated significant value and earnings growth. Global prospects for American Equipment's continued growth offer additional investment opportunities. Even though American Equipment has proven to be an excellent source of income, the company concluded that continued ownership in the current form is not strategically essential to Fluor Daniel's engineering and construction activities. The company's strategic alternatives analysis will determine whether increasing shareholder value is best served by continued ownership of and investment in American Equipment, or by some form of divestiture or restructuring. The company expects that it will conclude its analysis within 120 days. In the event of any sale or restructuring, the company intends to apply the after-tax proceeds to the repurchase of its stock, if market conditions remain appropriate. The company remains optimistic about growth prospects for its businesses. The key focus for Fluor Daniel's engineering, construction, maintenance and technical services businesses will be to improve margins through selectivity, project execution and cost management. To increase profitability, Fluor Daniel has implemented a number of new initiatives, including the elimination of matrix decision-making, strengthening of sales and marketing to enhance selectivity, and the consolidation of several operating units to further reduce overhead expenses. A.T. Massey will continue to build on its present growth strategy through self-funded investment in Central Appalachia coal properties, as well as other opportunities for broader utilization of its technical and operational expertise. Pending completion of its strategic analysis, the company's capital budget for fiscal year 1998 has been set at approximately $450 million, which, based on current cash-flow projections, can be funded from internally generated operating cash flow. This level compares with approximately $650 million in fiscal year 1997. During the past three years, the company has invested approximately $1.5 billion in the growth of its Fluor Daniel and A.T. Massey units. The establishment of a base-load level for the 1998 capital budget is consistent with the company's enhanced focus on selectivity and is considered to be sufficient to support future earnings growth. In addition to any share repurchases which may occur as a result of strategic actions, the company intends to continue its ongoing share repurchase program. Since the beginning of this calendar year, the company has repurchased approximately 950,000 shares. In order to continue this program, the Fluor Corporation Board of Directors has supplemented the company's unused share repurchase authorization to a new total of 10 million shares. The company's financial condition remains strong. Cash and marketable securities balances at year-end 1997 were in excess of $300 million, and approximately $300 million in long-term debt represented less than 15 percent of total long-term capital. This financial strength gives the company the flexibility to continue to invest in selected capital expenditures and acquisitions, while maintaining a strong credit rating. The company's financial condition serves as a solid foundation upon which to enhance its competitive advantages, invest for future earnings growth and launch its strategic initiatives which are focused on enhancing shareholder value. Fluor Corporation (NYSE: FLR) is a global engineering, construction and diversified services company with an investment in low-sulfur coal. NOTE: Any of the comments in this press release that refer to the company's estimated or future results, including its statements concerning projected operating profit for fiscal 1998, margins on existing or future projects, long-term profitability and demand and growth trends for A.T. Massey, are forward-looking and reflect the company's current analysis of existing trends and information. Actual results may differ materially from current expectations or projections based on a number of factors affecting the company's businesses. The company's estimates of future performance depend on, among other things, the likelihood of receiving certain new awards. While these estimates are based on the good faith judgment of management, these estimates frequently change based on new facts which become available. In addition, the timing of receipt of revenue by the company from engineering and construction projects can be affected by a number of factors outside the control of the company. The dollar amount of the company's backlog as stated at any given time is not necessarily indicative of the future earnings of the company related to the performance of such work. Cancellations or scope adjustments related to contracts reflected in the company's backlog can occur. The company's businesses are also subject to fluctuations in demand and to changing global economic and political conditions which are beyond the control of the company and may cause actual results to differ from forward-looking statements. Additionally, coal operations produce a commodity which is internationally traded and the price of which is established by market factors outside the control of the company. Other risk factors affecting the company's estimated or future results include, but are not limited to, cost overruns on fixed, maximum or unit priced contracts, contract performance risk, the uncertain timing of awards and revenues under contracts, project financing risk, credit risk, risks associated with government funding of contracts, market conditions impacting realization of investments, market conditions in the domestic and international coal market and relatively mild weather conditions which may lower demand for steam coal. These forward-looking statements represent the company's judgment only as of the date of this press release. As a result, the reader is cautioned not to rely on these forward-looking statements. The company disclaims any intent or obligation to update these forward-looking statements. Additional information concerning these and other factors can be found in press releases as well as the company's public periodic filings with the Securities and Exchange Commission, including the discussion under the heading \"Certain Factors and Trends Affecting Fluor and its Businesses -- Forward-Looking Statements\" in the company's Form 8-K filed May 6, 1997. These filings are available publicly and upon request from Fluor's Investor Relations Department: (714) 975-3909.","51":"At its regular meeting today, Fluor Corporation's Board of Directors declared a quarterly cash dividend increase of one cent to 20 cents per share on the company's common stock. The quarterly dividend rate will be payable on January 13, 1998, to holders of record at the close of business on December 23, 1997. Fluor Corporation (NYSE: FLR) is a global engineering, construction and diversified services company with an investment in low-sulfur coal.","52":"Fluor Corporation announced today that it filed a shelf registration statement with the Securities and Exchange Commission for the sale of up to $400 million of debt securities. The filing will enable Fluor to issue debt from time to time during the next two years. Proceeds from any offering will be used for general corporate purposes, which may include working capital requirements, capital expenditures and possible acquisitions. This release shall not constitute an offer to sell or the solicitation of an offer to buy nor shall there be any sale of these securities in any state in which such offer, solicitation or sale would be unlawful prior to registration or qualification under the securities laws of any such state. The offering will be made only by means of a prospectus. Fluor Corporation is a global engineering, construction and diversified services company with an investment in low-sulfur coal.","53":"Fluor Daniel Inc. and Mitsubishi Heavy Industries (MHI) announced today that they have received an order for project specification preparation work for Malaysia s third liquefied natural gas (LNG) project. The total project and Fluor Daniel s contract values were not disclosed. This is the first major LNG project win for the joint venture, which was set up in March 1995. The preparation of project specification and other design work will be carried out by Fluor Daniel B.V. s office in Haarlem, The Netherlands. Completion of this phase of the project is planned for September 1997. When fully operational, the plant which is owned and operated by Malaysia LNG Tiga Sdn Bhd will produce 6.8 million tons of LNG annually. This success for our joint venture with MHI is an important one. We were delighted to win this project in competition with more than four leading international competitors, said Jake Easton, president of Fluor Daniel s Petroleum & Petrochemicals operating company. We know this contract represents a breakthrough for our new joint venture, and it will help position us to win future LNG projects. Mitsubishi Heavy Industries, headquartered in Tokyo, Japan, is a major engineering and construction company for large scale plants, and supplies a wide spectrum of machinery and equipment throughout the world. Fluor Daniel Inc., the principal subsidiary of Fluor Corporation, is a global engineering, construction and diversified services company with more than 80 offices worldwide."},"url":{"0":"https:\/\/newsroom.fluor.com\/news-releases\/news-details\/2022\/Fluor-Awarded-Engineering-Procurement-and-Construction-Management-Services-Contract-for-Ilukas-Eneabba-Rare-Earths-Refinery-in-Australia\/default.aspx","1":"https:\/\/newsroom.fluor.com\/news-releases\/news-details\/2022\/Fluor-Selected-for-Interstate-35-Capital-Express-South-Project-in-Austin-Texas\/default.aspx","2":"https:\/\/newsroom.fluor.com\/news-releases\/news-details\/2021\/Fluor-Led-JV-Completes-A9-Roadways-Project-in-Amsterdam\/default.aspx","3":"https:\/\/newsroom.fluor.com\/news-releases\/news-details\/2021\/Fluor-Backed-NuScale-Power-Signs-Agreement-to-Accelerate-Small-Modular-Reactor-Commercialization\/default.aspx","4":"https:\/\/newsroom.fluor.com\/news-releases\/news-details\/2020\/Stork-Awarded-Maintenance-Contract-by-Sitech-in-the-Netherlands\/default.aspx","5":"https:\/\/newsroom.fluor.com\/news-releases\/news-details\/2020\/Fluor-Reports-Third-Quarter-2020-Results\/default.aspx","6":"https:\/\/newsroom.fluor.com\/news-releases\/news-details\/2019\/COOEC-Fluor-Completes-Module-Program-for-KIPIC-Al-Zour-Project-in-Kuwait\/default.aspx","7":"https:\/\/newsroom.fluor.com\/news-releases\/news-details\/2019\/Fluor-Led-Joint-Venture-Opens-Loop-202-South-Mountain-Freeway-Project\/default.aspx","8":"https:\/\/newsroom.fluor.com\/news-releases\/news-details\/2018\/Fluor-Set-to-Modernize-Red--Purple-Rail-Lines-in-Chicago\/default.aspx","9":"https:\/\/newsroom.fluor.com\/news-releases\/news-details\/2018\/Fluor-Selected-for-Lithium-and-Boron-Mine-Project-in-Nevada\/default.aspx","10":"https:\/\/newsroom.fluor.com\/news-releases\/news-details\/2017\/Power-on-the-Way-to-Major-Urban-Areas-as-Fluor-Completes-Work-on-Priority-Lines-in-Puerto-Rico\/default.aspx","11":"https:\/\/newsroom.fluor.com\/news-releases\/news-details\/2017\/Fluor-Selected-as-FEMAs-Zone-1-Contractor-for-its-Technical-Assistance-Contracts-IV\/default.aspx","12":"https:\/\/newsroom.fluor.com\/news-releases\/news-details\/2016\/Fluor-to-Design-and-Build-2-Billion-Diabetes-API-Manufacturing-Facility-for-Novo-Nordisk-in-North-Carolina\/default.aspx","13":"https:\/\/newsroom.fluor.com\/news-releases\/news-details\/2016\/Fluor-Led-Team-Completes-Tappan-Zee-Bridge-Towers\/default.aspx","14":"https:\/\/newsroom.fluor.com\/news-releases\/news-details\/2015\/Fluor-Agrees-to-Acquire-Stork-Holding-BV-a-Global-Industrial-Services-Company\/default.aspx","15":"https:\/\/newsroom.fluor.com\/news-releases\/news-details\/2015\/Fluor-Garners-UK-Binding-Corporate-Rules-Approval-for-Secure-Employee-and-Client-Data\/default.aspx","16":"https:\/\/newsroom.fluor.com\/news-releases\/news-details\/2014\/AMECO-Celebrates-Grand-Opening-of-its-New-Global-Headquarters\/default.aspx","17":"https:\/\/newsroom.fluor.com\/news-releases\/news-details\/2014\/Fluor-Begins-Work-on-ExxonMobil-Antwerp-Refinery-Delayed-Coker-Project-in-Belgium\/default.aspx","18":"https:\/\/newsroom.fluor.com\/news-releases\/news-details\/2013\/Fluor-to-Provide-Consulting-Services-for-Kuwait-Oil-Company-Projects\/default.aspx","19":"https:\/\/newsroom.fluor.com\/news-releases\/news-details\/2013\/Fluors-NuScale-Power-Awarded-US-DOE-Funding-to-Advance-Nuclear-Small-Modular-Reactor-Technology\/default.aspx","20":"https:\/\/newsroom.fluor.com\/news-releases\/news-details\/2012\/Fluor-Team-Selected-for-Tappan-Zee-Bridge-Replacement-in-New-York\/default.aspx","21":"https:\/\/newsroom.fluor.com\/news-releases\/news-details\/2012\/Fluors-John-Hopkins-Assumes-Role-of-Chairman-and-CEO-of-NuScale-Power\/default.aspx","22":"https:\/\/newsroom.fluor.com\/news-releases\/news-details\/2011\/Fluor-Awarded-Base-Operations-Support-Contract-by-US-Navy-for-Jacksonville-Area-Bases\/default.aspx","23":"https:\/\/newsroom.fluor.com\/news-releases\/news-details\/2011\/Fluor-Signs-MOU-with-Clean-Line-Energy-for-800-Mile-Transmission-Line\/default.aspx","24":"https:\/\/newsroom.fluor.com\/news-releases\/news-details\/2010\/Retired-Army-Lieutenant-General-Richard-A-Hack-Joins-Fluors-Government-Group\/default.aspx","25":"https:\/\/newsroom.fluor.com\/news-releases\/news-details\/2010\/Fluor-Team-Achieves-Financial-Close-on-Windsor-Essex-Parkway\/default.aspx","26":"https:\/\/newsroom.fluor.com\/news-releases\/news-details\/2009\/Utah-DOT-Selects-Fluor-Led-Team-for-11-Billion-Major-Expansion-of-I-15-Corridor\/default.aspx","27":"https:\/\/newsroom.fluor.com\/news-releases\/news-details\/2009\/National-Safety-Council-Selects-AMECO-for-Best-Safety-Performance\/default.aspx","28":"https:\/\/newsroom.fluor.com\/news-releases\/news-details\/2008\/Fluor-Honored-by-Hart-Energy\/default.aspx","29":"https:\/\/newsroom.fluor.com\/news-releases\/news-details\/2008\/Fluor-Forms-New-Business-Unit-to-Focus-on-Offshore-Market\/default.aspx","30":"https:\/\/newsroom.fluor.com\/news-releases\/news-details\/2007\/Fluor-Transurban-Consortium-and-VDOT-Sign-Contract-to-Design-Build-and-Operate-I-495-HOT-Lanes\/default.aspx","31":"https:\/\/newsroom.fluor.com\/news-releases\/news-details\/2007\/Fluor-to-Present-at-the-Bear-Stearns-Annual-Commodities-and-Capital-Goods-Conference\/default.aspx","32":"https:\/\/newsroom.fluor.com\/news-releases\/news-details\/2006\/Fluor-Opens-Northeast-Region-Office-Employs-200-Professionals\/default.aspx","33":"https:\/\/newsroom.fluor.com\/news-releases\/news-details\/2006\/AMECO-Celebrates-15-Million-Safe-Work-Hours\/default.aspx","34":"https:\/\/newsroom.fluor.com\/news-releases\/news-details\/2005\/Fluor-Awarded-Front-end-Engineering-Contract-for-Louisiana-Refinery-Expansion\/default.aspx","35":"https:\/\/newsroom.fluor.com\/news-releases\/news-details\/2005\/Fluor-to-Present-at-the-Bear-Stearns-Annual-Commodities-and-Capital-Goods-Conference\/default.aspx","36":"https:\/\/newsroom.fluor.com\/news-releases\/news-details\/2004\/Fluor-Corporation-Exercises-Rights-Under-Convertible-Notes-Indenture\/default.aspx","37":"https:\/\/newsroom.fluor.com\/news-releases\/news-details\/2004\/Fluor-Selected-By-Sasol-to-Upgrade-South-African-Refinery\/default.aspx","38":"https:\/\/newsroom.fluor.com\/news-releases\/news-details\/2003\/Ishikawajima-Harima-Heavy-Industries-Co-Ltd--ICA-Fluor-Consortium-Awarded-First-LNG-Terminal-in-Mexico\/default.aspx","39":"https:\/\/newsroom.fluor.com\/news-releases\/news-details\/2003\/Fluor-and-Lukoil-Neftegazstroy-to-Build-Russian-Oil-Products-Export-Terminal\/default.aspx","40":"https:\/\/newsroom.fluor.com\/news-releases\/news-details\/2002\/ICA-Fluor-Daniel-Signs-Contract-to-Build-498-MW-Power-Plant-for-Iberdrola\/default.aspx","41":"https:\/\/newsroom.fluor.com\/news-releases\/news-details\/2002\/Fluor-Celebrates-50-Years-of-Community-Service\/default.aspx","42":"https:\/\/newsroom.fluor.com\/news-releases\/news-details\/2001\/Fluor-Appoints-Alan-Boeckmann-Chairman-and-Chief-Executive-Officer\/default.aspx","43":"https:\/\/newsroom.fluor.com\/news-releases\/news-details\/2001\/Fluor-Selected-by-Kennecott-to-Provide-Maintenance-Services-at-Utah-Smelter\/default.aspx","44":"https:\/\/newsroom.fluor.com\/news-releases\/news-details\/2000\/Fluor-Provides-Guidance-on-Stub-Period-and-First-Quarter\/default.aspx","45":"https:\/\/newsroom.fluor.com\/news-releases\/news-details\/2000\/New-Fluor-Corporation-Announces-Dividend-Schedule-for-2001\/default.aspx","46":"https:\/\/newsroom.fluor.com\/news-releases\/news-details\/1999\/Fluor-Corp-Media-Relations-Officials-Available-To-Comment-on-Y2K-Status-Throughout-New-Years-Weekend\/default.aspx","47":"https:\/\/newsroom.fluor.com\/news-releases\/news-details\/1999\/Fluor-Corp-Raises-Quarterly-Dividend-Signals-Change-in-Long-Term-Strategy\/default.aspx","48":"https:\/\/newsroom.fluor.com\/news-releases\/news-details\/1998\/American-Equipment-Company-Acquires-Full-Interest-in-Mexicos-Maquinaria-Panamericana-SA-de-CV\/default.aspx","49":"https:\/\/newsroom.fluor.com\/news-releases\/news-details\/1998\/Fluor-Corporation-Appoints-Senior-Vice-President-of-Human-Resources\/default.aspx","50":"https:\/\/newsroom.fluor.com\/news-releases\/news-details\/1997\/Fluor-Corporation-Announces-Strategic-Alternatives-Analysis\/default.aspx","51":"https:\/\/newsroom.fluor.com\/news-releases\/news-details\/1997\/Fluor-Corporation-Board-Declares-Quarterly-Dividend\/default.aspx","52":"https:\/\/newsroom.fluor.com\/news-releases\/news-details\/1996\/Fluor-Announces-SEC-Filing\/default.aspx","53":"https:\/\/newsroom.fluor.com\/news-releases\/news-details\/1996\/Fluor-Daniel-And-Mitsubishi-Heavy-Industries-Win-First-Major-LNG-Contract\/default.aspx"},"thumbnail":{"0":"https:\/\/s1.q4cdn.com\/746290702\/files\/doc_multimedia\/cc4837a6-431e-4438-a9e7-3eb3ed3feb99.jpg","1":"https:\/\/s1.q4cdn.com\/746290702\/files\/doc_multimedia\/FLR-full.jpg","2":"https:\/\/s1.q4cdn.com\/746290702\/files\/doc_multimedia\/Voltooing_Certificaat_024.jpg","3":"https:\/\/s1.q4cdn.com\/746290702\/files\/doc_multimedia\/FLR-full.jpg","4":"https:\/\/s1.q4cdn.com\/746290702\/files\/doc_multimedia\/ST06573.jpg","5":"https:\/\/s1.q4cdn.com\/746290702\/files\/doc_multimedia\/FLR-full.jpg","6":"https:\/\/s1.q4cdn.com\/746290702\/files\/doc_multimedia\/2019\/12\/1\/DJI_0067.jpg","7":"https:\/\/s1.q4cdn.com\/746290702\/files\/doc_multimedia\/2019\/12\/1\/202_and_I-10_Interchange.jpg","8":"https:\/\/s1.q4cdn.com\/746290702\/files\/doc_multimedia\/FLR-full.jpg","9":"https:\/\/s1.q4cdn.com\/746290702\/files\/doc_multimedia\/FLR-full.jpg","10":"https:\/\/s1.q4cdn.com\/746290702\/files\/doc_multimedia\/2017\/12\/1\/Dec14_04.jpg","11":"https:\/\/s1.q4cdn.com\/746290702\/files\/doc_multimedia\/FLR-full.jpg","12":"https:\/\/s1.q4cdn.com\/746290702\/files\/doc_multimedia\/FLR-full.jpg","13":"https:\/\/s1.q4cdn.com\/746290702\/files\/doc_multimedia\/2016\/12\/1\/Topping_Off_Milestone.jpg","14":"https:\/\/s1.q4cdn.com\/746290702\/files\/doc_multimedia\/FLR-full.jpg","15":"https:\/\/s1.q4cdn.com\/746290702\/files\/doc_multimedia\/FLR-full.jpg","16":"https:\/\/s1.q4cdn.com\/746290702\/files\/doc_multimedia\/FLR-full.jpg","17":"https:\/\/s1.q4cdn.com\/746290702\/files\/doc_multimedia\/FLR-full.jpg","18":"https:\/\/s1.q4cdn.com\/746290702\/files\/doc_multimedia\/2013\/12\/1\/DG1687-063.jpg","19":"https:\/\/s1.q4cdn.com\/746290702\/files\/doc_multimedia\/FLR-full.jpg","20":"https:\/\/s1.q4cdn.com\/746290702\/files\/doc_multimedia\/FLR-full.jpg","21":"https:\/\/s1.q4cdn.com\/746290702\/files\/doc_multimedia\/FLR-full.jpg","22":"https:\/\/s1.q4cdn.com\/746290702\/files\/doc_multimedia\/FLR-full.jpg","23":"https:\/\/s1.q4cdn.com\/746290702\/files\/doc_multimedia\/FLR-full.jpg","24":"https:\/\/s1.q4cdn.com\/746290702\/files\/doc_multimedia\/FLR-full.jpg","25":"https:\/\/s1.q4cdn.com\/746290702\/files\/doc_multimedia\/FLR-full.jpg","26":"https:\/\/s1.q4cdn.com\/746290702\/files\/doc_multimedia\/FLR-full.jpg","27":"https:\/\/s1.q4cdn.com\/746290702\/files\/doc_multimedia\/FLR-full.jpg","28":"https:\/\/s1.q4cdn.com\/746290702\/files\/doc_multimedia\/FLR-full.jpg","29":"https:\/\/s1.q4cdn.com\/746290702\/files\/doc_multimedia\/FLR-full.jpg","30":"https:\/\/s1.q4cdn.com\/746290702\/files\/doc_multimedia\/FLR-full.jpg","31":"https:\/\/s1.q4cdn.com\/746290702\/files\/doc_multimedia\/FLR-full.jpg","32":"https:\/\/s1.q4cdn.com\/746290702\/files\/doc_multimedia\/FLR-full.jpg","33":"https:\/\/s1.q4cdn.com\/746290702\/files\/doc_multimedia\/FLR-full.jpg","34":"https:\/\/s1.q4cdn.com\/746290702\/files\/doc_multimedia\/FLR-full.jpg","35":"https:\/\/s1.q4cdn.com\/746290702\/files\/doc_multimedia\/FLR-full.jpg","36":"https:\/\/s1.q4cdn.com\/746290702\/files\/doc_multimedia\/FLR-full.jpg","37":"https:\/\/s1.q4cdn.com\/746290702\/files\/doc_multimedia\/FLR-full.jpg","38":"https:\/\/s1.q4cdn.com\/746290702\/files\/doc_multimedia\/FLR-full.jpg","39":"https:\/\/s1.q4cdn.com\/746290702\/files\/doc_multimedia\/FLR-full.jpg","40":"https:\/\/s1.q4cdn.com\/746290702\/files\/doc_multimedia\/FLR-full.jpg","41":"https:\/\/s1.q4cdn.com\/746290702\/files\/doc_multimedia\/FLR-full.jpg","42":"https:\/\/s1.q4cdn.com\/746290702\/files\/doc_multimedia\/FLR-full.jpg","43":"https:\/\/s1.q4cdn.com\/746290702\/files\/doc_multimedia\/FLR-full.jpg","44":"https:\/\/s1.q4cdn.com\/746290702\/files\/doc_multimedia\/FLR-full.jpg","45":"https:\/\/s1.q4cdn.com\/746290702\/files\/doc_multimedia\/FLR-full.jpg","46":"https:\/\/s1.q4cdn.com\/746290702\/files\/doc_multimedia\/FLR-full.jpg","47":"https:\/\/s1.q4cdn.com\/746290702\/files\/doc_multimedia\/FLR-full.jpg","48":"https:\/\/s1.q4cdn.com\/746290702\/files\/doc_multimedia\/FLR-full.jpg","49":"https:\/\/s1.q4cdn.com\/746290702\/files\/doc_multimedia\/FLR-full.jpg","50":"https:\/\/s1.q4cdn.com\/746290702\/files\/doc_multimedia\/FLR-full.jpg","51":"https:\/\/s1.q4cdn.com\/746290702\/files\/doc_multimedia\/FLR-full.jpg","52":"https:\/\/s1.q4cdn.com\/746290702\/files\/doc_multimedia\/FLR-full.jpg","53":"https:\/\/s1.q4cdn.com\/746290702\/files\/doc_multimedia\/FLR-full.jpg"},"author":{"0":"FLUOR","1":"FLUOR","2":"FLUOR","3":"FLUOR","4":"FLUOR","5":"FLUOR","6":"FLUOR","7":"FLUOR","8":"FLUOR","9":"FLUOR","10":"FLUOR","11":"FLUOR","12":"FLUOR","13":"FLUOR","14":"FLUOR","15":"FLUOR","16":"FLUOR","17":"FLUOR","18":"FLUOR","19":"FLUOR","20":"FLUOR","21":"FLUOR","22":"FLUOR","23":"FLUOR","24":"FLUOR","25":"FLUOR","26":"FLUOR","27":"FLUOR","28":"FLUOR","29":"FLUOR","30":"FLUOR","31":"FLUOR","32":"FLUOR","33":"FLUOR","34":"FLUOR","35":"FLUOR","36":"FLUOR","37":"FLUOR","38":"FLUOR","39":"FLUOR","40":"FLUOR","41":"FLUOR","42":"FLUOR","43":"FLUOR","44":"FLUOR","45":"FLUOR","46":"FLUOR","47":"FLUOR","48":"FLUOR","49":"FLUOR","50":"FLUOR","51":"FLUOR","52":"FLUOR","53":"FLUOR"}}